&НаКлиенте
Процедура УстановитьПараметрыСписков()
	ПолеОтбора = Новый ПолеКомпоновкиДанных("Подразделение");
	
	СоответсвиеПодразделений.Отбор.Элементы.Очистить();
	ЭлементОтбора = СоответсвиеПодразделений.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = ПолеОтбора;
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ПравоеЗначение = ?(ЗначениеЗаполнено(Объект.Ссылка),Объект.Ссылка,Неопределено);
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьПараметрыСписков();
КонецПроцедуры


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	УстановитьПараметрыСписков();
КонецПроцедуры

