
&НаКлиенте
Процедура ПолучитьТекущийКоординатыТС(Команда)
	ПолучитьТекущиеКоординатыТСНаСервере();
КонецПроцедуры

// Получает данные для РС уатТекущееМестоположениеТСПоМониторингу, уатКоординатыПоМониторингу
&НаСервере
Процедура ПолучитьТекущиеКоординатыТСНаСервере()
	
	SDL_ФортМонитор.ПолучитьДанныеКоординатПоМониторингу(Истина, Истина);
	
КонецПроцедуры

Функция Удалить_СоответствияТС(МассивИдентификаторов)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	уатТС.Ссылка КАК ТС,
		|	уатТС.ИДвСистемеНавигации КАК ИДвСистемеНавигации
		|ИЗ
		|	Справочник.уатТС КАК уатТС
		|ГДЕ
		|	уатТС.ИДвСистемеНавигации В (&МассивИдентификаторов)";
	
	Запрос.УстановитьПараметр("МассивИдентификаторов", МассивИдентификаторов);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервере
Процедура ПолучитьСписокТСНаСервере()
	
	МассивОтветаСервиса = SDL_РаботаСHTTPСервисами.ПолучитьСписокТС();
	ТаблицаТС = SDL_ФортМонитор.МассивСтруктурВТаблицуЗначений(МассивОтветаСервиса);

	Построитель = Новый ПостроительОтчета;
	Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТаблицаТС);       
	Построитель.Вывести(ТабДокТС);

	Если СоздаватьНовыеТС Тогда 
		отладка_СоздатьТС(ТаблицаТС);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСписокТС(Команда)
	ПолучитьСписокТСНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура РС_уатТекущееМестоположениеТСПоМониторингу(Команда)
	
	ОткрытьФорму("РегистрСведений.уатТекущееМестоположениеТСПоМониторингу.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура РС_уатПробегРасходПоМониторингу(Команда)
	
	ОткрытьФорму("РегистрСведений.уатПробегРасходПоМониторингу.ФормаСписка");
	
КонецПроцедуры
	
	


&НаСервере
Процедура отладка_СоздатьТС(ТаблицаТС)
	
	SDL_ФортМонитор.ПреобразоватьКолонкуВТип_Строка(ТаблицаТС, "VehicleID");
	
	Для Каждого ТС из ТаблицаТС Цикл 
		
		НайденноеТС = Справочники.уатТС.НайтиПоРеквизиту("ИДвСистемеНавигации", ТС.Строка_VehicleID);
		Если ЗначениеЗаполнено(НайденноеТС) Тогда 
			Продолжить;
		КонецЕсли;
		
		НовыйТС = Справочники.уатТС.СоздатьЭлемент();
		НовыйТС.ОбменДанными.Загрузка = Истина;
		НовыйТС.ИДвСистемеНавигации = ТС.Строка_VehicleID; //Формат(ТС.VehicleID, "ЧРГ=");
		НовыйТС.Наименование = ТС.Number;
		
		Сообщить("Создано новое ТС:" + НовыйТС.Наименование);
		
		НовыйТС.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьСписокДоступныхОтчетовНаСервере()
	
	СтруктураОтчетов = SDL_РаботаСHTTPСервисами.ПолучитьСписокДоступныхОтчетов();
	Таблица = SDL_ФортМонитор.СписокОтчетовВТаблицуЗначений(СтруктураОтчетов);
	ЗначениеВРеквизитФормы(Таблица, "ТаблицаОтчетов");
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСписокДоступныхОтчетов(Команда)
	ПолучитьСписокДоступныхОтчетовНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ГенерацияОтчетаСинхронная(Команда)
	
	ТекущиеДанныеОтчетов = Элементы.ТаблицаОтчетов.ТекущиеДанные;
	
	Если ТекущиеДанныеОтчетов <> Неопределено Тогда 
		
		ИдентификаторОтчета = ТекущиеДанныеОтчетов.Id;
		ГенерацияОтчетаСинхроннаяНаСервере(ИдентификаторОтчета);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ГенерацияОтчетаСинхроннаяНаСервере(ИдентификаторОтчета)
	
	ТаблицаДанных.Очистить();
	
	МассивОтветаСервиса = SDL_РаботаСHTTPСервисами.ПолучитьСписокТС();
	
	ТаблицаТС = SDL_ФортМонитор.МассивСтруктурВТаблицуЗначений(МассивОтветаСервиса);
	МассивТС = ТаблицаТС.ВыгрузитьКолонку("VehicleID");

	СтруктураОтчета = SDL_РаботаСHTTPСервисами.ЗапросОтчета(ИдентификаторОтчета, МассивТС, ДатаНачала, КонецДня(ДатаОкончания));
	
	Если СтруктураОтчета <> Неопределено Тогда 
		
		ТаблицаОтчета = SDL_ФортМонитор.ОтчетВТаблицуЗначений(СтруктураОтчета);
		
		Построитель = Новый ПостроительОтчета;
		Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТаблицаОтчета);       
		Построитель.Вывести(ТаблицаДанных);

	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура УчетнаяЗаписьФортМонитор(Команда)
	
	Настройки = SDL_ФортМонитор.НастройкиФортМонитор();
	УчетнаяЗапись = Настройки.УчетнаяЗапись;
	ПараметрыОткрытия = Новый Структура("Ключ", УчетнаяЗапись);
	ОткрытьФорму("Справочник.уатУчетныеЗаписиСистемыМониторинга.ФормаОбъекта", ПараметрыОткрытия);
	
КонецПроцедуры


&НаКлиенте
Процедура уатКоординатыПоМониторингу(Команда)
	
	ОткрытьФорму("РегистрСведений.уатКоординатыПоМониторингу.ФормаСписка");
	
КонецПроцедуры


&НаКлиенте
Процедура уатДополнительныеСведенияПоGPS(Команда)
	
	ОткрытьФорму("РегистрСведений.уатДополнительныеСведенияПоGPS.ФормаСписка");
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ДатаОтчета = ТекущаяДата();
	ДатаНачала = НачалоДня(ДатаОтчета) - 24*60*60*3;
	ДатаОкончания = КонецДня(ДатаОтчета);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОтчетовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ГенерацияОтчетаСинхронная(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить_уатДополнительныеСведенияПоGPS(Команда)
	Заполнить_уатДополнительныеСведенияПоGPSНаСервере();
КонецПроцедуры

&НаСервере
Процедура Заполнить_уатДополнительныеСведенияПоGPSНаСервере()
	
	SDL_ФортМонитор.Заполнить_уатДополнительныеСведенияПоGPS();
	
КонецПроцедуры

&НаСервере
Процедура Заполнить_уатПробегРасходПоМониторингуНаСервере()

	SDL_ФортМонитор.Заполнить_уатПробегРасходПоМониторингу();
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить_уатПробегРасходПоМониторингу(Команда)
	Заполнить_уатПробегРасходПоМониторингуНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Заполнить_уатКоординатыПоМониторингу(Команда)
	Заполнить_уатКоординатыПоМониторингуНаСервере();
КонецПроцедуры

&НаСервере
Процедура Заполнить_уатКоординатыПоМониторингуНаСервере()
	
	ДатаОкончания = ТекущаяДата();
	ДатаНачала = ДатаНачала - 60*60*24;
	
	МассивТС = SDL_ФортМонитор.ВсеТСФортМонитор();
	
	SDL_ФортМонитор.Заполнить_уатКоординатыПоМониторингу_ПоОтчетуНавигационный(ДатаНачала, ДатаОкончания, МассивТС);
	
КонецПроцедуры
