Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Наименование = СокрЛП(Наименование);
	
	Если ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Наименование) Тогда
		ОбщегоНазначения.СообщитьПользователю("Укажите наименование хранимого значения.", ЭтотОбъект, "Наименование", , Отказ);
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ХранимыеЗначения.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Бит_ХранимыеЗначения КАК ХранимыеЗначения
	|ГДЕ
	|	ХранимыеЗначения.Наименование = &Наименование
	|	И НЕ ХранимыеЗначения.ПометкаУдаления
	|	И ХранимыеЗначения.Ссылка <> &Ссылка";
	
	Если Не Запрос.Выполнить().Пустой() Тогда
		ОбщегоНазначения.СообщитьПользователю(
			"Хранимое значение с наименованием """ + Наименование + """ уже есть.",
			ЭтотОбъект, "Наименование", , Отказ);
	КонецЕсли;
	
КонецПроцедуры
