
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отчет.Период = НачалоМесяца(ТекущаяДата());
	мДатаНачалаПериодаОтчета = НачалоМесяца(Отчет.Период);
	мДатаКонцаПериодаОтчета  = КонецМесяца(Отчет.Период);

	СтрПериодОтчета = ПредставлениеПериода(НачалоДня(мДатаНачалаПериодаОтчета), КонецДня(мДатаКонцаПериодаОтчета), "ФП = Истина" );
	// Покажем период в диалоге
	ЭтаФорма.Элементы.НадписьПериод.Заголовок = СтрПериодОтчета;

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПериод() ЭКСПОРТ
	
	СтрПериодОтчета = ПредставлениеПериода(НачалоДня(мДатаНачалаПериодаОтчета), КонецДня(мДатаКонцаПериодаОтчета), "ФП = Истина" );
	// Покажем период в диалоге
	ЭтаФорма.Элементы.НадписьПериод.Заголовок = СтрПериодОтчета;
	
КонецПроцедуры // ПоказатьПериод()

&НаКлиенте
Процедура УстановитьПериод(Шаг)
	
	мДатаКонцаПериодаОтчета  = КонецМесяца(ДобавитьМесяц(мДатаКонцаПериодаОтчета, Шаг)); 
	мДатаНачалаПериодаОтчета = НачалоМесяца(мДатаКонцаПериодаОтчета);
	
	Отчет.Период = мДатаНачалаПериодаОтчета;
	
	ПоказатьПериод();
	
КонецПроцедуры

&НаКлиенте
Процедура ПролистатьПериодВМинус(Команда)
	УстановитьПериод(-1);
КонецПроцедуры

&НаКлиенте
Процедура ПролистатьПериодВПлюс(Команда)
	УстановитьПериод(1);
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()

	
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры
