Перем ВведенКопированием Экспорт;
////////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходимое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
	
	//ТабДок = Новый ТабличныйДокумент;	
	//
	//ЗапросШапка = Новый Запрос;
	//ЗапросШапка.Текст = 
	//	"";
	//
	//ЗапросШапка.УстановитьПараметр("Ссылка", Ссылка);
	//
	//Шапка = ЗапросШапка.Выполнить().Выбрать();
	//
	//Шапка.Следующий();

	//Макет = ПолучитьМакет("");
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"";
	//
	//Запрос.Параметры.Вставить("Ссылка",Ссылка);
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	//ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	//ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	//ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
	//ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");
	//
	//ТабДок.Очистить();
	//
	//ОбластьЗаголовок.Параметры.Заголовок = " ";
	//	
	//ТабДок.Вывести(ОбластьЗаголовок);
	//ТабДок.Вывести(ОбластьШапкаТаблицы);
	//ТабДок.НачатьАвтогруппировкуСтрок();
	//
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
	//	ТабДок.Вывести(ОбластьДетальныхЗаписей, ВыборкаДетальныеЗаписи.Уровень());
	//КонецЦикла;
	//
	//ТабДок.ЗакончитьАвтогруппировкуСтрок();
	//
	//ТабДок.Вывести(ОбластьПодвалТаблицы);
	//
	//ТабДок.Вывести(ОбластьПодвал);
	//
	//// Получить экземпляр документа на печать
	//УниверсальныеМеханизмы.НапечататьДокумент(ТабДок, КоличествоЭкземпляров, НаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект,"Кадровое перемещение "), НепосредственнаяПечать);
	
КонецПроцедуры // Печать

// Возвращает доступные варианты печати документа
//
// Возвращаемое значение:
//  Структура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	//Возврат Новый Структура("","");
	
КонецФункции // ПолучитьСтруктуруПечатныхФорм()

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ВведенКопированием = Истина;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ГрафикРаботыАвтотранспорта.ВидОперации,
	|	ГрафикРаботыАвтотранспорта.Автомобиль,
	|	ГрафикРаботыАвтотранспорта.Контрагент,
	|	ГрафикРаботыАвтотранспорта.Договор,
	|	ГрафикРаботыАвтотранспорта.Адрес,
	|	ГрафикРаботыАвтотранспорта.НачПериода,
	|	ГрафикРаботыАвтотранспорта.КонПериода,
	|	ГрафикРаботыАвтотранспорта.КоличествоКонтейнеров
	|ИЗ
	|	Документ.ГрафикРаботыАвтотранспорта_ЮЦАУ КАК ГрафикРаботыАвтотранспорта
	|ГДЕ
	|	ГрафикРаботыАвтотранспорта.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаШапка = РезультатЗапроса.Выбрать();
	
	Если  ВыборкаШапка.Следующий() Тогда
		
		Движение = Движения.ГрафикРаботыТранспорта_ЮЦАУ.Добавить();
		Движение.Период = Дата;
		Движение.Автомобиль = Автомобиль;
		Движение.Договор = Договор;
		Движение.Контрагент = Контрагент;
		Движение.Адрес = Адрес;
		Движение.КоличествоКонтейнеров = КоличествоКонтейнеров;
		
		Если ВыборкаШапка.ВидОперации = Перечисления.ВидГрафикаРаботыАвтотранспорта.ПоДнямНедели Тогда
			Движение.Понедельник = Понедельник;
			Движение.Вторник = Вторник;
			Движение.Среда = Среда;
			Движение.Четверг = Четверг;
			Движение.Пятница = Пятница;
			
		ИначеЕсли ВыборкаШапка.ВидОперации = Перечисления.ВидГрафикаРаботыАвтотранспорта.ПоКалендарю Тогда	
			Движение.ГрафикИзКалендаря = Ссылка;
		КонецЕсли;	
		
	КонецЕсли;

КонецПроцедуры







