
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Справочники.ИсточникиДанныхДляРасчетовБюджетирования.ЗаполнитьДеревоРегистров(ДеревоРегистров);
	ДЗ = РеквизитФормыВЗначение("ДеревоРегистров",Тип("ДеревоЗначений"));
	//	ДЗ = Новый ДеревоЗначений;
	ДЗ.Строки.Найти(Параметры.ТекущееЗначение,"",Истина);
	// не плохо бы спозиционироваться на нужной строке но пока не получается
	//Элементы.ДеревоРегистров.ТекущаяСтрока = 11;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоРегистровВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтрокаДерева = ДеревоРегистров.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Если СтрокаДерева.ПолучитьЭлементы().Количество() > 0 Тогда
		Если Элементы.ДеревоРегистров.Развернут(ВыбраннаяСтрока) Тогда
			Элементы.ДеревоРегистров.Свернуть(ВыбраннаяСтрока);
		Иначе
			Элементы.ДеревоРегистров.Развернуть(ВыбраннаяСтрока);
		КонецЕсли;
		Возврат;	
	КонецЕсли;
	
	СтруктураОтвета = Новый СТруктура("ИмяРегистра,ПредставлениеРегистра",СтрокаДерева.Регистр,СтрокаДерева.ПредставлениеПоля);
	Закрыть(СтруктураОтвета);
КонецПроцедуры
