Функция ЕстьРасчетыСКонтрагентами(ВидОперации=Неопределено) Экспорт
	
	Если ВидОперации=Неопределено Тогда 
		Возврат Ложь;
	Иначе
		Возврат  ВидОперации = Перечисления.ВидыОперацийЗаявкиНаРасходование.ОплатаПоставщику
		ИЛИ ВидОперации = Перечисления.ВидыОперацийЗаявкиНаРасходование.ВозвратДенежныхСредствПокупателю
		ИЛИ ВидОперации = Перечисления.ВидыОперацийЗаявкиНаРасходование.ПрочиеРасчетыСКонтрагентами;
				
	КонецЕсли;
	
КонецФункции // ЕстьРасчетыСКонтрагентами()


// Возвращает курс валюты по сценарию на дату
//
//
// Параметры:
//  Валюта    - Валюта (элемент справочника "Валюты")
//  ДатаКурса - Дата, на которую следует получить курс
//  Сценарий (элемент справочника "Сценарии") - сценарий планирования
//
// Возвращаемое значение: 
//  Курс, с учетом кратности
//
Функция КурсВалютыПоСценарию(Валюта, ДатаКурса, Сценарий) Экспорт

	СтруктураОтбора=Новый Структура;
	СтруктураОтбора.Вставить("Валюта", Валюта);
	
	Если Сценарий.ИспользоватьКурсыСценария Тогда
		СтруктураОтбора.Вставить("Сценарий", Сценарий);
        Структура = РегистрыСведений.КурсыВалютПоСценариям.ПолучитьПоследнее(ДатаКурса, СтруктураОтбора);
	Иначе
		Структура = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ДатаКурса, СтруктураОтбора);
	КонецЕсли;
	
	Возврат Структура;
	
КонецФункции // КурсВалютыПоСценарию()

// Возвращает структуру с курсами и кратностями для валют, переданных в качестве параметра
//
// Параметры
//  СтруктураГруппаВалют: Структура - Структура, содержащее валюты, для которых необходимо получить курсы
//	ДатаКурса: Дата - дата, на которую необходимо получить курсы.
//
// Возвращаемое значение:
//   СтруктураКурсыВалют: структура - структура, содержащая курсы для указанных валют.
//
Функция ПолучитьКурсыСценарияДляГруппыВалют(СтруктураГруппаВалют,ДатаКурса,Сценарий) Экспорт
	
	Запрос=Новый Запрос;
	СписокВалют=Новый СписокЗначений;
	
	Для каждого Валюта Из СтруктураГруппаВалют Цикл
	
		СписокВалют.Добавить(Валюта.Значение);
	
	КонецЦикла;
	
	ТекстЗапроса="ВЫБРАТЬ
	             |	КурсыВалютСрезПоследних.Курс КАК Курс,
	             |	КурсыВалютСрезПоследних.Кратность КАК Кратность,
	             |	КурсыВалютСрезПоследних.Валюта.Код КАК КодВалюты,
	             |	КурсыВалютСрезПоследних.Валюта.Ссылка КАК Валюта";
				 
	Если Сценарий.ИспользоватьКурсыСценария Тогда
		ТекстЗапроса=ТекстЗапроса+"
		|ИЗ
	    |	РегистрСведений.КурсыВалютПоСценариям.СрезПоследних(&ДатаКурса, (Валюта.Код В (&СписокВалют)) И (Сценарий=&Сценарий)) КАК КурсыВалютСрезПоследних";
	Иначе
		ТекстЗапроса=ТекстЗапроса+"
		|ИЗ
	    |	РегистрСведений.КурсыВалют.СрезПоследних(&ДатаКурса, Валюта.Код В (&СписокВалют)) КАК КурсыВалютСрезПоследних";
	КонецЕсли;
	
	Запрос.Текст=ТекстЗапроса;
	
	Запрос.УстановитьПараметр("ДатаКурса",ДатаКурса);
	Запрос.УстановитьПараметр("СписокВалют",СписокВалют);
	Запрос.УстановитьПараметр("Сценарий",Сценарий);
	
	СтруктураКурсыВалют=Новый Структура;

	Результат=Запрос.Выполнить().Выгрузить();;
		
	Для каждого Валюта Из СтруктураГруппаВалют Цикл
		
		СтрокаВалюта=Результат.Найти(Валюта.Значение,"КодВалюты");
		
		Если НЕ СтрокаВалюта=Неопределено Тогда
		   	СтруктураКурсыВалют.Вставить(Валюта.Ключ+"Курс",СтрокаВалюта.Курс);
			СтруктураКурсыВалют.Вставить(Валюта.Ключ+"Кратность",СтрокаВалюта.Кратность);
			СтруктураКурсыВалют.Вставить(Валюта.Ключ,СтрокаВалюта.Валюта);
		Иначе
			СтруктураКурсыВалют.Вставить(Валюта.Ключ+"Курс",0);
			СтруктураКурсыВалют.Вставить(Валюта.Ключ+"Кратность",0);
			СтруктураКурсыВалют.Вставить(Валюта.Ключ,Новый(Тип("СправочникСсылка.Валюты")));
		КонецЕсли;
		
	КонецЦикла; 		
	
	Возврат СтруктураКурсыВалют;

КонецФункции // УправлениеДенежнымиСредствами.ПолучитьКурсыДляГруппыВалют()

// Возвращает количество периодов между указанными датами
//
// Параметры
//  ДатаНачала, ДатаКонца: Дата  – границы интервала
//  Периодичность (Перечисления.Периодичность): периодичность планирования
//
// Возвращаемое значение:
//   КоличествоПериодов   – количество периодов в переданном интервале
//
Функция РассчитатьКоличествоПериодов(ДатаНачала,ДатаКонца,Периодичность) Экспорт
	
	Если ДатаНачала<ДатаКонца Тогда
		
		ИсходнаяДата=ДатаНачала;
		КонечнаяДата=ДатаКонца;
		Коэффициент=1;
		
	ИначеЕсли  ДатаНачала>ДатаКонца Тогда
		
		ИсходнаяДата=ДатаКонца;
		КонечнаяДата=ДатаНачала;
		Коэффициент=-1;
		
	ИначеЕсли ДатаНачала=ДатаКонца Тогда
		
		Возврат 0;
		
	КонецЕсли;
	
	
	КоличествоПериодов=0;
	ТекущаяДата=ИсходнаяДата;
	
	Пока ОбщегоНазначения.ДатаКонцаПериода(ТекущаяДата,Периодичность)<=КонецДня(КонечнаяДата) Цикл
		
		КоличествоПериодов=КоличествоПериодов+1;
		ТекущаяДата=ОбщегоНазначения.ДобавитьИнтервал(ТекущаяДата,Периодичность,1);
		
	КонецЦикла;
	
	Возврат КоличествоПериодов*Коэффициент;
	
КонецФункции // РассчитатьКоличествоПериодов()

// Возвращает текст фрагмента запроса с выборками по стандартным периодам
//
// Параметры
//	Периодичность(строка)	– периодичность выборки данных запроса
//  Период(строка)			- имя измерения, в котором хранится период данных
//
// Возвращаемое значение:
//   ТекстЗапросаПоПериодам   – текст фрагмента запроса
//
Функция СформироватьТекстЗапросаПоПериодам(Периодичность,Период) Экспорт
	
	СписокПериодов=Новый СписокЗначений;
	СписокПериодов.Добавить("День");
	СписокПериодов.Добавить("Неделя");
	СписокПериодов.Добавить("Месяц");
	СписокПериодов.Добавить("Квартал");
	СписокПериодов.Добавить("Год");
	
	ТекстЗапросаПоПериодам="";
	
	НачальныйИндекс=СписокПериодов.Индекс(СписокПериодов.НайтиПоЗначению(Периодичность));
	
	Для Сч=НачальныйИндекс По СписокПериодов.Количество()-1 Цикл
		
		ТекущаяПериодичность=СписокПериодов.Получить(Сч).Значение;
		ТекстЗапросаПоПериодам=ТекстЗапросаПоПериодам+"
		|НачалоПериода("+Период+", "+ТекущаяПериодичность+") КАК Период"+ТекущаяПериодичность+",";
	
	КонецЦикла;
	
	Возврат ТекстЗапросаПоПериодам;

КонецФункции // СформироватьТекстЗапросаПоПериодам()

// Функция формирует список для отбора источников данных, у которых в составе
// ТЧ "ИзмеренияДляРаспределения" есть выбранное измерение бюджетирования.
//
Функция СписокИсточниковДляИзмерения(ИзмерениеБюджетирования) Экспорт

	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ИсточникиДанныхДляРасчетовБюджетирования.Наименование
	|ИЗ
	|	Справочник.ИсточникиДанныхДляРасчетовБюджетирования КАК ИсточникиДанныхДляРасчетовБюджетирования
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИсточникиДанныхДляРасчетовБюджетирования.ИзмеренияИсточника КАК ИсточникиДанныхДляРасчетовБюджетированияИзмеренияИсточника
	|		ПО ИсточникиДанныхДляРасчетовБюджетирования.Ссылка = ИсточникиДанныхДляРасчетовБюджетированияИзмеренияИсточника.Ссылка
	|
	|ГДЕ
	|	ИсточникиДанныхДляРасчетовБюджетированияИзмеренияИсточника.ИзмерениеБюджетирования = &ИзмерениеБюджетирования";

	Запрос.УстановитьПараметр("ИзмерениеБюджетирования",ИзмерениеБюджетирования);

	СписокОтбора=Новый СписокЗначений;
    СписокОтбора.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Наименование"));
	
	Возврат СписокОтбора;


КонецФункции // СписокИсточниковДляИзмерения()

// Функция формирует список элементов перечисления, пропуская исключаемые
//
// Параметры
//  ИмяПеречисления - имя перечисления, как оно задано в конфигураторе
//  СтруктураИсключение - структура, содержащая имена перечислений, которые не должны попадать в список.
//
// Возвращаемое значение:
//   СписокЗначений - список элементов перечисления
//
Функция ПолучитьСписокЭлементовПеречисленияОтбор(ИмяПеречисления, СтруктураИсключение) Экспорт

	СписокЭлементовПеречисления = Новый СписокЗначений;
	
	Попытка
		КоллекцияЭлементовПеречисления = Метаданные.Перечисления[ИмяПеречисления].ЗначенияПеречисления;
	Исключение
		Возврат СписокЭлементовПеречисления;
	КонецПопытки;
	
	Для каждого ЭлементПеречисления Из КоллекцияЭлементовПеречисления Цикл
		
		Если НЕ СтруктураИсключение.Свойство(ЭлементПеречисления.Имя) Тогда		
			СписокЭлементовПеречисления.Добавить(Перечисления[ИмяПеречисления][ЭлементПеречисления.Имя], ЭлементПеречисления.Синоним);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СписокЭлементовПеречисления;

КонецФункции // ОбщегоНазначения.ПолучитьСписокЭлементовПеречисления()

// Проверяет наличие в системе курсов валют, необходимых для проведения документа
//
Процедура ПроверкаКурсовВалютСценарии(ТаблицаВалют,Отказ,Заголовок) Экспорт
	
	ВалютаУпрУчета= Константы.ВалютаРегламентированногоУчета.Получить();
	ТекстОшибки="";
	
	Для Каждого СтрокаВалюта ИЗ ТаблицаВалют Цикл
		
		// Проверяем наличие курсов для валют операций
		
		Если СтрокаВалюта.ИспользоватьКурсыСценария Тогда
			
			СтруктураОтбор=Новый Структура;
			СтруктураОтбор.Вставить("Валюта",СтрокаВалюта.Валюта);
			СтруктураОтбор.Вставить("Сценарий",СтрокаВалюта.Сценарий);
			СтруктураКурсов=РегистрыСведений.КурсыВалютПоСценариям.ПолучитьПоследнее(СтрокаВалюта.ДатаКурса,СтруктураОтбор);
			
		Иначе
			
			СтруктураОтбор=Новый Структура;
			СтруктураОтбор.Вставить("Валюта",СтрокаВалюта.Валюта);
			СтруктураКурсов=РегистрыСведений.КурсыВалют.ПолучитьПоследнее(СтрокаВалюта.ДатаКурса,СтруктураОтбор);
			
		КонецЕсли;
		
		Если СтруктураКурсов.Курс=NULL ИЛИ СтруктураКурсов.Курс=0 Тогда
			ТекстОшибки=ТекстОшибки+?(СтрДлина(ТекстОшибки)>0,Символы.ПС,"")+"Не указан курс валюты "+Строка(СтрокаВалюта.Валюта)+" на дату "+СтрокаВалюта.ДатаКурса;
		ИначеЕсли СтруктураКурсов.Кратность=NULL ИЛИ СтруктураКурсов.Кратность=0 Тогда
			ТекстОшибки=ТекстОшибки+?(СтрДлина(ТекстОшибки)>0,Символы.ПС,"")+"Не указана кратность валюты "+Строка(СтрокаВалюта.Валюта)+" на дату "+СтрокаВалюта.ДатаКурса;
		КонецЕсли;
		
		// Проверяем наличие курсов для валюты сценария
		
		Если НЕ СтрокаВалюта.Валюта=СтрокаВалюта.ВалютаСценария Тогда
			
			Если СтрокаВалюта.ИспользоватьКурсыСценария Тогда
				
				СтруктураОтбор=Новый Структура;
				СтруктураОтбор.Вставить("Валюта",СтрокаВалюта.ВалютаСценария);
				СтруктураОтбор.Вставить("Сценарий",СтрокаВалюта.Сценарий);
				СтруктураКурсов=РегистрыСведений.КурсыВалютПоСценариям.ПолучитьПоследнее(СтрокаВалюта.ДатаКурса,СтруктураОтбор);
				
			Иначе
				
				СтруктураОтбор=Новый Структура;
				СтруктураОтбор.Вставить("Валюта",СтрокаВалюта.ВалютаСценария);
				СтруктураКурсов=РегистрыСведений.КурсыВалют.ПолучитьПоследнее(СтрокаВалюта.ДатаКурса,СтруктураОтбор);
				
			КонецЕсли;
			
			Если СтруктураКурсов.Курс=NULL ИЛИ СтруктураКурсов.Курс=0 Тогда
				ТекстОшибки=ТекстОшибки+?(СтрДлина(ТекстОшибки)>0,Символы.ПС,"")+"Не указан курс валюты "+Строка(СтрокаВалюта.Валюта)+" на дату "+СтрокаВалюта.ДатаКурса;
			ИначеЕсли СтруктураКурсов.Кратность=NULL ИЛИ СтруктураКурсов.Кратность=0 Тогда
				ТекстОшибки=ТекстОшибки+?(СтрДлина(ТекстОшибки)>0,Символы.ПС,"")+"Не указана кратность валюты "+Строка(СтрокаВалюта.Валюта)+" на дату "+СтрокаВалюта.ДатаКурса;
			КонецЕсли;
			
		КонецЕсли;
		
		// Проверяем наличие курсов для валюты упр. учета
		
		Если НЕ СтрокаВалюта.Валюта=ВалютаУпрУчета Тогда
			
			Если СтрокаВалюта.ИспользоватьКурсыСценария Тогда
				
				СтруктураОтбор=Новый Структура;
				СтруктураОтбор.Вставить("Валюта",ВалютаУпрУчета);
				СтруктураОтбор.Вставить("Сценарий",СтрокаВалюта.Сценарий);
				СтруктураКурсов=РегистрыСведений.КурсыВалютПоСценариям.ПолучитьПоследнее(СтрокаВалюта.ДатаКурса,СтруктураОтбор);
				
			Иначе
				
				СтруктураОтбор=Новый Структура;
				СтруктураОтбор.Вставить("Валюта",ВалютаУпрУчета);
				СтруктураКурсов=РегистрыСведений.КурсыВалют.ПолучитьПоследнее(СтрокаВалюта.ДатаКурса,СтруктураОтбор);
				
			КонецЕсли;
			
			Если СтруктураКурсов.Курс=NULL ИЛИ СтруктураКурсов.Курс=0 Тогда
				ТекстОшибки=ТекстОшибки+?(СтрДлина(ТекстОшибки)>0,Символы.ПС,"")+"Не указан курс валюты "+Строка(СтрокаВалюта.Валюта)+" на дату "+СтрокаВалюта.ДатаКурса;
			ИначеЕсли СтруктураКурсов.Кратность=NULL ИЛИ СтруктураКурсов.Кратность=0 Тогда
				ТекстОшибки=ТекстОшибки+?(СтрДлина(ТекстОшибки)>0,Символы.ПС,"")+"Не указана кратность валюты "+Строка(СтрокаВалюта.Валюта)+" на дату "+СтрокаВалюта.ДатаКурса;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
		
	Если СтрДлина(ТекстОшибки)>0 Тогда
		ОбщегоНазначения.СообщитьОбОшибке(ТекстОшибки,Отказ,Заголовок);
	КонецЕсли;
	
КонецПроцедуры // ПроверкаКурсовВалют()

// Возвращает таблицу для проверки контролируемых значений
//
Функция СформироватьТаблицуДляКонтроля(Ссылка, СтруктураПараметров) Экспорт
	
	ЕстьРасчетыСКонтрагентами = СтруктураПараметров.ЕстьРасчетыСКонтрагентами;
	ЕстьРасчетыПоКредитам     = СтруктураПараметров.ЕстьРасчетыПоКредитам;
	
	ВидОперации    = СтруктураПараметров.ВидОперации;
	ДатаРасхода    = СтруктураПараметров.ДатаРасхода;
	ВалютаУпрУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	
	Если ЕстьРасчетыСКонтрагентами ИЛИ ЕстьРасчетыПоКредитам Тогда
		
		Запрос=Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		             |	РасшифровкаПлатежаДок.Ссылка.Сценарий КАК Сценарий,
		             |	РасшифровкаПлатежаДок.Ссылка.СтатьяОборотов КАК СтатьяОборотов,
		             |	РасшифровкаПлатежаДок.Ссылка.ЦФО КАК ЦФО,
		             |	РасшифровкаПлатежаДок.Ссылка.Контрагент КАК Контрагент,
		             |	РасшифровкаПлатежаДок.Ссылка.Номенклатура КАК Номенклатура,
		             |	РасшифровкаПлатежаДок.Проект КАК Проект,
		             |	СУММА(ВЫРАЗИТЬ(ВЫБОР
		             |				КОГДА РасшифровкаПлатежаДок.ДоговорКонтрагента.ВалютаВзаиморасчетов = &ВалютаУпрУчета
		             |					ТОГДА РасшифровкаПлатежаДок.СуммаВзаиморасчетов
		             |				КОГДА КурсыУпрУчета.Курс ЕСТЬ NULL 
		             |						ИЛИ РасшифровкаПлатежаДок.КурсВзаиморасчетов = 0
		             |					ТОГДА 0
		             |				КОГДА РасшифровкаПлатежаДок.ДоговорКонтрагента.ВалютаВзаиморасчетов <> &ВалютаУпрУчета
		             |						И КурсыУпрУчета.Курс <> 0
		             |						И РасшифровкаПлатежаДок.КурсВзаиморасчетов <> 0
		             |					ТОГДА РасшифровкаПлатежаДок.СуммаВзаиморасчетов * РасшифровкаПлатежаДок.КурсВзаиморасчетов * КурсыУпрУчета.Кратность / (КурсыУпрУчета.Курс * РасшифровкаПлатежаДок.КратностьВзаиморасчетов)
		             |				ИНАЧЕ 0
		             |			КОНЕЦ КАК ЧИСЛО(15, 2))) КАК СуммаУпр,
		             |	КурсыУпрУчета.Курс КАК КурсУпрУчета,
		             |	КурсыУпрУчета.Кратность КАК КратностьУпрУчета,
		             |	СУММА(РасшифровкаПлатежаДок.СуммаПлатежа) КАК СуммаПлатежа
		             |ИЗ
		             |	Документ.ЗаявкаНаРасходованиеСредств.РасшифровкаПлатежа КАК РасшифровкаПлатежаДок
		             |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаРасхода, Валюта = &ВалютаУпрУчета) КАК КурсыУпрУчета
		             |		ПО (ИСТИНА)
		             |ГДЕ
		             |	РасшифровкаПлатежаДок.Ссылка = &Ссылка
		             |
		             |СГРУППИРОВАТЬ ПО
		             |	РасшифровкаПлатежаДок.Ссылка.Сценарий,
		             |	РасшифровкаПлатежаДок.Ссылка.СтатьяОборотов,
		             |	РасшифровкаПлатежаДок.Ссылка.ЦФО,
		             |	РасшифровкаПлатежаДок.Ссылка.Контрагент,
		             |	РасшифровкаПлатежаДок.Ссылка.Номенклатура,
		             |	РасшифровкаПлатежаДок.Проект,
		             |	КурсыУпрУчета.Курс,
		             |	КурсыУпрУчета.Кратность";
		
		Запрос.УстановитьПараметр("ДатаРасхода", ДатаРасхода);
		Запрос.УстановитьПараметр("ВалютаУпрУчета", ВалютаУпрУчета);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		Возврат Запрос.Выполнить().Выгрузить();
		
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийЗаявкиНаРасходование.ВыдачаДенежныхСредствПодотчетнику
		ИЛИ ВидОперации = Перечисления.ВидыОперацийЗаявкиНаРасходование.РасчетыПоКредитамИЗаймамСРаботниками Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
		             |	РасшифровкаПлатежаДок.Ссылка.Сценарий КАК Сценарий,
		             |	РасшифровкаПлатежаДок.Ссылка.СтатьяОборотов КАК СтатьяОборотов,
		             |	РасшифровкаПлатежаДок.Ссылка.ЦФО КАК ЦФО,
		             |	РасшифровкаПлатежаДок.Ссылка.Контрагент КАК Контрагент,
		             |	РасшифровкаПлатежаДок.Ссылка.Номенклатура КАК Номенклатура,
		             |	РасшифровкаПлатежаДок.Проект КАК Проект,
		             |	СУММА(ВЫРАЗИТЬ(ВЫБОР
		             |				КОГДА РасшифровкаПлатежаДок.Ссылка.ВалютаВзаиморасчетовПодотчетника = &ВалютаУпрУчета
		             |					ТОГДА РасшифровкаПлатежаДок.СуммаВзаиморасчетов
		             |				КОГДА КурсыУпрУчета.Курс ЕСТЬ NULL 
		             |						ИЛИ РасшифровкаПлатежаДок.КурсВзаиморасчетов = 0
		             |					ТОГДА 0
		             |				КОГДА РасшифровкаПлатежаДок.Ссылка.ВалютаВзаиморасчетовПодотчетника <> &ВалютаУпрУчета
		             |						И КурсыУпрУчета.Курс <> 0
		             |						И РасшифровкаПлатежаДок.КурсВзаиморасчетов <> 0
		             |					ТОГДА РасшифровкаПлатежаДок.СуммаВзаиморасчетов * РасшифровкаПлатежаДок.КурсВзаиморасчетов * КурсыУпрУчета.Кратность / (КурсыУпрУчета.Курс * РасшифровкаПлатежаДок.КратностьВзаиморасчетов)
		             |				ИНАЧЕ 0
		             |			КОНЕЦ КАК ЧИСЛО(15, 2))) КАК СуммаУпр,
		             |	КурсыУпрУчета.Курс КАК КурсУпрУчета,
		             |	КурсыУпрУчета.Кратность КАК КратностьУпрУчета,
		             |	СУММА(РасшифровкаПлатежаДок.СуммаПлатежа) КАК СуммаПлатежа
		             |ИЗ
		             |	Документ.ЗаявкаНаРасходованиеСредств.РасшифровкаПлатежа КАК РасшифровкаПлатежаДок
		             |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаРасхода, Валюта = &ВалютаУпрУчета) КАК КурсыУпрУчета
		             |		ПО (ИСТИНА)
		             |ГДЕ
		             |	РасшифровкаПлатежаДок.Ссылка = &Ссылка
		             |
		             |СГРУППИРОВАТЬ ПО
		             |	РасшифровкаПлатежаДок.Ссылка.Сценарий,
		             |	РасшифровкаПлатежаДок.Ссылка.СтатьяОборотов,
		             |	РасшифровкаПлатежаДок.Ссылка.ЦФО,
		             |	РасшифровкаПлатежаДок.Ссылка.Контрагент,
		             |	РасшифровкаПлатежаДок.Ссылка.Номенклатура,
		             |	РасшифровкаПлатежаДок.Проект,
		             |	КурсыУпрУчета.Курс,
		             |	КурсыУпрУчета.Кратность";
		
		Запрос.УстановитьПараметр("ДатаРасхода", ДатаРасхода);
		Запрос.УстановитьПараметр("ВалютаУпрУчета", ВалютаУпрУчета);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		Возврат Запрос.Выполнить().Выгрузить();
		
	Иначе
		
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
		|	РасшифровкаПлатежаДок.Ссылка.Сценарий,
		|	РасшифровкаПлатежаДок.Ссылка.СтатьяОборотов,
		|	РасшифровкаПлатежаДок.Ссылка.ЦФО,
		|	РасшифровкаПлатежаДок.Ссылка.Контрагент,
		|	РасшифровкаПлатежаДок.Ссылка.Номенклатура,
		|	РасшифровкаПлатежаДок.Проект,
		|	РасшифровкаПлатежаДок.СуммаПлатежа
		|ИЗ
		|	Документ.ЗаявкаНаРасходованиеСредств.РасшифровкаПлатежа КАК РасшифровкаПлатежаДок
		|ГДЕ РасшифровкаПлатежаДок.Ссылка=&Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		Возврат Запрос.Выполнить().Выгрузить();
		
	КонецЕсли;
			
КонецФункции

//бывший ОбщегоНазначения
///////////////////////////////////////////////////////////////////////////////
// РАБОТА С ПЕРЕЧИСЛЕНИЕМ "ПЕРИОДИЧНОСТЬ"
// Функции не обрабатывают значения "Декада" и "Полугодие"

// Функция возвращает ближайшую дату начала периода планирования
//
// Параметры
//	Периодичность (Перечисления.Периодичность)	- периодичность планирования по сценарию.
//	ДатаВПериоде (Дата)							- произвольная дата
//
// Возвращаемое значение:
//	ДатаНачалаПериода		– ближайшая дата начала периода планирования
//
Функция ДатаНачалаПериода(ДатаВПериоде,Периодичность) Экспорт
	
	Если НЕ ТипЗнч(ДатаВПериоде)=Тип("Дата") Тогда
		Возврат '00010101';
	КонецЕсли;
	
	Если Периодичность=Перечисления.Периодичность.День Тогда
		Возврат НачалоДня(ДатаВПериоде);
	ИначеЕсли Периодичность=Перечисления.Периодичность.Неделя Тогда
		Возврат НачалоНедели (ДатаВПериоде);
	ИначеЕсли Периодичность=Перечисления.Периодичность.Месяц Тогда
		Возврат НачалоМесяца (ДатаВПериоде);
	ИначеЕсли Периодичность=Перечисления.Периодичность.Квартал Тогда
		Возврат НачалоКвартала (ДатаВПериоде);
	ИначеЕсли Периодичность=Перечисления.Периодичность.Год Тогда
		Возврат НачалоГода (ДатаВПериоде);
	Иначе
		Возврат НачалоДня(ДатаВПериоде);
	КонецЕсли;
		
КонецФункции // ДатаНачалаПериода()

// Функция возвращает ближайшую дату окончания периода планирования
//
// Параметры
//	Периодичность (Перечисления.Периодичность)	- периодичность планирования по сценарию.
//	ДатаВПериоде (Дата)							- произвольная дата
//
// Возвращаемое значение:
//	ДатаКонцаПериода	– ближайшая дата окончания периода планирования
//
Функция ДатаКонцаПериода(ДатаВПериоде,Периодичность) Экспорт
							
	Если Периодичность=Перечисления.Периодичность.День Тогда
		Возврат КонецДня(ДатаВПериоде);
	ИначеЕсли Периодичность=Перечисления.Периодичность.Неделя Тогда
		Возврат КонецНедели (ДатаВПериоде);
	ИначеЕсли Периодичность=Перечисления.Периодичность.Месяц Тогда
		Возврат КонецМесяца (ДатаВПериоде);
	ИначеЕсли Периодичность=Перечисления.Периодичность.Квартал Тогда
		Возврат КонецКвартала (ДатаВПериоде);
	ИначеЕсли Периодичность=Перечисления.Периодичность.Год Тогда
		Возврат КонецГода (ДатаВПериоде);
	Иначе
		Возврат КонецДня(ДатаВПериоде);
	КонецЕсли;
		
КонецФункции // ДатаКонцаПериода()

// Функция добавляет интервал к дате
//
// Параметры:
//	Периодичность (Перечисления.Периодичность)	- пнриодичность планирования по сценарию.
//	ДатаВПериоде (Дата)							- произвольная дата
//	Смещение (число)							- определяет направление и количество периодов, в котором сдвигается дата
//
// Возвращаемое значение:
//	Дата, отстоящая от исходной на заданное количество периодов 
//
Функция ДобавитьИнтервал(ДатаПериода,Периодичность,Смещение) Экспорт

	Если Смещение = 0 Тогда
		НоваяДатаПериода = ДатаПериода;
		
	ИначеЕсли Периодичность = Перечисления.Периодичность.День Тогда
		НоваяДатаПериода = НачалоДня(ДатаПериода + Смещение*24*3600);
		
	ИначеЕсли Периодичность = Перечисления.Периодичность.Неделя Тогда
		НоваяДатаПериода = ДатаПериода + Смещение*7*24*3600;
		
	ИначеЕсли Периодичность = Перечисления.Периодичность.Месяц Тогда
		НоваяДатаПериода = ДобавитьМесяц(ДатаПериода, Смещение);
		
	ИначеЕсли Периодичность = Перечисления.Периодичность.Квартал Тогда
		НоваяДатаПериода = ДобавитьМесяц(ДатаПериода, Смещение*3);
		
	ИначеЕсли Периодичность = Перечисления.Периодичность.Год Тогда
		НоваяДатаПериода = ДобавитьМесяц(ДатаПериода, Смещение*12);
		
	Иначе
		НоваяДатаПериода=НачалоДня(ДатаПериода) + Смещение*24*3600;
		
	КонецЕсли;

	Возврат НоваяДатаПериода;

КонецФункции // ДобавитьИнтервал()

// Возвращает число дней в переданном периоде
//
// Параметры
//  Периодичность – Перечисление.Периодичность элемент перечисления, 
//		для которого вычисляется количество дней
//
// Возвращаемое значение:
//   ЧислоДнейВПериоде (число)  – число дней в переданном периоде
//
Функция ЧислоДнейВПериоде(Периодичность) Экспорт
		
	Если Периодичность=Перечисления.Периодичность.День Тогда
		ЧислоДнейВПериоде=1;
	ИначеЕсли Периодичность=Перечисления.Периодичность.Неделя Тогда
		ЧислоДнейВПериоде=7;
	ИначеЕсли Периодичность=Перечисления.Периодичность.Месяц Тогда
		ЧислоДнейВПериоде=30;
	ИначеЕсли Периодичность=Перечисления.Периодичность.Квартал Тогда
		ЧислоДнейВПериоде=90;
	ИначеЕсли Периодичность=Перечисления.Периодичность.Год Тогда
		ЧислоДнейВПериоде=365;
	Иначе
		ЧислоДнейВПериоде=0;
	КонецЕсли;
	
	Возврат ЧислоДнейВПериоде;	

КонецФункции // ЧислоДнейВПериоде()

///////////////////////////////////////////////////////////////////////////////
// Предназначена для получения имени элемента перечисления по значению.
//
// Параметры:
//	Элемент перечисления.
//
// Возвращаемое значение:
//	Строка - имя элемента перечисления в метаданных.
//
Функция ПолучитьИмяЭлементаПеречисленияПоЗначению(ЗначениеПеречисления) Экспорт
	
	ИмяЭлемента = Строка(ЗначениеПеречисления);
	Для каждого ЭлементПеречисления Из Метаданные.Перечисления[ЗначениеПеречисления.Метаданные().Имя].ЗначенияПеречисления Цикл
		Если ЭлементПеречисления.Синоним = Строка(ЗначениеПеречисления) Тогда
			ИмяЭлемента = ЭлементПеречисления.Имя;
			Прервать;
		КонецЕсли; 
	КонецЦикла;
	
	Возврат ИмяЭлемента;
	
КонецФункции // ПолучитьПериодичностьДляЗапросаПоЗначениюПеречисления()

// Возвращает строку, описывающую период, определяемый переданными
// датой и периодичностью.
//
// Параметры
//  ДатаВПериоде:Дата - дата из периода
//  Периодичность: Строка - строка, определяющая периодичность
//
// Возвращаемое значение:
//   СтрокаПериод: строка   – представление периода для вывода в отчетах
//
Функция ПолучитьПериодСтрокой(ДатаВПериоде, Периодичность) Экспорт
	
	Если Периодичность = "Год" Тогда
		ФорматДаты = "ДФ='гггг ""г.""'";
		
	ИначеЕсли Периодичность = "Квартал" Тогда
		ФорматДаты = "ДФ='к"" квартал"" гггг ""г.""'";
		
	ИначеЕсли Периодичность = "Месяц" Тогда
		ФорматДаты = "ДФ='ММММ гггг ""г.""'";
		
	ИначеЕсли Периодичность = "Неделя" Тогда
		ФорматДаты = "ДФ='""Неделя (""дд.ММ.гггг'";
		
	ИначеЕсли Периодичность = "День" Тогда
		ФорматДаты = "ДФ='дд.ММ.гггг ""г.""'";
		
	Иначе
		ФорматДаты = "";
		
	КонецЕсли;
	
	СтрокаПериод = "" + Формат(ДатаВПериоде, ФорматДаты);
	Если Периодичность = "Неделя" И ТипЗнч(ДатаВПериоде) = Тип("Дата") Тогда
		СтрокаПериод = "" + НеделяГода(ДатаВПериоде) + "-ая " + СтрокаПериод + Формат(КонецНедели(ДатаВПериоде), "ДФ='"" - ""дд.ММ.гггг)'");
	КонецЕсли;
	
	Возврат СтрокаПериод;
	
КонецФункции // ПолучитьПериодСтрокой()

//Бывший УправлениеОтчетами

// Добавляет в параметры построителя отчета использованные в отборах категории
//
// Параметры:
//	ПостроительОтчета              - Построитель, отбор которого обрабатывается, и в Параметры 
//                                    которого добавляются категории
//	СтруктураДляОтбораПоКатегориям - структура, связывающая пути к данным Отборов Построителя и 
//                                    идентицфикаторы параметров
//
// Возвращаемое значение:
//	Истина, если добавление параметров произошло успешно
//	Ложь, если есть повторный отбор по одной и той же категории.
//
// Вообще-то, повторный отбор по одной и той же категории невозможен не всегда - 
//  можно отобрать два раза с видом сравнения "не равно". Контроль возвращаемого
//  этой функцией значения отключить можно, но нужно после этого понимать,
//  что два отбора по одной категории с видом сравнения "Равно" приведут к тому,
//  что отчет окажется пустым.
//
Функция ЗадатьПараметрыОтбораПоКатегориям(ПостроительОтчета, СтруктураДляОтбораПоКатегориям) Экспорт

	Если ТипЗнч(СтруктураДляОтбораПоКатегориям) = ТипЗнч(Новый Структура) Тогда

		Для Каждого ЭлементОтбора Из ПостроительОтчета.Отбор Цикл
			//Прочищаем все, независимо от использования элемента отбора
			НазваниеПараметра = "";
			Если ЗначениеЗаполнено(ЭлементОтбора.ПутьКДанным) И Найти(ЭлементОтбора.ПутьКДанным, ".") = 0 Тогда
				Если СтруктураДляОтбораПоКатегориям.Свойство(ЭлементОтбора.ПутьКДанным, НазваниеПараметра) Тогда
					Если ПостроительОтчета.Параметры.Свойство(НазваниеПараметра) Тогда
						ПостроительОтчета.Параметры.Удалить(НазваниеПараметра);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;

		Для Каждого ЭлементОтбора Из ПостроительОтчета.Отбор Цикл

			Если Найти(ЭлементОтбора.ПутьКДанным, ".") > 0 Тогда
				Продолжить;
			КонецЕсли;

			Если ЭлементОтбора.Использование Тогда

				ИдентификаторПараметра = "";

				Если ЗначениеЗаполнено(ЭлементОтбора.ПутьКДанным) И СтруктураДляОтбораПоКатегориям.Свойство(ЭлементОтбора.ПутьКДанным, ИдентификаторПараметра) Тогда

					МассивЗначенийКатегорий = НеОпределено;

					Если НЕ ПостроительОтчета.Параметры.Свойство(ИдентификаторПараметра, МассивЗначенийКатегорий) Тогда
						МассивЗначенийКатегорий = Новый Массив;
					Иначе
						#Если Клиент Тогда
							Предупреждение("Нельзя использовать несколько отборов по одной и той же категории!");
						#Иначе
							Сообщить("Нельзя использовать несколько отборов по одной и той же категории!");
						#КонецЕсли
						Возврат Ложь;
					КонецЕсли;

					Если ТипЗнч(ЭлементОтбора.Значение) = ТипЗнч(Новый СписокЗначений) Тогда
						Для Каждого ЗначениеКатегории Из ЭлементОтбора.Значение Цикл
							МассивЗначенийКатегорий.Добавить(ЗначениеКатегории.Значение);
						КонецЦикла;
					Иначе
						МассивЗначенийКатегорий.Добавить(ЭлементОтбора.Значение);
					КонецЕсли;

					ПостроительОтчета.Параметры.Вставить(ИдентификаторПараметра, МассивЗначенийКатегорий);

				КонецЕсли;
				
			КонецЕсли;
				
		КонецЦикла;
	КонецЕсли;

	Возврат Истина;

КонецФункции // ЗадатьПараметрыОтбораПоКатегориям()

// Процедура заполняет представления элементов всех коллекций построителя отчета на
//  основании соответствия имен и представдлений переданных в параметре
//
// Параметры
//  СтруктураСоответствияИмен - Структура, ключ - имя поля, значение - представление поля
//  ПостроительОтчета         - ПостроительОтчета
//
//  Возвращаемое значение
//   НЕТ
//
Процедура ЗаполнитьПредставленияПолей(СтруктураСоответствияИмен, ПостроительОтчета) Экспорт

	СтруктураКоллекцийПостроителяОтчета = Новый Структура("ДоступныеПоля, ВыбранныеПоля, ИзмеренияКолонки, ИзмеренияСтроки, Отбор");
	
	Для каждого ЭлементСтруктуры Из СтруктураКоллекцийПостроителяОтчета Цикл
		Для а = 0 По ПостроительОтчета[ЭлементСтруктуры.Ключ].Количество() - 1 Цикл
			Если ПустаяСтрока(ПостроительОтчета[ЭлементСтруктуры.Ключ][а].Имя) Тогда
				Продолжить;
			КонецЕсли;
			Если СтруктураСоответствияИмен.Свойство(ПостроительОтчета[ЭлементСтруктуры.Ключ][а].Имя) Тогда
				ПостроительОтчета[ЭлементСтруктуры.Ключ][а].Представление = СтруктураСоответствияИмен[ПостроительОтчета[ЭлементСтруктуры.Ключ][а].Имя];
			КонецЕсли; 
		КонецЦикла; 
	КонецЦикла; 
	
КонецПроцедуры // ЗаполнитьПредставленияПолей()

// Удаляет автоматически добавляемые Построителем при инициализации дополнительные поля с измерениями
//
// Параметры:
//	нет
//
Процедура ОчиститьДополнительныеПоляПостроителя(ПостроительОтчета) Экспорт

	Сч=0;
	Пока Сч<ПостроительОтчета.ВыбранныеПоля.Количество() Цикл

		Если ПостроительОтчета.ИзмеренияСтроки.Найти(ПостроительОтчета.ВыбранныеПоля[Сч].Имя)<>Неопределено Тогда

			ПостроительОтчета.ВыбранныеПоля.Удалить(ПостроительОтчета.ВыбранныеПоля[Сч]);

		ИначеЕсли ПостроительОтчета.ИзмеренияКолонки.Найти(ПостроительОтчета.ВыбранныеПоля[Сч].Имя)<>Неопределено Тогда

			ПостроительОтчета.ВыбранныеПоля.Удалить(ПостроительОтчета.ВыбранныеПоля[Сч]);
			
		Иначе

			Сч=Сч+1;

		КонецЕсли;
	КонецЦикла;

КонецПроцедуры // ОчиститьДополнительныеПоляПостроителя()

// Процедура запоняет данными отбор из структуры.
//
// Параметры
//  Отбор - Отбор
//  СтруктураОтбора - Структура
//
Процедура ЗаполнитьОтборИзСтруктуры(Отбор, СтруктураОтбора) Экспорт

	Если ТипЗнч(СтруктураОтбора) = Тип("Структура") Тогда
		Для каждого ЭлементСтруктуры Из СтруктураОтбора Цикл
			ЗначениеЭлементаСтруктуры = ЭлементСтруктуры.Значение;
			ЭлементОтбора = Неопределено;
			Если НЕ ПустаяСтрока(ЗначениеЭлементаСтруктуры.Имя) Тогда
				ЭлементОтбора = Отбор.Найти(ЗначениеЭлементаСтруктуры.Имя);
			КонецЕсли; 
			Если ЭлементОтбора = Неопределено Тогда
				ЭлементОтбора = Отбор.Добавить(ЗначениеЭлементаСтруктуры.ПутьКДанным, ЗначениеЭлементаСтруктуры.Имя);
			КонецЕсли;
			Для каждого РеквизитОтбора Из ЗначениеЭлементаСтруктуры Цикл
				Попытка
					ЭлементОтбора[РеквизитОтбора.Ключ] = РеквизитОтбора.Значение;
				Исключение
				КонецПопытки;
			КонецЦикла; 
		КонецЦикла; 
	КонецЕсли; 

КонецПроцедуры // ЗаполнитьОтборИзСтруктуры()

// Заполняет отборы ПостроителяОтчета
//
// Параметры:
//	МассивОтбора - Массив, содержащий идентификаторы отборов
Процедура ЗаполнитьОтбор(МассивОтбора, ПостроительОтчета) Экспорт
	Для Каждого Элемент Из МассивОтбора Цикл

		ПолеОтбора = ПостроительОтчета.Отбор.Добавить(Элемент);

	КонецЦикла; 
КонецПроцедуры // ЗаполнитьОтбор()

// Функция анализирует измерения Построителя Отчета и ищет среди них повторы
// Конечно же, например, возможен вывод в кросс-таблицу при одном и том же 
// измерении, встречающемся в строках и столбцах, но тогда отчет будет нечитабален
// и непонятно, зачем он вообще нужен.
//
// Параметры
//
//	ПостроительОтчета - Построитель отчета, измерения которого анализируются.
//
Функция ПроверитьПовторыИзмеренийПостроителя(ПостроительОтчета) Экспорт

	Для Инд=0 По ПостроительОтчета.ИзмеренияКолонки.Количество()-1  Цикл
	
		Для Инд2=0 По ПостроительОтчета.ИзмеренияСтроки.Количество()-1  Цикл

			Если ПостроительОтчета.ИзмеренияКолонки[Инд].ПутьКДанным = ПостроительОтчета.ИзмеренияСтроки[Инд2].ПутьКДанным Тогда

				#Если Клиент тогда
					Предупреждение("Повторяющаяся группировка " + ПостроительОтчета.ИзмеренияКолонки[Инд].Представление +"."+ Символы.ПС+
					"Нельзя использовать одинаковые поля группировки в строках и в колонках!", 30);
				#Иначе
					Сообщить("Повторяющаяся группировка " + ПостроительОтчета.ИзмеренияКолонки[Инд].Представление +"."+ Символы.ПС+
					"Нельзя использовать одинаковые поля группировки в строках и в колонках!");
				#КонецЕсли
				Возврат Ложь;
			
			КонецЕсли; 
		КонецЦикла;
	
	КонецЦикла;


	СписокЗначений = Новый СписокЗначений;
	
	Для Инд=0 По ПостроительОтчета.ИзмеренияСтроки.Количество()-1  Цикл
		
		Если СписокЗначений.НайтиПоЗначению(ПостроительОтчета.ИзмеренияСтроки[Инд].ПутьКДанным) = Неопределено Тогда
			СписокЗначений.Добавить(ПостроительОтчета.ИзмеренияСтроки[Инд].ПутьКДанным);
		Иначе
			#Если Клиент тогда
				Предупреждение("Повторяющаяся группировка " + ПостроительОтчета.ИзмеренияСтроки[Инд].Представление +"."+ Символы.ПС+
				"Нельзя использовать одинаковые поля группировки строк!", 30);
			#Иначе
				Сообщить("Повторяющаяся группировка " + ПостроительОтчета.ИзмеренияСтроки[Инд].Представление +"."+ Символы.ПС+
				"Нельзя использовать одинаковые поля группировки строк!");
			#КонецЕсли
			Возврат Ложь;
			
		КонецЕсли;

		// Если добавлялись одни и те же поля в строки и в колонки, то 
		//  у них будет неправильное автогенеренное имя, оканчивающееся на число
		ИмяИзмерения = ПостроительОтчета.ИзмеренияСтроки[Инд].Имя;

		ПоследнийСимвол = Сред(ИмяИзмерения, СтрДлина(ИмяИзмерения));

		Если ПоследнийСимвол = "1"
			ИЛИ ПоследнийСимвол = "2" 
			ИЛИ ПоследнийСимвол = "3" 
			ИЛИ ПоследнийСимвол = "4" 
			ИЛИ ПоследнийСимвол = "5" 
			ИЛИ ПоследнийСимвол = "6" 
			ИЛИ ПоследнийСимвол = "7" 
			ИЛИ ПоследнийСимвол = "8" 
			ИЛИ ПоследнийСимвол = "9" 
			ИЛИ ПоследнийСимвол = "0" Тогда
			
			// Удалим старое измерение и добавим новое
            //Применение данного способа обусловлено тем, что методы "Вставить" и "Сдвинуть" не могут применяться
			//	для построителя отчета в 8.0.6.3
			ВремСписок = Новый СписокЗначений;
			ВремСписокИмяИзмерения = Новый СписокЗначений;
			ВремСписокТипИзмерения = Новый СписокЗначений;
			
			Пока ПостроительОтчета.ИзмеренияСтроки.КОличество() - 1 >= Инд Цикл

				СтрПутьКДанным = ПостроительОтчета.ИзмеренияСтроки[Инд].ПутьКДанным;
				ВремСписок.Добавить(ПостроительОтчета.ИзмеренияСтроки[Инд].ПутьКДанным);

				Если ИмяИзмерения = ПостроительОтчета.ИзмеренияСтроки[Инд].Имя Тогда //первая итерация

					ВремСписокИмяИзмерения.Добавить(Лев(ПостроительОтчета.ИзмеренияСтроки[Инд].Имя, СтрДлина(ИмяИзмерения) - 1));

				Иначе

					ВремСписокИмяИзмерения.Добавить(ПостроительОтчета.ИзмеренияСтроки[Инд].Имя);

				КонецЕсли;

				ВремСписокТипИзмерения.Добавить(ПостроительОтчета.ИзмеренияСтроки[Инд].ТипИзмерения);
				ПостроительОтчета.ИзмеренияСтроки.Удалить(ПостроительОтчета.ИзмеренияСтроки[Инд]);

			КОнецЦикла;
			Для Инд = 0 по ВремСписок.Количество() - 1 Цикл
				ПостроительОтчета.ИзмеренияСтроки.Добавить(ВремСписок[Инд].Значение, ВремСписокИмяИзмерения[Инд].Значение, ВремСписокТипИзмерения[Инд].Значение);
			КОнецЦикла;
		КонецЕсли;
		
	КонецЦикла;

	СписокЗначений = Новый СписокЗначений;
	
	Для Инд=0 По ПостроительОтчета.ИзмеренияКолонки.Количество()-1  Цикл
		
		Если СписокЗначений.НайтиПоЗначению(ПостроительОтчета.ИзмеренияКолонки[Инд].ПутьКДанным) = Неопределено Тогда
			СписокЗначений.Добавить(ПостроительОтчета.ИзмеренияКолонки[Инд].ПутьКДанным);
		Иначе
		#Если Клиент Тогда
			Предупреждение("Повторяющаяся группировка " + ПостроительОтчета.ИзмеренияКолонки[Инд].Представление +"."+ Символы.ПС+
			"Нельзя использовать одинаковые поля группировки колонок!", 30);
		#Иначе
			Сообщить("Повторяющаяся группировка " + ПостроительОтчета.ИзмеренияКолонки[Инд].Представление +"."+ Символы.ПС+
			"Нельзя использовать одинаковые поля группировки колонок!");
		#КонецЕсли
			Возврат Ложь;
			
		КонецЕсли;

		// Если добавлялись одни и те же поля в строки и в колонки, то 
		// у них будет неправильное автогенеренное имя, оканчивающееся на число
		ИмяИзмерения = ПостроительОтчета.ИзмеренияКолонки[Инд].Имя;

		ПоследнийСимвол = Сред(ИмяИзмерения, СтрДлина(ИмяИзмерения));

		Если ПоследнийСимвол = "1"
			ИЛИ ПоследнийСимвол = "2" 
			ИЛИ ПоследнийСимвол = "3" 
			ИЛИ ПоследнийСимвол = "4" 
			ИЛИ ПоследнийСимвол = "5" 
			ИЛИ ПоследнийСимвол = "6" 
			ИЛИ ПоследнийСимвол = "7" 
			ИЛИ ПоследнийСимвол = "8" 
			ИЛИ ПоследнийСимвол = "9" 
			ИЛИ ПоследнийСимвол = "0" Тогда

			// Удалим старое измерение и добавим новое

			ВремСписок = Новый СписокЗначений;
			ВремСписокИмяИзмерения = Новый СписокЗначений;
			ВремСписокТипИзмерения = Новый СписокЗначений;
			
			Пока ПостроительОтчета.ИзмеренияКолонки.КОличество() - 1 >= Инд Цикл
				СтрПутьКДанным = ПостроительОтчета.ИзмеренияКолонки[Инд].ПутьКДанным;
				ВремСписок.Добавить(ПостроительОтчета.ИзмеренияКолонки[Инд].ПутьКДанным);

				Если ИмяИзмерения = ПостроительОтчета.ИзмеренияКолонки[Инд].Имя Тогда //первая итерация

					ВремСписокИмяИзмерения.Добавить(Лев(ПостроительОтчета.ИзмеренияКолонки[Инд].Имя, СтрДлина(ИмяИзмерения) - 1));

				Иначе

					ВремСписокИмяИзмерения.Добавить(ПостроительОтчета.ИзмеренияКолонки[Инд].Имя);

				КонецЕсли;

				ВремСписокТипИзмерения.Добавить(ПостроительОтчета.ИзмеренияКолонки[Инд].ТипИзмерения);
				ПостроительОтчета.ИзмеренияКолонки.Удалить(ПостроительОтчета.ИзмеренияКолонки[Инд]);
			КОнецЦикла;
			Для Инд = 0 по ВремСписок.Количество() - 1 Цикл
				ПостроительОтчета.ИзмеренияКолонки.Добавить(ВремСписок[Инд].Значение, ВремСписокИмяИзмерения[Инд].Значение, ВремСписокТипИзмерения[Инд].Значение);
			КОнецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;

КонецФункции // ПроверитьПовторыИзмеренийПостроителя()

// Устанавливает связь полей отбора на основной форме с отбором
Процедура УстановитьСвязьПолейБыстрогоОтбораНаФорме(ЭлементыФормы, Отбор, СтруктураСвязиЭлементовСДанными = Неопределено, ПутьКОтбору = "ОтчетОбъект.ПостроительОтчета.Отбор") Экспорт

	Инд=0;
	СтруктураНаборовСвязываемыхЭлементов = Новый Структура;
	//Перебираем элементы формы
	Пока Инд<ЭлементыФормы.Количество() Цикл

		Элемент = ЭлементыФормы[Инд];
		
		Если (Найти(Элемент.Имя, "ПолеНастройки")
			ИЛИ Найти(Элемент.Имя, "ФлажокНастройки")
			ИЛИ Найти(Элемент.Имя, "ПолеВидаСравнения")) Тогда

			//Если имя элемента формы содержит что-то, нас интересующее,
			//добавляем его в соответствующую структуру

			//Это может плохо работать, например, для "ПолеНастройкиПоПорядку"
			//процедура решит, что это "ПолеНастройкиПо" для "Порядку". Вывод - используем маленькую
			//букву - "ПолеНастройкиПопопрядку"!!!
			Если (Найти(Элемент.Имя, "ПолеНастройкиПо")) и (ВРег(Сред(Элемент.Имя, 16, 1)) = Сред(Элемент.Имя, 16, 1)) Тогда
				ИмяПоляОтбора = СтрЗаменить(Элемент.Имя, "ПолеНастройкиПо", "");
			ИначеЕсли Найти(Элемент.Имя, "ПолеНастройкиС") и (ВРег(Сред(Элемент.Имя, 15, 1)) = Сред(Элемент.Имя, 15, 1)) Тогда
				ИмяПоляОтбора = СтрЗаменить(Элемент.Имя, "ПолеНастройкиС", "");
			ИначеЕсли Найти(Элемент.Имя, "ПолеНастройки") Тогда
				ИмяПоляОтбора = СтрЗаменить(Элемент.Имя, "ПолеНастройки", "");
			ИначеЕсли Найти(Элемент.Имя, "ПолеВидаСравнения") Тогда
				ИмяПоляОтбора = СтрЗаменить(Элемент.Имя, "ПолеВидаСравнения", "");
			Иначе
				ИмяПоляОтбора = СтрЗаменить(Элемент.Имя, "ФлажокНастройки", "");
			КонецЕсли;
			
			СтрНабор = "";
			Если НЕ СтруктураНаборовСвязываемыхЭлементов.Свойство(ИмяПоляОтбора) Тогда
				//Ключами структуры "СтруктураНаборовСвязываемыхЭлементов" являются 
				//идентификаторы полей отбора, значениями - структуры СтрНабор.
				СтрНабор = Новый Структура;
				СтруктураНаборовСвязываемыхЭлементов.Вставить(ИмяПоляОтбора, СтрНабор);
				Иначе СтрНабор = СтруктураНаборовСвязываемыхЭлементов[ИмяПоляОтбора];
			КонецЕсли;
			//В СтрНабор мы складываем в качестве ключа, например, "ПолеНастройки", 
			//значение - ЭУ формы. В общем, откусываем идентификатор отбора
			СтрНабор.Вставить(СтрЗаменить(Элемент.Имя, ИмяПоляОтбора, ""), Элемент);
			
		КонецЕсли;
		
		Инд=Инд+1;
	
	КонецЦикла; 

	// Структура для хранения связи э.у. с данными
	СтруктураСвязиЭлементовСДанными = Новый Структура;

	Для Сч = 0 По Отбор.Количество()-1 Цикл

		ПолеОтбора = Отбор[Сч];
		
		Если ПустаяСтрока(ПолеОтбора.Имя) Тогда
			Продолжить;
		КонецЕсли; 

		Если СтруктураНаборовСвязываемыхЭлементов.Свойство(ПолеОтбора.Имя) Тогда
			//Тогда имеет место комплект (возможно, неполный) контролов для него
			
			КомплектКонтролов = СтруктураНаборовСвязываемыхЭлементов[ПолеОтбора.Имя];
			//напоминаю - ключи - тип ЭУ, значения - сами ЭУ
			//Связываем их с данными.
			
			ТипОтбора = Отбор[ПолеОтбора.Имя].ТипЗначения;
			
			Если КомплектКонтролов.Свойство("ФлажокНастройки") Тогда
				КомплектКонтролов.ФлажокНастройки.Данные = ПутьКОтбору+"."+ПолеОтбора.Имя+".Использование";
				СтруктураСвязиЭлементовСДанными.Вставить("ФлажокНастройки"+ПолеОтбора.Имя,   ПутьКОтбору+"."+ПолеОтбора.Имя+".Использование");
			КонецЕсли;
			
			Если КомплектКонтролов.Свойство("ПолеНастройки") Тогда
				КомплектКонтролов.ПолеНастройки.Данные = ПутьКОтбору+"."+ПолеОтбора.Имя+".Значение";
				СтруктураСвязиЭлементовСДанными.Вставить("ПолеНастройки"+ПолеОтбора.Имя,     ПутьКОтбору+"."+ПолеОтбора.Имя+".Значение");
			КонецЕсли;

			Если КомплектКонтролов.Свойство("ПолеНастройкиС") Тогда
				КомплектКонтролов.ПолеНастройкиС.Данные = ПутьКОтбору+"."+ПолеОтбора.Имя+".ЗначениеС";
				СтруктураСвязиЭлементовСДанными.Вставить("ПолеНастройкиС"+ПолеОтбора.Имя,    ПутьКОтбору+"."+ПолеОтбора.Имя+".ЗначениеС");
			КонецЕсли;

			Если КомплектКонтролов.Свойство("ПолеНастройкиПо") Тогда
				КомплектКонтролов.ПолеНастройкиПо.Данные = ПутьКОтбору+"."+ПолеОтбора.Имя+".ЗначениеПо";
				СтруктураСвязиЭлементовСДанными.Вставить("ПолеНастройкиПо"+ПолеОтбора.Имя,   ПутьКОтбору+"."+ПолеОтбора.Имя+".ЗначениеПо");
			КонецЕсли;

			Если КомплектКонтролов.Свойство("ПолеВидаСравнения") Тогда
				КомплектКонтролов.ПолеВидаСравнения.СписокВыбора = ПолучитьСписокВидовСравненияПоТипу(ТипОтбора);
				КомплектКонтролов.ПолеВидаСравнения.Данные = ПутьКОтбору+"."+ПолеОтбора.Имя+".ВидСравнения";
				СтруктураСвязиЭлементовСДанными.Вставить("ПолеВидаСравнения"+ПолеОтбора.Имя, ПутьКОтбору+"."+ПолеОтбора.Имя+".ВидСравнения");

				//Установим видимость ЭУ "ПолеНастройки*" в зависимости от 
				//уже установленного вида сравнения
				ПолеВидаСравненияПриИзменении(КомплектКонтролов.ПолеВидаСравнения, ЭлементыФормы);

			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла; 

КонецПроцедуры // УстановитьСвязьПолейБыстрогоОтбораНаФорме()

// Связывает поля отбора на основной форме с данными, устанавливает представления, прячет лишние
Процедура ОбработатьПоляОтбораНаОсновнойФормеУниверсальногоОтчета(ЭлементыФормы, ПостроительОтчета, СтруктураСвязиЭлементовСДанными = Неопределено, ПутьКПостроителю = "ОтчетОбъект") Экспорт

	// Структура для хранения связи э.у. с данными
	СтруктураСвязиЭлементовСДанными = Новый Структура;

	КоличествоОтборов = 0;
	Для Сч = 0 По ПостроительОтчета.Отбор.Количество()-1 Цикл

		ПолеОтбора = ПостроительОтчета.Отбор[Сч];

		Если НЕ (ПустаяСтрока(ПолеОтбора.Имя) ИЛИ ПолеОтбора.Имя = "Периодичность") Тогда
		
			КоличествоОтборов=КоличествоОтборов+1;
		
		КонецЕсли; 
	КонецЦикла;
	Если КоличествоОтборов>5 Тогда
		КоличествоОтборов = 5;
	КонецЕсли;

	Сч = 0;
	Для Инд = 0 По ПостроительОтчета.Отбор.Количество()-1 Цикл

		ПолеОтбора = ПостроительОтчета.Отбор[Инд];

		Если ПустаяСтрока(ПолеОтбора.Имя) ИЛИ ПолеОтбора.Имя = "Периодичность" Тогда
		
			Продолжить;
		
		КонецЕсли; 

		Сч = Сч + 1;
		Если Сч>КоличествоОтборов Тогда
			прервать;
		КонецЕсли;
		Флажок = ЭлементыФормы["ФлажокНастройки"+Сч];
		
		ПолеВыбора = ЭлементыФормы["ПолеВидаСравнения"+Сч];

//			ПолеВыбора.УстановитьДействие("ПриИзменении", ЭталонПолеВыбора.ПолучитьДействие("ПриИзменении"));
		
		ПолеВвода = ЭлементыФормы["ПолеНастройки"+Сч];

//			ПолеВвода.УстановитьДействие("ПриИзменении", ЭталонПолеВвода.ПолучитьДействие("ПриИзменении"));

		ПолеВводаС = ЭлементыФормы["ПолеНастройкиС"+Сч];

//			ПолеВводаС.УстановитьДействие("ПриИзменении", ЭталонПолеВводаС.ПолучитьДействие("ПриИзменении"));
		
		ПолеВводаПо = ЭлементыФормы["ПолеНастройкиПо"+Сч];;
//			ПолеВводаПо.УстановитьДействие("ПриИзменении", ЭталонПолеВводаПо.ПолучитьДействие("ПриИзменении"));

		ТипОтбора = ПостроительОтчета.Отбор[ПолеОтбора.Имя].ТипЗначения;

		ПолеВыбора.СписокВыбора = ПолучитьСписокВидовСравненияПоТипу(ТипОтбора);

		ЭлементыФормы["ФлажокНастройки"+Сч].Заголовок = ПолеОтбора.Представление;
		ЭлементыФормы["ФлажокНастройки"+Сч].Данные   = ПутьКПостроителю+".ПостроительОтчета.Отбор."+ПолеОтбора.Имя+".Использование";
		ЭлементыФормы["ПолеВидаСравнения"+Сч].Данные = ПутьКПостроителю+".ПостроительОтчета.Отбор."+ПолеОтбора.Имя+".ВидСравнения";
		ЭлементыФормы["ПолеНастройки"+Сч].Данные     = ПутьКПостроителю+".ПостроительОтчета.Отбор."+ПолеОтбора.Имя+".Значение";
		ЭлементыФормы["ПолеНастройкиС"+Сч].Данные    = ПутьКПостроителю+".ПостроительОтчета.Отбор."+ПолеОтбора.Имя+".ЗначениеС";
		ЭлементыФормы["ПолеНастройкиПо"+Сч].Данные   = ПутьКПостроителю+".ПостроительОтчета.Отбор."+ПолеОтбора.Имя+".ЗначениеПо";

		СтруктураСвязиЭлементовСДанными.Вставить("ФлажокНастройки"+Сч,   ПутьКПостроителю+".ПостроительОтчета.Отбор."+ПолеОтбора.Имя+".Использование");
		СтруктураСвязиЭлементовСДанными.Вставить("ПолеВидаСравнения"+Сч, ПутьКПостроителю+".ПостроительОтчета.Отбор."+ПолеОтбора.Имя+".ВидСравнения");
		СтруктураСвязиЭлементовСДанными.Вставить("ПолеНастройки"+Сч,     ПутьКПостроителю+".ПостроительОтчета.Отбор."+ПолеОтбора.Имя+".Значение");
		СтруктураСвязиЭлементовСДанными.Вставить("ПолеНастройкиС"+Сч,    ПутьКПостроителю+".ПостроительОтчета.Отбор."+ПолеОтбора.Имя+".ЗначениеС");
		СтруктураСвязиЭлементовСДанными.Вставить("ПолеНастройкиПо"+Сч,   ПутьКПостроителю+".ПостроительОтчета.Отбор."+ПолеОтбора.Имя+".ЗначениеПо");

		// Если только один тип, то тип выбирать не будем
		ЭлементыФормы["ПолеНастройки"+Сч].ВыбиратьТип   = НЕ (ТипОтбора.Типы().Количество()=1);
		ЭлементыФормы["ПолеНастройкиС"+Сч].ВыбиратьТип  = НЕ (ТипОтбора.Типы().Количество()=1);
		ЭлементыФормы["ПолеНастройкиПо"+Сч].ВыбиратьТип = НЕ (ТипОтбора.Типы().Количество()=1);

		Если ЭлементыФормы["ПолеВидаСравнения"+Сч].Значение = ВидСравнения.Интервал
			ИЛИ ЭлементыФормы["ПолеВидаСравнения"+Сч].Значение = ВидСравнения.ИнтервалВключаяГраницы 
			ИЛИ ЭлементыФормы["ПолеВидаСравнения"+Сч].Значение = ВидСравнения.ИнтервалВключаяНачало 
			ИЛИ ЭлементыФормы["ПолеВидаСравнения"+Сч].Значение = ВидСравнения.ИнтервалВключаяОкончание Тогда
		
			ЭлементыФормы["ПолеНастройки"+Сч].Видимость = Ложь;
			ЭлементыФормы["ПолеНастройкиС"+Сч].Видимость = Истина;
			ЭлементыФормы["ПолеНастройкиПо"+Сч].Видимость = Истина;
		
		Иначе
		
			ЭлементыФормы["ПолеНастройки"+Сч].Видимость = Истина;
			ЭлементыФормы["ПолеНастройкиС"+Сч].Видимость = Ложь;
			ЭлементыФормы["ПолеНастройкиПо"+Сч].Видимость = Ложь;
		
		КонецЕсли;
	
	КонецЦикла; 

КонецПроцедуры // ОбработатьПоляОтбораНаОсновнойФормеУниверсальногоОтчета()

// Процедура-обработчик изменения поля настройки
Процедура ПолеНастройкиПриИзменении(Элемент, Отбор, СтруктураСвязиЭУсДанными=Неопределено) Экспорт

	Поз = Найти(Элемент.Имя, "ПолеНастройки");
	Если Поз>0 Тогда
		
		Если ТипЗнч(СтруктураСвязиЭУсДанными)= Тип("Структура") Тогда
			
			// Имяполя отбора найдем из пути к данным
			ПутьКДанным="";
			Если СтруктураСвязиЭУсДанными.Свойство(Элемент.Имя, ПутьКДанным) Тогда
				
				ПутьКДанным = Сред(ПутьКДанным, Найти(ПутьКДанным, "Отбор.")+СтрДлина("Отбор."));
				ИмяПоля = Лев(ПутьКДанным, Найти(ПутьКДанным, ".")-1);
				
			КонецЕсли;
		Иначе
			ИмяПоля = Сред(Элемент.Имя, СтрДлина("ПолеНастройки")+1);
		КонецЕсли;
		
		МетаданныеЗначения = Метаданные.НайтиПоТипу(ТипЗнч(Элемент.Значение));
		Если МетаданныеЗначения <> Неопределено Тогда
			Если Метаданные.Справочники.Найти(МетаданныеЗначения.Имя) <> Неопределено Тогда
				Если Элемент.Значение.ЭтоГруппа Тогда
					Отбор[ИмяПоля].ВидСравнения = ВидСравнения.ВИерархии;
				КонецЕсли;
			КонецЕсли;
		Иначе
			Если Элемент.ТипЗначения.Типы().Количество() = 2 Тогда
				ПустойСписок = Новый СписокЗначений;
				Если Элемент.ТипЗначения.СодержитТип(Тип("СписокЗначений")) Тогда
					ТипНеСписок = ?(Элемент.ТипЗначения.Типы()[0] = Тип("СписокЗначений"), Элемент.ТипЗначения.Типы()[1], Элемент.ТипЗначения.Типы()[0]);
					
					Если НЕ ЗначениеЗаполнено(Элемент.Значение) или (ТипЗнч(Элемент.Значение) = Тип("СписокЗначений") и Элемент.Значение.Количество() = 0) Тогда
						Если (Отбор[ИмяПоля].ВидСравнения = ВидСравнения.ВСписке)
							Или (Отбор[ИмяПоля].ВидСравнения = ВидСравнения.ВСпискеПоИерархии)
							Или (Отбор[ИмяПоля].ВидСравнения = ВидСравнения.НеВСписке)
							Или (Отбор[ИмяПоля].ВидСравнения = ВидСравнения.НеВСпискеПоИерархии) Тогда
							МассивСТипом = Новый массив(1);
							
							МассивСТипом[0] = ТипНеСписок;
							
							ПустойСписок.ТипЗначения = Новый ОписаниеТипов(МассивСТипом);
							
							Элемент.Значение = ПустойСписок;
						Иначе
							Элемент.Значение = ОбщегоНазначения.ПустоеЗначениеТипа(ТипНеСписок);
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;

		Если НЕ (НЕ ЗначениеЗаполнено(Элемент.Значение) или (ТипЗнч(Элемент.Значение) = Тип("СписокЗначений") и Элемент.Значение.Количество() = 0)) Тогда
			Отбор[ИмяПоля].Использование = Истина;
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры // ПолеНастройкиПриИзменении()

// Процедура-обработчик изменения поля настройки С
Процедура ПолеНастройкиСПриИзменении(Элемент, Отбор, СтруктураСвязиЭУсДанными=Неопределено) Экспорт

	Поз = Найти(Элемент.Имя, "ПолеНастройкиC");
	Если Поз>0 Тогда
		
		Если ТипЗнч(СтруктураСвязиЭУсДанными)= Тип("Структура") Тогда
			
			// Имяполя отбора найдем из пути к данным
			ПутьКДанным="";
			Если СтруктураСвязиЭУсДанными.Свойство(Элемент.Имя, ПутьКДанным) Тогда
				
				ПутьКДанным = Сред(ПутьКДанным, Найти(ПутьКДанным, "Отбор.")+СтрДлина("Отбор."));
				ИмяПоля = Лев(ПутьКДанным, Найти(ПутьКДанным, ".")-1);
				
			КонецЕсли;
		Иначе
			ИмяПоля = Сред(Элемент.Имя, СтрДлина("ПолеНастройкиC")+1);
		КонецЕсли;

		Если ЗначениеЗаполнено(Элемент.Значение) Тогда
			Отбор[ИмяПоля].Использование = Истина;
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры // ПолеНастройкиСПриИзменении()

// Процедура-обработчик изменения поля настройки ПО
Процедура ПолеНастройкиПоПриИзменении(Элемент, Отбор, СтруктураСвязиЭУсДанными=Неопределено) Экспорт

	Поз = Найти(Элемент.Имя, "ПолеНастройкиПо");
	Если Поз>0 Тогда
		
		Если ТипЗнч(СтруктураСвязиЭУсДанными)= Тип("Структура") Тогда
			
			// Имяполя отбора найдем из пути к данным
			ПутьКДанным="";
			Если СтруктураСвязиЭУсДанными.Свойство(Элемент.Имя, ПутьКДанным) Тогда
				
				ПутьКДанным = Сред(ПутьКДанным, Найти(ПутьКДанным, "Отбор.")+СтрДлина("Отбор."));
				ИмяПоля = Лев(ПутьКДанным, Найти(ПутьКДанным, ".")-1);
				
			КонецЕсли;
		Иначе
			ИмяПоля = Сред(Элемент.Имя, СтрДлина("ПолеНастройкиПо")+1);
		КонецЕсли;

		Если ЗначениеЗаполнено(Элемент.Значение) Тогда
			Отбор[ИмяПоля].Использование = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ПолеНастройкиПоПриИзменении()

// Процедура-обработчик изменения поля вида сравнения
Процедура ПолеВидаСравненияПриИзменении(Элемент, ЭлементыФормы) Экспорт

	ИмяОтбора = Сред(Элемент.Имя, Найти(Элемент.Имя, "ПолеВидаСравнения")+СтрДлина("ПолеВидаСравнения"));
	
	// Управление полями настройки в зависимости от вида сравнения
		Если Элемент.Значение = ВидСравнения.Интервал
			ИЛИ Элемент.Значение = ВидСравнения.ИнтервалВключаяГраницы 
			ИЛИ Элемент.Значение = ВидСравнения.ИнтервалВключаяНачало 
			ИЛИ Элемент.Значение = ВидСравнения.ИнтервалВключаяОкончание Тогда
		
			Если ЭлементыФормы.Найти("ПолеНастройки" + ИмяОтбора) <> НеОпределено Тогда
				ЭлементыФормы["ПолеНастройки"+ИмяОтбора].Видимость = Ложь;
			КонецЕсли;
			Если ЭлементыФормы.Найти("ПолеНастройкиС" + ИмяОтбора) <> НеОпределено Тогда
				ЭлементыФормы["ПолеНастройкиС"+ИмяОтбора].Видимость = Истина;
			КонецЕсли;
			Если ЭлементыФормы.Найти("ПолеНастройкиПо" + ИмяОтбора) <> НеОпределено Тогда
				ЭлементыФормы["ПолеНастройкиПо"+ИмяОтбора].Видимость = Истина;
			КонецЕсли;
		
		Иначе
		
			Если ЭлементыФормы.Найти("ПолеНастройки" + ИмяОтбора) <> НеОпределено Тогда
				ПолеНастройки = ЭлементыФормы["ПолеНастройки"+ИмяОтбора];
				ПолеНастройки.Видимость = Истина;
				Если Элемент.Значение = ВидСравнения.ВСписке
					ИЛИ Элемент.Значение = ВидСравнения.НеВСписке
					ИЛИ Элемент.Значение = ВидСравнения.ВСпискеПоИерархии
					ИЛИ Элемент.Значение = ВидСравнения.НеВСпискеПоИерархии Тогда
					ПолеНастройки.ОграничениеТипа = Новый ОписаниеТипов("СписокЗначений");
				Иначе
					ПолеНастройки.ОграничениеТипа = Новый ОписаниеТипов(ПолеНастройки.ТипЗначения,, "СписокЗначений");
				КонецЕсли;
			КонецЕсли;
			Если ЭлементыФормы.Найти("ПолеНастройкиС" + ИмяОтбора) <> НеОпределено Тогда
				ЭлементыФормы["ПолеНастройкиС"+ИмяОтбора].Видимость = Ложь;
			КонецЕсли;
			Если ЭлементыФормы.Найти("ПолеНастройкиПо" + ИмяОтбора) <> НеОпределено Тогда
				ЭлементыФормы["ПолеНастройкиПо"+ИмяОтбора].Видимость = Ложь;
			КонецЕсли;
		
		КонецЕсли;

КонецПроцедуры // ПолеВидаСравненияПриИзменении()

// Формирует список допустимых значений Вида Сравнения
//
// Параметры: 
//	ОпТипов - Описание Типов поля
//
// Возвращаемое значение: 
//	список значений, содержащийимена всех регистров остатков
//
Функция ПолучитьСписокВидовСравненияПоТипу(ОпТипов) Экспорт
	
	ТаблицаДоступныхЗначений = Новый ТаблицаЗначений;
	ТаблицаДоступныхЗначений.Колонки.Добавить("ВидСравнения");
	ТаблицаДоступныхЗначений.Колонки.Добавить("ЧислоВида");
	
	Для каждого ТипОписания Из ОпТипов.Типы() Цикл
	
		НоваяСтрокаТаблицы = ТаблицаДоступныхЗначений.Добавить();
		НоваяСтрокаТаблицы.ВидСравнения = ВидСравнения.Равно;
		НоваяСтрокаТаблицы.ЧислоВида = 1;
		
		НоваяСтрокаТаблицы = ТаблицаДоступныхЗначений.Добавить();
		НоваяСтрокаТаблицы.ВидСравнения = ВидСравнения.НеРавно;
		НоваяСтрокаТаблицы.ЧислоВида = 1;
		
		НоваяСтрокаТаблицы = ТаблицаДоступныхЗначений.Добавить();
		НоваяСтрокаТаблицы.ВидСравнения = ВидСравнения.ВСписке;
		НоваяСтрокаТаблицы.ЧислоВида = 1;
		
		НоваяСтрокаТаблицы = ТаблицаДоступныхЗначений.Добавить();
		НоваяСтрокаТаблицы.ВидСравнения = ВидСравнения.НеВСписке;
		НоваяСтрокаТаблицы.ЧислоВида = 1;

		Если Справочники.ТипВсеСсылки().СодержитТип(ТипОписания) И Метаданные.НайтиПоТипу(ТипОписания).Иерархический Тогда
			
			НоваяСтрокаТаблицы = ТаблицаДоступныхЗначений.Добавить();
			НоваяСтрокаТаблицы.ВидСравнения = ВидСравнения.ВСпискеПоИерархии;
			НоваяСтрокаТаблицы.ЧислоВида = 1;
			
			НоваяСтрокаТаблицы = ТаблицаДоступныхЗначений.Добавить();
			НоваяСтрокаТаблицы.ВидСравнения = ВидСравнения.НеВСпискеПоИерархии;
			НоваяСтрокаТаблицы.ЧислоВида = 1;
			
			НоваяСтрокаТаблицы = ТаблицаДоступныхЗначений.Добавить();
			НоваяСтрокаТаблицы.ВидСравнения = ВидСравнения.ВИерархии;
			НоваяСтрокаТаблицы.ЧислоВида = 1;
			
			НоваяСтрокаТаблицы = ТаблицаДоступныхЗначений.Добавить();
			НоваяСтрокаТаблицы.ВидСравнения = ВидСравнения.НеВИерархии;
			НоваяСтрокаТаблицы.ЧислоВида = 1;
			
		ИначеЕсли ТипОписания = Тип("Число")
			  ИЛИ ТипОписания = Тип("Строка")
			  ИЛИ ТипОписания = Тип("Дата") Тогда
			
			НоваяСтрокаТаблицы = ТаблицаДоступныхЗначений.Добавить();
			НоваяСтрокаТаблицы.ВидСравнения = ВидСравнения.Больше;
			НоваяСтрокаТаблицы.ЧислоВида = 1;
			
			НоваяСтрокаТаблицы = ТаблицаДоступныхЗначений.Добавить();
			НоваяСтрокаТаблицы.ВидСравнения = ВидСравнения.БольшеИлиРавно;
			НоваяСтрокаТаблицы.ЧислоВида = 1;
			
			НоваяСтрокаТаблицы = ТаблицаДоступныхЗначений.Добавить();
			НоваяСтрокаТаблицы.ВидСравнения = ВидСравнения.Меньше;
			НоваяСтрокаТаблицы.ЧислоВида = 1;
			
			НоваяСтрокаТаблицы = ТаблицаДоступныхЗначений.Добавить();
			НоваяСтрокаТаблицы.ВидСравнения = ВидСравнения.МеньшеИлиРавно;
			НоваяСтрокаТаблицы.ЧислоВида = 1;
			
			НоваяСтрокаТаблицы = ТаблицаДоступныхЗначений.Добавить();
			НоваяСтрокаТаблицы.ВидСравнения = ВидСравнения.Интервал;
			НоваяСтрокаТаблицы.ЧислоВида = 1;
			
			НоваяСтрокаТаблицы = ТаблицаДоступныхЗначений.Добавить();
			НоваяСтрокаТаблицы.ВидСравнения = ВидСравнения.ИнтервалВключаяГраницы;
			НоваяСтрокаТаблицы.ЧислоВида = 1;
			
			НоваяСтрокаТаблицы = ТаблицаДоступныхЗначений.Добавить();
			НоваяСтрокаТаблицы.ВидСравнения = ВидСравнения.ИнтервалВключаяНачало;
			НоваяСтрокаТаблицы.ЧислоВида = 1;
			
			НоваяСтрокаТаблицы = ТаблицаДоступныхЗначений.Добавить();
			НоваяСтрокаТаблицы.ВидСравнения = ВидСравнения.ИнтервалВключаяОкончание;
			НоваяСтрокаТаблицы.ЧислоВида = 1;
			
		КонецЕсли;
		
		Если ТипОписания = Тип("Строка") Тогда
			НоваяСтрокаТаблицы = ТаблицаДоступныхЗначений.Добавить();
			НоваяСтрокаТаблицы.ВидСравнения = ВидСравнения.Содержит;
			НоваяСтрокаТаблицы.ЧислоВида = 1;
		КонецЕсли;
		
	КонецЦикла;
	
	ТаблицаДоступныхЗначений.Свернуть("ВидСравнения", "ЧислоВида");
	
	СписокВидовСравнения = Новый СписокЗначений;
	КолТипов = ОпТипов.Типы().Количество();
	
	Для каждого СтрокаТаблицы Из ТаблицаДоступныхЗначений Цикл
		Если СтрокаТаблицы.ЧислоВида = КолТипов Тогда
			СписокВидовСравнения.Добавить(СтрокаТаблицы.ВидСравнения);
		КонецЕсли; 
	КонецЦикла; 
	
	Возврат СписокВидовСравнения;
	
Конецфункции //
  
Функция ЭтоСчетГруппа(Счет)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Хозрасчетный.Ссылка
		|ИЗ
		|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
		|ГДЕ
		|	Хозрасчетный.Родитель = &Родитель";

	Запрос.УстановитьПараметр("Родитель", Счет);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат(Истина);
	Иначе	
		Возврат(Ложь);
	КонецЕсли;

КонецФункции	

Процедура СгенерироватьЗапросПоНастройкам(Выборка)Экспорт 
	
	
	Пока Выборка.Следующий() Цикл
		
		
		номПараметра = 1;
		
		Источник = Выборка.Ссылка.ИсточникДанныхДляФакта;
		
		Если Источник <> Справочники.ИсточникиДанныхДляРасчетовБюджетирования.ПустаяСсылка() Тогда
			обИсточник = Источник.ПолучитьОбъект();
		Иначе
			Продолжить;
		КонецЕсли;
		 			
		ПараметрыПостроителя = обИсточник.НастройкиПостроителя.Получить().ПараметрыПостроителя; 
		НастройкиПостроителя = обИсточник.НастройкиПостроителя.Получить();
		Если ПараметрыПостроителя.Количество() > 0 Тогда
			ПараметрыПостроителя.Очистить();
		КонецЕсли;	                                             
		
		тНачалоШапки = "ВЫБРАТЬ ";
		тРезультат = "";
		тЗапроса   = "";
		ТекстЗапроса = "";
		тКонецШапки = " КАК Сумма,";                         

		СтатьяБюджета = Выборка.Ссылка;       
		
		НастройкиИсточника = СтатьяБюджета.ХранилищеНастроек.Получить();
		
		Если НастройкиИсточника = Неопределено Тогда
			Возврат;
		КонецЕсли;	

		//Для Каждого ВыборкаСтроки Из НастройкиИсточника Цикл   //ЮЦАУ // Закрыл при переходе на УАТ
		//	
		//	//                                                   
		//	Счет = ВыборкаСтроки.Счет;
		//	имяСчет = ПланыСчетов.Хозрасчетный.ПолучитьИмяПредопределенного(Счет); 
		//    КорСчет = ВыборкаСтроки.КорСчет;
		//	имяКорСчет = ПланыСчетов.Хозрасчетный.ПолучитьИмяПредопределенного(КорСчет);
		//	
		//	Если имяСчет <> "" Тогда
		//		Если ЭтоСчетГруппа(Счет) Тогда
		//			ОтборСчета = "Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный." + имяСчет + "))";
		//		Иначе
		//			ОтборСчета = "Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный." + имяСчет + ")";
		//		КонецЕсли;
		//	Иначе
		//		ЗначениеСчет = ПланыСчетов.Хозрасчетный.НайтиПоКоду(Счет.Код);
		//		Если (ЗначениеСчет <> Неопределено) и (ЗначениеСчет <> ПланыСчетов.Хозрасчетный.ПустаяССылка())Тогда
		//			имяПараметраСчет = "счет" + Строка(номПараметра)+ "_" + СтрЗаменить(Счет.Код,".","_");
		//			Если ЭтоСчетГруппа(Счет) Тогда
		//				ОтборСчета = "Счет В ИЕРАРХИИ(&" + имяПараметраСчет + ")";
		//			Иначе
		//				ОтборСчета = "Счет = &" + имяПараметраСчет;
		//			КонецЕсли;
		//			ПараметрыПостроителя.Вставить(имяПараметраСчет,ЗначениеСчет);
		//		Иначе
		//			ОтборСчета = "";
		//		КонецЕсли;
		//	КонецЕсли;
		//	
		//	Если имяКорСчет <> "" Тогда
		//		Если ЭтоСчетГруппа(КорСчет) Тогда
		//			ОтборКорСчета = "КорСчет В ИЕРАРХИИ  (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный." + имяКорСчет + "))";
		//		Иначе
		//			ОтборКорСчета = "КорСчет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный." + имяКорСчет + ")";
		//		КонецЕсли;
		//	Иначе
		//		ЗначениеКорСчет = ПланыСчетов.Хозрасчетный.НайтиПоКоду(КорСчет.Код);
		//		Если (ЗначениеКорСчет <> Неопределено) И (ЗначениеКорСчет <> ПланыСчетов.Хозрасчетный.ПустаяССылка())Тогда
		//			имяПараметраКорСчет = "счет" + Строка(номПараметра)+ "_" + СтрЗаменить(КорСчет.Код,".","_"); 
		//			Если ЭтоСчетГруппа(КорСчет) Тогда
		//				ОтборКорСчета = "КорСчет В ИЕРАРХИИ (&" + имяПараметраКорСчет + ")";
		//			Иначе
		//				ОтборКорСчета = "КорСчет = &" + имяПараметраКорСчет;
		//			КонецЕсли;
		//			ПараметрыПостроителя.Вставить(имяПараметраКорСчет,ЗначениеКорСчет);
		//		Иначе
		//			ОтборКорСчета  = "";
		//		КонецЕсли;
		//	КонецЕсли;
		//    //
		//	Дебет = ВыборкаСтроки.Дебет;			
		//	Кредит = ВыборкаСтроки.Кредит;
		//	Если Дебет Тогда
		//		стрОборота = "СуммаОборотДт";
		//	Иначе
		//		стрОборота = "СуммаОборотКт";
		//	КонецЕсли;	
		//	//
		//	ОтборПодразделение = "";
		//	Подразделение = ВыборкаСтроки.Подразделение;
		//	
		//    //
		//	СтрокаОтбораСубконто = "";
		//	
		//	Для Каждого счВидСубконто Из Счет.ВидыСубконто.Выгрузить() Цикл
		//		Если счВидСубконто.ВидСубконто = ВыборкаСтроки["ВидСубконто"+счВидСубконто.НомерСтроки] Тогда
		//			
		//			НомерСубконто = счВидСубконто.НомерСтроки;
		//			имяПараметра = "с" + Строка(номПараметра) + "_"+ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ПолучитьИмяПредопределенного(счВидСубконто.ВидСубконто);
		//			
		//			Если ТипЗнч(ВыборкаСтроки["ЗначениеСубконто"+счВидСубконто.НомерСтроки]) <> Тип("СписокЗначений") Тогда
		//				
		//				Если ВыборкаСтроки["ЗначениеСубконто"+счВидСубконто.НомерСтроки] <> Неопределено Тогда 
		//					Если НЕ ВыборкаСтроки["ЗначениеСубконто"+счВидСубконто.НомерСтроки].Пустая() Тогда
		//						Если СтрокаОтбораСубконто = "" Тогда
		//							Если ВыборкаСтроки["Субк"+НомерСубконто+"Условие"] Тогда
		//								СтрокаОтбораСубконто = СтрокаОтбораСубконто + "Субконто"+Строка(НомерСубконто)+" <> &"+имяПараметра;
		//							Иначе
		//								СтрокаОтбораСубконто = СтрокаОтбораСубконто + "Субконто"+Строка(НомерСубконто)+" = &"+имяПараметра;
		//							КонецЕсли;
		//						Иначе
		//							Если ВыборкаСтроки["Субк"+НомерСубконто+"Условие"] Тогда
		//								СтрокаОтбораСубконто = СтрокаОтбораСубконто + " И Субконто"+Строка(НомерСубконто)+" <> &"+имяПараметра;
		//							Иначе
		//								СтрокаОтбораСубконто = СтрокаОтбораСубконто + " И Субконто"+Строка(НомерСубконто)+" = &"+имяПараметра;
		//							КонецЕсли;
		//						КонецЕсли;
		//						ЗначениеСубконто = ВыборкаСтроки["ЗначениеСубконто"+счВидСубконто.НомерСтроки];
		//						ПараметрыПостроителя.Вставить(имяПараметра,ЗначениеСубконто);
		//					КонецЕсли;
		//				КонецЕсли;
		//				
		//			Иначе  // Список значений
		//				
		//				индСписка = 1;
		//				
		//				Для Каждого знчСписка Из ВыборкаСтроки["ЗначениеСубконто"+счВидСубконто.НомерСтроки] Цикл
		//					
		//					имяПараметраСп = имяПараметра + "Сп" + Строка(индСписка);
		//					
		//					Если СтрокаОтбораСубконто = "" Тогда
		//						Если ВыборкаСтроки["Субк"+НомерСубконто+"Условие"] Тогда
		//							СтрокаОтбораСубконто = СтрокаОтбораСубконто + "(Субконто"+Строка(НомерСубконто)+" <> &"+имяПараметраСп;
		//						Иначе
		//							СтрокаОтбораСубконто = СтрокаОтбораСубконто + "(Субконто"+Строка(НомерСубконто)+" = &"+имяПараметраСп;
		//						КонецЕсли;
		//					Иначе
		//						Если ВыборкаСтроки["Субк"+НомерСубконто+"Условие"] Тогда
		//							Если индСписка = 1 Тогда
		//								СтрокаОтбораСубконто = СтрокаОтбораСубконто + " И (Субконто"+Строка(НомерСубконто)+" <> &"+имяПараметраСп;
		//							Иначе
		//								СтрокаОтбораСубконто = СтрокаОтбораСубконто + " И Субконто"+Строка(НомерСубконто)+" <> &"+имяПараметраСп;
		//							КонецЕсли;
		//						Иначе
		//							Если индСписка = 1 Тогда
		//								СтрокаОтбораСубконто = СтрокаОтбораСубконто + " И (Субконто"+Строка(НомерСубконто)+" = &"+имяПараметраСп;
		//							Иначе
		//								СтрокаОтбораСубконто = СтрокаОтбораСубконто + " ИЛИ Субконто"+Строка(НомерСубконто)+" = &"+имяПараметраСп;
		//							КонецЕсли;
		//						КонецЕсли;
		//					КонецЕсли;
		//					
		//					ЗначениеСубконто = знчСписка.Значение;
		//					ПараметрыПостроителя.Вставить(имяПараметраСп,ЗначениеСубконто);
		//					
		//					индСписка = индСписка + 1;
		//					
		//				КонецЦикла;	
		//				СтрокаОтбораСубконто = СтрокаОтбораСубконто + ")";
		//				
		//			КонецЕсли;
		//			
		//		КонецЕсли;	
		//	КонецЦикла;
		//	
		//	Для Каждого счВидСубконто Из КорСчет.ВидыСубконто.Выгрузить() Цикл
		//		Если счВидСубконто.ВидСубконто = ВыборкаСтроки["ВидКорСубконто"+счВидСубконто.НомерСтроки] Тогда
		//			
		//			НомерСубконто = счВидСубконто.НомерСтроки;
		//			имяПараметра = "к" + Строка(номПараметра) + "_"+ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ПолучитьИмяПредопределенного(счВидСубконто.ВидСубконто);
		//			
		//			Если ТипЗнч(ВыборкаСтроки["ЗначениеКорСубконто"+счВидСубконто.НомерСтроки]) <> Тип("СписокЗначений") Тогда
		//				
		//				Если ВыборкаСтроки["ЗначениеКорСубконто"+счВидСубконто.НомерСтроки] <> Неопределено Тогда 
		//					Если НЕ ВыборкаСтроки["ЗначениеКорСубконто"+счВидСубконто.НомерСтроки].Пустая() Тогда
		//						Если СтрокаОтбораСубконто = "" Тогда
		//							Если ВыборкаСтроки["КорСубк"+НомерСубконто+"Условие"] Тогда
		//								СтрокаОтбораСубконто = СтрокаОтбораСубконто + "КорСубконто"+Строка(НомерСубконто)+" <> &"+имяПараметра;
		//							Иначе
		//								СтрокаОтбораСубконто = СтрокаОтбораСубконто + "КорСубконто"+Строка(НомерСубконто)+" = &"+имяПараметра;
		//							КонецЕсли;
		//						Иначе
		//							Если ВыборкаСтроки["КорСубк"+НомерСубконто+"Условие"] Тогда
		//								СтрокаОтбораСубконто = СтрокаОтбораСубконто + " И КорСубконто"+Строка(НомерСубконто)+" <> &"+имяПараметра;
		//							Иначе
		//								СтрокаОтбораСубконто = СтрокаОтбораСубконто + " И КорСубконто"+Строка(НомерСубконто)+" = &"+имяПараметра;
		//							КонецЕсли;
		//						КонецЕсли;
		//						ЗначениеКорСубконто = ВыборкаСтроки["ЗначениеКорСубконто"+счВидСубконто.НомерСтроки];
		//						ПараметрыПостроителя.Вставить(имяПараметра,ЗначениеКорСубконто);
		//					КонецЕсли;
		//				КонецЕсли;
		//				
		//			Иначе  // Список значений
		//				
		//				индСписка = 1;
		//				
		//				Для Каждого знчСписка Из ВыборкаСтроки["ЗначениеКорСубконто"+счВидСубконто.НомерСтроки] Цикл
		//					
		//					имяПараметраСп = имяПараметра + "Сп" + Строка(индСписка);
		//					
		//					Если СтрокаОтбораСубконто = "" Тогда
		//						Если ВыборкаСтроки["КорСубк"+НомерСубконто+"Условие"] Тогда
		//							СтрокаОтбораСубконто = СтрокаОтбораСубконто + "(КорСубконто"+Строка(НомерСубконто)+" <> &"+имяПараметраСп;
		//						Иначе
		//							СтрокаОтбораСубконто = СтрокаОтбораСубконто + "(КорСубконто"+Строка(НомерСубконто)+" = &"+имяПараметраСп;
		//						КонецЕсли;
		//					Иначе
		//						Если ВыборкаСтроки["КорСубк"+НомерСубконто+"Условие"] Тогда
		//							Если индСписка = 1 Тогда
		//								СтрокаОтбораСубконто = СтрокаОтбораСубконто + " И (КорСубконто"+Строка(НомерСубконто)+" <> &"+имяПараметраСп;
		//							Иначе
		//								СтрокаОтбораСубконто = СтрокаОтбораСубконто + " И КорСубконто"+Строка(НомерСубконто)+" <> &"+имяПараметраСп;
		//							КонецЕсли;
		//						Иначе
		//							Если индСписка = 1 Тогда
		//								СтрокаОтбораСубконто = СтрокаОтбораСубконто + " И (КорСубконто"+Строка(НомерСубконто)+" = &"+имяПараметраСп;
		//							Иначе
		//								СтрокаОтбораСубконто = СтрокаОтбораСубконто + " ИЛИ КорСубконто"+Строка(НомерСубконто)+" = &"+имяПараметраСп;
		//							КонецЕсли;
		//						КонецЕсли;
		//					КонецЕсли;
		//					
		//					ЗначениеСубконто = знчСписка.Значение;
		//					ПараметрыПостроителя.Вставить(имяПараметраСп,ЗначениеСубконто);
		//					
		//					индСписка = индСписка + 1;
		//					
		//				КонецЦикла;	
		//				СтрокаОтбораСубконто = СтрокаОтбораСубконто + ")";
		//				
		//			КонецЕсли;
		//			
		//		КонецЕсли;	
		//	КонецЦикла;

		//	Если Подразделение <> Справочники.ПодразделенияОрганизаций.ПустаяСсылка() Тогда
		//		Если СтрокаОтбораСубконто = "" Тогда
		//			ОтборПодразделение = " Подразделение = &Подразделение" + Строка(номПараметра); 
		//		Иначе
		//			ОтборПодразделение = " И Подразделение = &Подразделение" + Строка(номПараметра); 
		//		КонецЕсли;
		//		ПараметрыПостроителя.Вставить("Подразделение"+ Строка(номПараметра),Подразделение);
		//	Иначе
		//		ОтборПодразделение = "";
		//	КонецЕсли;

		//	
		//	Вычитать = ВыборкаСтроки.Вычитать;
		//	КолСтрок = НастройкиИсточника.Количество();
		//	Если КолСтрок = 1 Тогда
		//		
		//		ТекстЗапроса = 
		//		"ВЫБРАТЬ
		//		|	ЕСТЬNULL(СУММА(ХозрасчетныйОбороты."+стрОборота+"),0) КАК Сумма,
		//		|	ХозрасчетныйОбороты.Период
		//		|ИЗ
		//		|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, День,"+ОтборСчета+", , "+СтрокаОтбораСубконто+ОтборПодразделение + ","+ОтборКорСчета+",) КАК ХозрасчетныйОбороты
		//		|СГРУППИРОВАТЬ ПО
		//        |ХозрасчетныйОбороты.Период";
		//	Иначе
		//		
		//		Собираем = (КолСтрок = номПараметра);
		//						
		//		тРезультат = тРезультат + " Обороты"+Строка(номПараметра)+ ".Сумма"+Строка(номПараметра)+ ?(Собираем,"",?(Вычитать," - "," + "));
		//						
		//		тЗапроса = тЗапроса + 
		//		"(ВЫБРАТЬ
		//		|	ЕСТЬNULL(СУММА(ХозрасчетныйОбороты."+стрОборота+"),0) КАК Сумма"+Строка(номПараметра)+"
		//		|ИЗ
		//		|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, ,"+ОтборСчета+", , "+СтрокаОтбораСубконто+ОтборПодразделение + ","+ОтборКорСчета+",) КАК ХозрасчетныйОбороты) КАК Обороты"+Строка(номПараметра)+ ?(Собираем,"",",") + Символы.ПС ;
		//		
		//		Если Собираем Тогда //Собираем                                                                                                                               
		//			ТекстЗапроса = 
		//			"ВЫБРАТЬ
		//			|" + тРезультат + тКонецШапки + Символы.ПС +
		//		   "&КонецПериода КАК Период
		//		    |ИЗ" + Символы.ПС +
		//		   ""+ тЗапроса;
		//		КонецЕсли;	
		//		
		//	КонецЕсли;
		//	
		//	номПараметра = номПараметра + 1;
		//	
		//КонецЦикла;
		//
		НастройкиПостроителя.Вставить("ПараметрыПостроителя",ПараметрыПостроителя);
		
		обИсточник.НастройкиПостроителя = Новый ХранилищеЗначения(НастройкиПостроителя, Новый СжатиеДанных());
		обИсточник.ПроизвольныйЗапрос = Истина;
		
		обИсточник.ТекстЗапроса = ТекстЗапроса; 
		
		Показатели = обИсточник.Показатели;
		Показатели.Очистить();
		нСтрока=Показатели.Добавить();
		нСтрока.Имя="Сумма";
		нСтрока.Представление="Сумма";
		нСтрока.Использование=Истина;
		
		ДатыОтбораДанныхИсточника = обИсточник.ДатыОтбораДанныхИсточника;
		ДатыОтбораДанныхИсточника.Очистить();
		нСтрока = ДатыОтбораДанныхИсточника.Добавить();
		нСтрока.ИмяДатаГраницы = "НачалоПериода";
		нСтрока.ПредставлениеДатыГраницы = "Дата начала периода";
		нСтрока.НачальнаяГраницаОтсчета	= Перечисления.ВидыГраницОтбораИсточникаПланирования.НачалоПериода;
		
		нСтрока = ДатыОтбораДанныхИсточника.Добавить();
		нСтрока.ИмяДатаГраницы = "КонецПериода";
		нСтрока.ПредставлениеДатыГраницы = "Дата конца периода";
		нСтрока.НачальнаяГраницаОтсчета	= Перечисления.ВидыГраницОтбораИсточникаПланирования.КонецПериода;
		
		обИсточник.Записать();
		
		Сообщить ("Запрос записан.");
		//Прервать;

	КонецЦикла;

КонецПроцедуры	


Процедура СгенерироватьЗапросПоНастройкамРегНакопления(СтатьяБюджета) Экспорт
	
	номПараметра = 1;
	
	Источник = СтатьяБюджета.ИсточникДанныхДляФакта;
	
	Если Источник <> Справочники.ИсточникиДанныхДляРасчетовБюджетирования.ПустаяСсылка() Тогда
		обИсточник = Источник.ПолучитьОбъект();
	Иначе
		Возврат;
	КонецЕсли;
	
	ПараметрыПостроителя = обИсточник.НастройкиПостроителя.Получить().ПараметрыПостроителя; 
	НастройкиПостроителя = обИсточник.НастройкиПостроителя.Получить();
	Если ПараметрыПостроителя.Количество() > 0 Тогда
		ПараметрыПостроителя.Очистить();
	КонецЕсли;	                                             
	
	тНачалоШапки = "ВЫБРАТЬ ";                               
	тРезультат = "";
	тЗапроса   = "";
	тКонецШапки = " КАК Сумма,";                         
	
	НастройкиИсточника = СтатьяБюджета.ХранилищеНастроекПоРегНак.Получить();
	
	Если НастройкиИсточника = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	Для Каждого ВыборкаСтроки Из НастройкиИсточника Цикл
		
		Вычитать = ВыборкаСтроки.Вычитать;
		КолСтрок = НастройкиИсточника.Количество();
		
		имяПараметрСтатья = "СтатьяОборотов" + Строка(номПараметра);
		имяПараметрСценарий = "Сценарий" + Строка(номПараметра);
		
		ПараметрыПостроителя.Вставить(имяПараметрСтатья,ВыборкаСтроки.СтатьяОборотовПоБюджетам);
		ПараметрыПостроителя.Вставить(имяПараметрСценарий,ВыборкаСтроки.Сценарий);
		
		Если ВыборкаСтроки.СтатьяОборотовПоБюджетам.ЭтоГруппа Тогда
			СтрокаОтбора =   "СтатьяОборотов В ИЕРАРХИИ (&" + имяПараметрСтатья + ") И Сценарий = &" + имяПараметрСценарий;
		Иначе
			СтрокаОтбора =   "СтатьяОборотов = &" + имяПараметрСтатья + " И Сценарий = &" + имяПараметрСценарий;
		КонецЕсли;

		Если КолСтрок = 1 Тогда
			
			ТекстЗапроса = 
			"ВЫБРАТЬ
			|	СУММА(ОборотыБюджетовОбороты.СуммаУпрОборот) КАК Сумма,
			|	ОборотыБюджетовОбороты.Период
			|ИЗ
			|	РегистрНакопления.ОборотыБюджетов.Обороты(&НачалоПериода, &КонецПериода, День, " + СтрокаОтбора + ") КАК ОборотыБюджетовОбороты
			|
			|СГРУППИРОВАТЬ ПО
			|	ОборотыБюджетовОбороты.Период"
			
		Иначе
			
			Собираем = (КолСтрок = номПараметра);
			
			тРезультат = тРезультат + " ВложенныйЗапрос"+Строка(номПараметра)+ ".Сумма"+Строка(номПараметра)+ ?(Собираем,"",?(Вычитать," - "," + "));
			
			тЗапроса = тЗапроса + 
			"(ВЫБРАТЬ
		    |ЕСТЬNULL(СУММА(ОборотыБюджетовОбороты.СуммаУпрОборот), 0) КАК Сумма" + Строка(номПараметра) + " 
			|ИЗ
		    |РегистрНакопления.ОборотыБюджетов.Обороты(&НачалоПериода,&КонецПериода,," +СтрокаОтбора+ ") КАК ОборотыБюджетовОбороты) КАК ВложенныйЗапрос" + Строка(номПараметра)+ ?(Собираем,"",",") + Символы.ПС ;
			
			Если Собираем Тогда //Собираем                                                                                                                               
				ТекстЗапроса = 
				"ВЫБРАТЬ
				|" + тРезультат + тКонецШапки + Символы.ПС +
				"&КонецПериода КАК Период
				|ИЗ" + Символы.ПС +
				""+ тЗапроса;
			КонецЕсли;	
			
		КонецЕсли;
		
		номПараметра = номПараметра + 1;
		
	КонецЦикла;
	
	НастройкиПостроителя.Вставить("ПараметрыПостроителя",ПараметрыПостроителя);
	
	обИсточник.НастройкиПостроителя = Новый ХранилищеЗначения(НастройкиПостроителя, Новый СжатиеДанных());
	обИсточник.ПроизвольныйЗапрос = Истина;
	
	обИсточник.ТекстЗапроса = ТекстЗапроса; 
	
	Показатели = обИсточник.Показатели;
	Показатели.Очистить();
	нСтрока=Показатели.Добавить();
	нСтрока.Имя="Сумма";
	нСтрока.Представление="Сумма";
	нСтрока.Использование=Истина;
	
	ДатыОтбораДанныхИсточника = обИсточник.ДатыОтбораДанныхИсточника;
	ДатыОтбораДанныхИсточника.Очистить();
	нСтрока = ДатыОтбораДанныхИсточника.Добавить();
	нСтрока.ИмяДатаГраницы = "НачалоПериода";
	нСтрока.ПредставлениеДатыГраницы = "Дата начала периода";
	нСтрока.НачальнаяГраницаОтсчета	= Перечисления.ВидыГраницОтбораИсточникаПланирования.НачалоПериода;
	
	нСтрока = ДатыОтбораДанныхИсточника.Добавить();
	нСтрока.ИмяДатаГраницы = "КонецПериода";
	нСтрока.ПредставлениеДатыГраницы = "Дата конца периода";
	нСтрока.НачальнаяГраницаОтсчета	= Перечисления.ВидыГраницОтбораИсточникаПланирования.КонецПериода;
	
	обИсточник.Записать();
	
	Сообщить ("Запрос записан.");

КонецПроцедуры	
/////////////////////////////////////////////////////////////////////////////////////////////////////////////
// Блок процедур для получения данных напрямую из учетных подсистем, используя источники данных

////////////////////////////////////////////////////////////////////////////////////////////////////////////
// Обороты по источникам данных

#Если Клиент Тогда
Процедура ДобавитьВТекстОсновногоЗапросаОбороты(СтатьяИсточник,ТекстОсновногоЗапроса,ТекстЗапросаПериод,СтруктураПараметров,НомерСтатьи, 
								СтруктураИспользуемыхИзмерений,ДатаНач,ДатаКон)
	
	ПостроительОтчета=Новый ПостроительОтчета; // Основной построитель отчета
	
	ТекстЗапроса=СтатьяИсточник.ТекстЗапроса;
	
	СохраненнаяНастройка=СтатьяИсточник.НастройкиПостроителя.Получить();
	
	ИзмеренияИсточника=СтатьяИсточник.ИзмеренияИсточника.Выгрузить();
	ДатыОтбораДанныхИсточника=СтатьяИсточник.ДатыОтбораДанныхИсточника.Выгрузить();
	КодИсточника="Статья_"+НомерСтатьи;
	
	Если ТипЗнч(СохраненнаяНастройка.НастройкиПостроителя)=Тип("НастройкиПостроителяОтчета") Тогда
		
		Для Каждого Параметр Из СохраненнаяНастройка.ПараметрыПостроителя Цикл
			СтруктураПараметров.Вставить(Параметр.Ключ+КодИсточника,Параметр.Значение);
			ТекстЗапроса=СтрЗаменить(ТекстЗапроса,"&"+Параметр.Ключ,"&"+Параметр.Ключ+КодИсточника);
		КонецЦикла;
		
		Для каждого Граница Из ДатыОтбораДанныхИсточника Цикл
			
			Если Граница.НачальнаяГраницаОтсчета=Перечисления.ВидыГраницОтбораИсточникаПланирования.ФиксированнаяДата Тогда
				НачальнаяДатаГраницы=Граница.ДатаНачальнойГраницыОтсчета;
			ИначеЕсли Граница.НачальнаяГраницаОтсчета=Перечисления.ВидыГраницОтбораИсточникаПланирования.НачалоПериода Тогда
				НачальнаяДатаГраницы=ДатаНач;
			ИначеЕсли Граница.НачальнаяГраницаОтсчета=Перечисления.ВидыГраницОтбораИсточникаПланирования.КонецПериода Тогда
				НачальнаяДатаГраницы=КонецДня(ДатаКон);
			КонецЕсли;
						
			ТекстЗапроса=СтрЗаменить(ТекстЗапроса,"&"+Граница.ИмяДатаГраницы,"&"+Граница.ИмяДатаГраницы+КодИсточника);
			СтруктураПараметров.Вставить(Граница.ИмяДатаГраницы+КодИсточника,НачальнаяДатаГраницы);
			
		КонецЦикла;
		
		ПостроительОтчета.Текст=ТекстЗапроса;
		
		Если СтатьяИсточник.ПроизвольныйЗапрос Тогда
			
			ПостроительОтчета.ЗаполнитьНастройки();
			
		КонецЕсли;
		
		ПостроительОтчета.УстановитьНастройки(СохраненнаяНастройка.НастройкиПостроителя,Истина,Ложь,Истина,Истина);
	Иначе
		Возврат;
	КонецЕсли;
	
	// Формируем структуру измерений для запроса
	
	СтруктураИзмерений=Новый Структура;
	СтруктураИзмерений.Вставить("Валюта","Валюта");
	
	Для Каждого СтрокаСвязь ИЗ ИзмеренияИсточника Цикл
		
		ИмяИзмерения=Строка(СтрокаСвязь.ИзмерениеБюджетирования);
		
		Если СтруктураИспользуемыхИзмерений.Свойство(ИмяИзмерения) ИЛИ ИмяИзмерения="Валюта" Тогда
			
			СтруктураИзмерений.Вставить(ИмяИзмерения,СтрокаСвязь.ИмяПоляИсточника);
			
		Иначе
			
			ПолеКУдалению=ПостроительОтчета.ВыбранныеПоля.Найти(СтрокаСвязь.ИмяПоляИсточника);
			
			Если НЕ ПолеКУдалению=Неопределено Тогда
				ПостроительОтчета.ВыбранныеПоля.Удалить(ПолеКУдалению);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
		
	ПолеПериод=ПостроительОтчета.ДоступныеПоля.Найти("Период");
	
	Если (Не ПолеПериод=Неопределено) И ПостроительОтчета.ВыбранныеПоля.Найти(ПолеПериод.Имя)=Неопределено Тогда
		
		ПостроительОтчета.ВыбранныеПоля.Добавить(ПолеПериод.Имя,ПолеПериод.Имя);
		СтруктураИзмерений.Вставить("Период",ПолеПериод.Имя);
		
	КонецЕсли;
		
	// Убираем валюту из измерений запроса, если она не используется при получении сумм по статье	
	Если (НЕ СтатьяИсточник.СпособОпределенияВалютыОборотаФакт=Перечисления.СпособыОпределенияВалютыОборотаПоСтатье.ВалютаИсточникаДанных)
		И СтруктураИзмерений.Свойство("Валюта") Тогда
		
		ПолеВалюта=ПостроительОтчета.ВыбранныеПоля.Найти(СтруктураИзмерений.Валюта);
		
		Если Не ПолеВалюта=Неопределено Тогда
			
			ПостроительОтчета.ВыбранныеПоля.Удалить(ПолеВалюта);
			
		КонецЕсли;
		
	КонецЕсли;
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	// Настраиваем построитель для получения валюты и периодов оборотов для дальнейшего расчета суммы в валюте упр. учета
	
	ПостроительОтчетаПериод=Новый ПостроительОтчета;
	ПостроительОтчетаПериод.Текст=ПостроительОтчета.Текст;
	
	Если СтатьяИсточник.ПроизвольныйЗапрос Тогда
		
		ПостроительОтчетаПериод.ЗаполнитьНастройки();
		
	КонецЕсли;
	
	ПостроительОтчетаПериод.УстановитьНастройки(СохраненнаяНастройка.НастройкиПостроителя,Истина,Ложь,Истина,Истина);
	
	ПостроительОтчетаПериод.ВыбранныеПоля.Очистить();
	
	Если Не ПолеПериод=Неопределено Тогда
		
		ПостроительОтчетаПериод.ВыбранныеПоля.Добавить(ПолеПериод.Имя,ПолеПериод.Имя);
		
	КонецЕсли;
	
	Если СтатьяИсточник.СпособОпределенияВалютыОборотаФакт=Перечисления.СпособыОпределенияВалютыОборотаПоСтатье.ВалютаИсточникаДанных
		И СтруктураИзмерений.Свойство("Валюта") Тогда
		
		СтрокаВалюта=ИзмеренияИсточника.Найти(Перечисления.ИзмеренияБюджетирования.Валюта,"ИзмерениеБюджетирования");
		
		Если Не СтрокаВалюта=Неопределено Тогда
			
			ПостроительОтчетаПериод.ВыбранныеПоля.Добавить(СтрокаВалюта.ПутьКДанным,СтрокаВалюта.ИмяПоляИсточника);
			
		КонецЕсли;
		
	КонецЕсли;
		  
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////	
	
			
	РабочийТекст=ПостроительОтчета.ПолучитьЗапрос().Текст;
	РабочийТекстПериод=ПостроительОтчетаПериод.ПолучитьЗапрос().Текст;
	
	// Определим параметры отбора
	Индекс=1;
	Для Каждого СтрокаОтбора Из ПостроительОтчета.Отбор Цикл
		
		Если СтрокаОтбора.Использование=Истина Тогда
			
			Если СтрокаОтбора.ЗначениеС=Неопределено ИЛИ (НЕ ЗначениеЗаполнено(СтрокаОтбора.ЗначениеС)) ИЛИ СтрокаОтбора.ВидСравнения = ВидСравнения.Равно Тогда
				РабочийТекст=СтрЗаменить(РабочийТекст,"Параметр"+Индекс,"Параметр_"+КодИсточника+"_"+Индекс);
				РабочийТекстПериод=СтрЗаменить(РабочийТекстПериод,"Параметр"+Индекс,"Параметр_"+КодИсточника+"_"+Индекс);
				
				СтруктураПараметров.Вставить("Параметр_"+КодИсточника+"_"+Индекс,СтрокаОтбора.Значение);
				Индекс=Индекс+1;
			Иначе
				РабочийТекст=СтрЗаменить(РабочийТекст,"Параметр"+Индекс,"Параметр_"+КодИсточника+"_"+Индекс);
				РабочийТекстПериод=СтрЗаменить(РабочийТекстПериод,"Параметр"+Индекс,"Параметр_"+КодИсточника+"_"+Индекс);
				
				СтруктураПараметров.Вставить("Параметр_"+КодИсточника+"_"+Индекс,СтрокаОтбора.ЗначениеС);
				Индекс=Индекс+1;
				РабочийТекст=СтрЗаменить(РабочийТекст,"Параметр"+Индекс,"Параметр_"+КодИсточника+"_"+Индекс);
				РабочийТекстПериод=СтрЗаменить(РабочийТекстПериод,"Параметр"+Индекс,"Параметр_"+КодИсточника+"_"+Индекс);
				СтруктураПараметров.Вставить("Параметр_"+КодИсточника+"_"+Индекс,СтрокаОтбора.ЗначениеПо);
				Индекс=Индекс+1;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Формируем текст основного запроса
	
	ТекстЗапросаИсточник="
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|&Статья"+КодИсточника+" КАК СтатьяОборотов,";
	
	СтруктураПараметров.Вставить("Статья"+КодИсточника,СтатьяИсточник.СтатьяОборотов);
	
	Если СтруктураИзмерений.Свойство("Период") Тогда
		ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
		|Период,";	
	Иначе
		ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
		|&МоментВремени КАК Период,";	
	КонецЕсли;
		
	Если СтруктураИзмерений.Свойство("ЦФО") Тогда
		ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
		|"+СтруктураИзмерений.ЦФО+" КАК ЦФО,";
	Иначе
		ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
		|&ПустойЦФО КАК ЦФО,";	
	КонецЕсли;
	
	Если СтруктураИзмерений.Свойство("Проект") Тогда
		ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
		|"+СтруктураИзмерений.Проект+" КАК Проект,";
	Иначе
		ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
		|&ПустойПроект КАК Проект,";	
	КонецЕсли;
	
	Если СтруктураИзмерений.Свойство("Контрагент") Тогда
		ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
		|"+СтруктураИзмерений.Контрагент+" КАК Контрагент,";
	Иначе
		ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
		|&ПустойКонтрагент КАК Контрагент,";	
	КонецЕсли;
	
	Если СтруктураИзмерений.Свойство("Номенклатура") Тогда
		ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
		|"+СтруктураИзмерений.Номенклатура+" КАК Номенклатура,";
	Иначе
		ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
		|&ПустойНоменклатура КАК Номенклатура,";	
	КонецЕсли;
	
	Если СтатьяИсточник.СпособОпределенияВалютыОборотаФакт=Перечисления.СпособыОпределенияВалютыОборотаПоСтатье.ВалютаИсточникаДанных Тогда
		ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
		|"+СтруктураИзмерений.Валюта+" КАК Валюта,";
	ИначеЕсли СтатьяИсточник.СпособОпределенияВалютыОборотаФакт=Перечисления.СпособыОпределенияВалютыОборотаПоСтатье.ВалютаРегламентированногоУчета Тогда
		ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
		|&ВалютаРеглУчета КАК Валюта,";
	ИначеЕсли СтатьяИсточник.СпособОпределенияВалютыОборотаФакт=Перечисления.СпособыОпределенияВалютыОборотаПоСтатье.ВалютаУправленческогоУчета Тогда
		ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
		|&ВалютаУпрУчета КАК Валюта,";
	ИначеЕсли СтатьяИсточник.СпособОпределенияВалютыОборотаФакт=Перечисления.СпособыОпределенияВалютыОборотаПоСтатье.ОсновнаяВалютаСтатьи Тогда
		ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
		|&Валюта"+КодИсточника+" КАК Валюта,";
		СтруктураПараметров.Вставить("Валюта"+КодИсточника,СтатьяИсточник.ОсновнаяВалюта);
	КонецЕсли;
	
	Если ПустаяСтрока(СтатьяИсточник.ПоказательИсточникаДанныхДляФактаСум) Тогда
		ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
		|0 КАК Сумма,";
	Иначе
		ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
		|"+СтатьяИсточник.ПоказательИсточникаДанныхДляФактаСум+"*&КоэффициентДляФактаСум_"+КодИсточника+" КАК Сумма,";
		СтруктураПараметров.Вставить("КоэффициентДляФактаСум_"+КодИсточника,СтатьяИсточник.КоэффициентДляФактаСум);
	КонецЕсли;
	
	Если ПустаяСтрока(СтатьяИсточник.ПоказательИсточникаДанныхДляФактаКол) Тогда
		ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
		|0 КАК Количество";
	Иначе
		ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
		|"+СтатьяИсточник.ПоказательИсточникаДанныхДляФактаКол+"*&КоэффициентДляФактаКол_"+КодИсточника+" КАК Количество";
		СтруктураПараметров.Вставить("КоэффициентДляФактаКол_"+КодИсточника,СтатьяИсточник.КоэффициентДляФактаКол);
	КонецЕсли;
	
	ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
	|ИЗ
	|("+РабочийТекст+") КАК "+КодИсточника;
	
	ТекстОсновногоЗапроса=ТекстОсновногоЗапроса+ТекстЗапросаИсточник;
	
	// Формируем текст запроса по периодам
	ТекстЗапросаИсточникПериод="
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ";
	
	Если СтруктураИзмерений.Свойство("Период") Тогда
		ТекстЗапросаИсточникПериод=ТекстЗапросаИсточникПериод+"
		|Период,";	
	Иначе
		ТекстЗапросаИсточникПериод=ТекстЗапросаИсточникПериод+"
		|&МоментВремени КАК Период,";	
	КонецЕсли;
	
	Если СтатьяИсточник.СпособОпределенияВалютыОборотаФакт=Перечисления.СпособыОпределенияВалютыОборотаПоСтатье.ВалютаИсточникаДанных Тогда
		ТекстЗапросаИсточникПериод=ТекстЗапросаИсточникПериод+"
		|"+СтруктураИзмерений.Валюта+" КАК Валюта";
	ИначеЕсли СтатьяИсточник.СпособОпределенияВалютыОборотаФакт=Перечисления.СпособыОпределенияВалютыОборотаПоСтатье.ВалютаРегламентированногоУчета Тогда
		ТекстЗапросаИсточникПериод=ТекстЗапросаИсточникПериод+"
		|&ВалютаРеглУчета КАК Валюта";
	ИначеЕсли СтатьяИсточник.СпособОпределенияВалютыОборотаФакт=Перечисления.СпособыОпределенияВалютыОборотаПоСтатье.ВалютаУправленческогоУчета Тогда
		ТекстЗапросаИсточникПериод=ТекстЗапросаИсточникПериод+"
		|&ВалютаУпрУчета КАК Валюта";
	ИначеЕсли СтатьяИсточник.СпособОпределенияВалютыОборотаФакт=Перечисления.СпособыОпределенияВалютыОборотаПоСтатье.ОсновнаяВалютаСтатьи Тогда
		ТекстЗапросаИсточникПериод=ТекстЗапросаИсточникПериод+"
		|&Валюта"+КодИсточника+" КАК Валюта,";
	КонецЕсли;
	
	ТекстЗапросаИсточникПериод=ТекстЗапросаИсточникПериод+"
	|ИЗ
	|("+РабочийТекстПериод+") КАК "+КодИсточника+"_Период";
	
	ТекстЗапросаПериод=ТекстЗапросаПериод+ТекстЗапросаИсточникПериод;
		
КонецПроцедуры // ДобавитьВТекстОсновногоЗапросаОбороты() 

Функция СформироватьТекстЗапросаПоОборотам(СтруктураИспользуемыхИзмерений,Сценарий,ДатаНач,ДатаКон,ОтборСтатьи) Экспорт
	
	// Выберем статьи оборотов, для которых будем получать данные
	Запрос=Новый Запрос;
	СтруктураПараметров=Новый Структура;
	
	ТекстЗапроса="ВЫБРАТЬ
	|	СтатьиОборотовПоБюджетам.Ссылка КАК СтатьяОборотов,
	|	СтатьиОборотовПоБюджетам.Ссылка.Представление КАК СтатьяОборотовПредставление,
	|	СтатьиОборотовПоБюджетам.ИсточникДанныхДляФакта.ТекстЗапроса КАК ТекстЗапроса,
	|	СтатьиОборотовПоБюджетам.ИсточникДанныхДляФакта.НастройкиПостроителя КАК НастройкиПостроителя,
	|	СтатьиОборотовПоБюджетам.ИсточникДанныхДляФакта.ИзмеренияИсточника КАК ИзмеренияИсточника,
	|	СтатьиОборотовПоБюджетам.ИсточникДанныхДляФакта.ДатыОтбораДанныхИсточника КАК ДатыОтбораДанныхИсточника,
	|	СтатьиОборотовПоБюджетам.ИсточникДанныхДляФакта.ПроизвольныйЗапрос КАК ПроизвольныйЗапрос,
	|	СтатьиОборотовПоБюджетам.ПоказательИсточникаДанныхДляФактаСум,
	|	СтатьиОборотовПоБюджетам.КоэффициентДляФактаСум,
	|	СтатьиОборотовПоБюджетам.СпособОпределенияВалютыОборотаФакт,
	|	СтатьиОборотовПоБюджетам.ПоказательИсточникаДанныхДляФактаКол,
	|	СтатьиОборотовПоБюджетам.КоэффициентДляФактаКол,
	|	СтатьиОборотовПоБюджетам.ОсновнаяВалюта,
	|	СтатьиОборотовПоБюджетам.РазделениеПоКонтрагентам,
	|	СтатьиОборотовПоБюджетам.РазделениеПоНоменклатуре
    |ИЗ
	|	Справочник.СтатьиОборотовПоБюджетам КАК СтатьиОборотовПоБюджетам
	|ГДЕ
	|	СтатьиОборотовПоБюджетам.ИсточникДанныхДляФакта <> &ПустойИсточникДанных";
	
	Если НЕ ОтборСтатьи.Количество()=0 Тогда
		ТекстЗапроса=ТекстЗапроса+"
		|И
		|	СтатьиОборотовПоБюджетам.Ссылка В ИЕРАРХИИ(&СтатьиОборотов)";
		Запрос.УстановитьПараметр("СтатьиОборотов",ОтборСтатьи);
	КонецЕсли;
		
	Запрос.Текст=ТекстЗапроса;
	Запрос.УстановитьПараметр("ПустойИсточникДанных",Новый(Тип("СправочникСсылка.ИсточникиДанныхДляРасчетовБюджетирования")));
	
	ТекстОсновногоЗапроса="";
	ТекстЗапросаПериод="";
	
	СтруктураПараметров=Новый Структура;
	НомерСтатьи=0;
	
	РезультатЗапроса=Запрос.Выполнить().Выбрать();
	
	Пока РезультатЗапроса.Следующий() Цикл
		
		ДобавитьВТекстОсновногоЗапросаОбороты(РезультатЗапроса,ТекстОсновногоЗапроса, ТекстЗапросаПериод,СтруктураПараметров,НомерСтатьи,
					СтруктураИспользуемыхИзмерений,ДатаНач,ДатаКон);	
		НомерСтатьи=НомерСтатьи+1;
		
	КонецЦикла;
	
	ТекстЗапроса=Сред(ТекстОсновногоЗапроса,16);
	ТекстЗапросаПериод=Сред(ТекстЗапросаПериод,16);
	
	Если ТекстЗапроса="" Тогда
		
		Возврат Новый Структура("НетИсточников");
		
	КонецЕсли;
	
	ТекстИтог="ВЫБРАТЬ
	|ВЫРАЗИТЬ(ЗапросПоИсточникам.Период КАК Дата) КАК Период,
	|ВЫРАЗИТЬ(ЗапросПоИсточникам.СтатьяОборотов КАК Справочник.СтатьиОборотовПоБюджетам) КАК СтатьяОборотов,
	|ВЫРАЗИТЬ(ЗапросПоИсточникам.Валюта КАК Справочник.Валюты) КАК Валюта,
	|ВЫРАЗИТЬ(ЗапросПоИсточникам.ЦФО КАК Справочник.Подразделения) КАК ЦФО,
	|ВЫРАЗИТЬ(ЗапросПоИсточникам.Проект КАК Справочник.Проекты) КАК Проект,
	|ВЫРАЗИТЬ(ЗапросПоИсточникам.Контрагент КАК Справочник.Контрагенты) КАК Контрагент,
	|ВЫРАЗИТЬ(ЗапросПоИсточникам.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|ЗапросПоИсточникам.Количество КАК КоличествоОборот,
	|ЗапросПоИсточникам.Сумма КАК ВалютнаяСуммаОборот,
	|ВЫБОР 
	|		КОГДА ВЫРАЗИТЬ(ЗапросПоИсточникам.Валюта КАК Справочник.Валюты)=&ВалютаУпрУчета ТОГДА ЗапросПоИсточникам.Сумма
	|		КОГДА ВЫРАЗИТЬ(ЗапросПоИсточникам.Валюта КАК Справочник.Валюты)<>&ВалютаУпрУчета И КурсыИсточника.Курс <>0 И КурсыУпрУчета.Курс <>0 ТОГДА
	|			ЗапросПоИсточникам.Сумма*КурсыИсточника.Курс * КурсыУпрУчета.Кратность 
	|			/ (КурсыУпрУчета.Курс * КурсыИсточника.Кратность)
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ  КАК СуммаУпрОборот	
	|ИЗ
	|("+ТекстЗапроса+") КАК ЗапросПоИсточникам
	// Курсы источников 
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|(ВЫБРАТЬ 
	|	ПериодПоследнейЗаписиКурсаНаДатуОборота.Дата КАК Дата, 
	|	КурсыВалют.Курс КАК Курс, 
	|	КурсыВалют.Кратность КАК Кратность,
	|	КурсыВалют.Валюта КАК Валюта
	|ИЗ РегистрСведений.КурсыВалют КАК КурсыВалют
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ (
	|	ВЫБРАТЬ
	|		Максимум(КурсыВнутр.Период) КАК Период,
	|		Обороты.Дата КАК Дата,
	|		КурсыВнутр.Валюта КАК Валюта
	|	ИЗ РегистрСведений.КурсыВалют КАК КурсыВнутр
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ (
	|			ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			ЗапросПоПериодам.Период КАК Дата,
	|			ЗапросПоПериодам.Валюта КАК ВалютаДок
	|		ИЗ 
	|		("+ТекстЗапросаПериод+") КАК ЗапросПоПериодам
	|		) КАК Обороты
	|ПО Обороты.Дата >= КурсыВнутр.Период
	|	И КурсыВнутр.Валюта = Обороты.ВалютаДок
	|	СГРУППИРОВАТЬ ПО Обороты.Дата, КурсыВнутр.Валюта) КАК ПериодПоследнейЗаписиКурсаНаДатуОборота
	|	ПО КурсыВалют.Период = ПериодПоследнейЗаписиКурсаНаДатуОборота.Период И 
	|      КурсыВалют.Валюта = ПериодПоследнейЗаписиКурсаНаДатуОборота.Валюта) КАК КурсыИсточника
	|ПО КурсыИсточника.Дата = ЗапросПоИсточникам.Период И
	|   КурсыИсточника.Валюта = ВЫРАЗИТЬ(ЗапросПоИсточникам.Валюта КАК Справочник.Валюты)
	// Курсы валюты управленческого учета
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|(ВЫБРАТЬ 
	|	ПериодПоследнейЗаписиКурсаНаДатуОборота.Дата КАК Дата, 
	|	КурсыВалют.Курс КАК Курс, 
	|	КурсыВалют.Кратность КАК Кратность
	|ИЗ РегистрСведений.КурсыВалют КАК КурсыВалют
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ (
	|	ВЫБРАТЬ
	|		МАКСИМУМ(КурсыВнутр.Период) КАК Период,
	|		Обороты.Дата КАК Дата
	|	ИЗ РегистрСведений.КурсыВалют КАК КурсыВнутр
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ (
	|			ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			ЗапросПоПериодам.Период КАК Дата,
	|			ЗапросПоПериодам.Валюта КАК ВалютаДок
	|		ИЗ 
	|		("+ТекстЗапросаПериод+") КАК ЗапросПоПериодам
	|		) КАК Обороты
	|ПО Обороты.Дата >= КурсыВнутр.Период
	|	И (КурсыВнутр.Валюта = &ВалютаУпрУчета)
	|	СГРУППИРОВАТЬ ПО Обороты.Дата) КАК ПериодПоследнейЗаписиКурсаНаДатуОборота
	|	ПО КурсыВалют.Период = ПериодПоследнейЗаписиКурсаНаДатуОборота.Период
	|ГДЕ КурсыВалют.Валюта = &ВалютаУпрУчета) КАК КурсыУпрУчета
	|ПО КурсыУпрУчета.Дата = ЗапросПоИсточникам.Период";
	
			
	СтруктураПараметров.Вставить("МоментВремени",ДатаНач);	
	СтруктураПараметров.Вставить("ПустойЦФО",Справочники.Подразделения.ПустаяСсылка());
	СтруктураПараметров.Вставить("ПустойПроект",Справочники.Проекты.ПустаяСсылка());
	СтруктураПараметров.Вставить("ПустойКонтрагент",Справочники.Контрагенты.ПустаяСсылка());	
	СтруктураПараметров.Вставить("ВалютаУпрУчета",Константы.ВалютаРегламентированногоУчета.Получить());
	СтруктураПараметров.Вставить("ВалютаРеглУчета",Константы.ВалютаРегламентированногоУчета.Получить());	
	СтруктураПараметров.Вставить("ПустойНоменклатура",?(Сценарий.ДетализацияПланирования=Перечисления.ДетализацияПланирования.НоменклатурныеГруппы,
													Справочники.НоменклатурныеГруппы.ПустаяСсылка(),Справочники.Номенклатура.ПустаяСсылка()));
													
	СтруктураЗапроса=Новый Структура;
	СтруктураЗапроса.Вставить("ТекстЗапроса",ТекстИтог);
	СтруктураЗапроса.Вставить("ПараметрыЗапроса",СтруктураПараметров);
	
	Возврат СтруктураЗапроса;
		
	
КонецФункции // СформироватьТекстЗапросаПоОборотам()

////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//Остатки по источникам данных

Функция СформироватьТекстЗапросаПоОстаткам(СтруктураИспользуемыхИзмерений,Сценарий,ДатаОстатка,ОтборСчета) Экспорт
	
	// Выберем статьи оборотов, для которых будем получать данные
	Запрос=Новый Запрос;
	СтруктураПараметров=Новый Структура;
	
	ТекстЗапроса="ВЫБРАТЬ
	|	Бюджетирование.Ссылка КАК Счет,
	|	Бюджетирование.Валютный КАК Валютный,
	|	Бюджетирование.Количественный КАК Количественный,
	|	БюджетированиеВидыСубконто1.ВидСубконто.Наименование КАК НаименованиеСубконто1,
	|	БюджетированиеВидыСубконто2.ВидСубконто.Наименование КАК НаименованиеСубконто2,
	|	БюджетированиеВидыСубконто3.ВидСубконто.Наименование КАК НаименованиеСубконто3,
	|	Бюджетирование.ИсточникДанныхДляФакта.ТекстЗапроса КАК ТекстЗапроса,
	|	Бюджетирование.ИсточникДанныхДляФакта.НастройкиПостроителя КАК НастройкиПостроителя,
	|	Бюджетирование.ИсточникДанныхДляФакта.ПроизвольныйЗапрос КАК ПроизвольныйЗапрос,
	|	Бюджетирование.ПоказательИсточникаДанныхДляФактаСум КАК ПоказательИсточникаДанныхДляФактаСум,
	|	Бюджетирование.КоэффициентДляФактаСум КАК КоэффициентДляФактаСум,
	|	Бюджетирование.СпособОпределенияВалютыОборотаФакт КАК СпособОпределенияВалютыОборотаФакт,
	|	Бюджетирование.ПоказательИсточникаДанныхДляФактаКол КАК ПоказательИсточникаДанныхДляФактаКол,
	|	Бюджетирование.КоэффициентДляФактаКол КАК КоэффициентДляФактаКол,
	|	Бюджетирование.ИсточникДанныхДляФакта.ИзмеренияИсточника КАК ИзмеренияИсточника,
	|	Бюджетирование.ИсточникДанныхДляФакта.ДатыОтбораДанныхИсточника КАК ДатыОтбораДанныхИсточника,
	|	Бюджетирование.Представление
	|ИЗ
	|	ПланСчетов.Бюджетирование КАК Бюджетирование
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Бюджетирование.ВидыСубконто КАК БюджетированиеВидыСубконто1
	|		ПО Бюджетирование.Ссылка = БюджетированиеВидыСубконто1.Ссылка И (БюджетированиеВидыСубконто1.НомерСтроки = 1)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Бюджетирование.ВидыСубконто КАК БюджетированиеВидыСубконто2
	|		ПО Бюджетирование.Ссылка = БюджетированиеВидыСубконто2.Ссылка И (БюджетированиеВидыСубконто2.НомерСтроки = 2)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Бюджетирование.ВидыСубконто КАК БюджетированиеВидыСубконто3
	|		ПО Бюджетирование.Ссылка = БюджетированиеВидыСубконто3.Ссылка И (БюджетированиеВидыСубконто3.НомерСтроки = 3)
	|
	|ГДЕ
	|	НЕ Бюджетирование.ИсточникДанныхДляФакта = &ПустойИсточник";
	
	Если НЕ ОтборСчета.Количество()=0 Тогда
		ТекстЗапроса=ТекстЗапроса+"
		|И
		|	Бюджетирование.Ссылка В ИЕРАРХИИ(&Счета)";
		Запрос.УстановитьПараметр("Счета",ОтборСчета);
	КонецЕсли;
	
	Запрос.Текст=ТекстЗапроса;
	Запрос.УстановитьПараметр("ПустойИсточник",Новый(Тип("СправочникСсылка.ИсточникиДанныхДляРасчетовБюджетирования")));
		
	ТекстОсновногоЗапроса="";
	
	СтруктураПараметров=Новый Структура;
	НомерСчета=0;
	
	РезультатЗапроса=Запрос.Выполнить().Выбрать();
	
	Пока РезультатЗапроса.Следующий() Цикл
		
		ДобавитьВТекстОсновногоЗапросаОстатки(РезультатЗапроса,ТекстОсновногоЗапроса,СтруктураПараметров,НомерСчета,
					СтруктураИспользуемыхИзмерений,ДатаОстатка);	
		НомерСчета=НомерСчета+1;
		
	КонецЦикла;
	
	ТекстЗапроса=Сред(ТекстОсновногоЗапроса,16);
	
	Если ТекстЗапроса="" Тогда
		
		Возврат Новый Структура("НетИсточников");
		
	КонецЕсли;
	
	ТекстИтог="ВЫБРАТЬ
	|ВЫРАЗИТЬ(ЗапросПоИсточникам.Счет КАК ПланСчетов.Бюджетирование) КАК Счет,
	|ВЫРАЗИТЬ(ЗапросПоИсточникам.Валюта КАК Справочник.Валюты) КАК Валюта,
	|ВЫРАЗИТЬ(ЗапросПоИсточникам.ЦФО КАК Справочник.Подразделения) КАК ЦФО,
	|ВЫРАЗИТЬ(ЗапросПоИсточникам.Проект КАК Справочник.Проекты) КАК Проект,
	|ВЫРАЗИТЬ(ЗапросПоИсточникам.Контрагент КАК Справочник.Контрагенты) КАК Контрагент,
	|ВЫРАЗИТЬ(ЗапросПоИсточникам.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|ЗапросПоИсточникам.Количество КАК КоличествоОстаток,
	|ЗапросПоИсточникам.Сумма КАК ВалютнаяСуммаОстаток,
	|ВЫБОР 
	|		КОГДА ВЫРАЗИТЬ(ЗапросПоИсточникам.Валюта КАК Справочник.Валюты)=&ВалютаУпрУчета ТОГДА ЗапросПоИсточникам.Сумма
	|		КОГДА ВЫРАЗИТЬ(ЗапросПоИсточникам.Валюта КАК Справочник.Валюты)<>&ВалютаУпрУчета И КурсыИсточника.Курс <>0 И КурсыУпрУчета.Курс <>0 ТОГДА
	|			ЗапросПоИсточникам.Сумма*КурсыИсточника.Курс * КурсыУпрУчета.Кратность 
	|			/ (КурсыУпрУчета.Курс * КурсыИсточника.Кратность)
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ  КАК СуммаУпрОстаток	
	|ИЗ
	|("+ТекстЗапроса+") КАК ЗапросПоИсточникам
	// Курсы источников 
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
	|	РегистрСведений.КурсыВалют.СрезПоследних(&ДатаОстатка, Валюта=&ВалютаУпрУчета) КАК КурсыУпрУчета
	|	ПО ИСТИНА
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.КурсыВалют.СрезПоследних(&ДатаОстатка) КАК КурсыИсточника
	|	ПО ВЫРАЗИТЬ(ЗапросПоИсточникам.Валюта КАК Справочник.Валюты)=КурсыИсточника.Валюта";

			
	СтруктураПараметров.Вставить("МоментВремени",ДатаОстатка);
	СтруктураПараметров.Вставить("ДатаОстатка",ДатаОстатка);
	СтруктураПараметров.Вставить("ПустойЦФО",Справочники.Подразделения.ПустаяСсылка());
	СтруктураПараметров.Вставить("ПустойПроект",Справочники.Проекты.ПустаяСсылка());
	СтруктураПараметров.Вставить("ПустойКонтрагент",Справочники.Контрагенты.ПустаяСсылка());	
	СтруктураПараметров.Вставить("ВалютаУпрУчета",Константы.ВалютаРегламентированногоУчета.Получить());
	СтруктураПараметров.Вставить("ВалютаРеглУчета",Константы.ВалютаРегламентированногоУчета.Получить());	
	СтруктураПараметров.Вставить("ПустойНоменклатура",?(Сценарий.ДетализацияПланирования=Перечисления.ДетализацияПланирования.НоменклатурныеГруппы,
													Справочники.НоменклатурныеГруппы.ПустаяСсылка(),Справочники.Номенклатура.ПустаяСсылка()));
													
	СтруктураЗапроса=Новый Структура;
	СтруктураЗапроса.Вставить("ТекстЗапроса",ТекстИтог);
	СтруктураЗапроса.Вставить("ПараметрыЗапроса",СтруктураПараметров);
	
	Возврат СтруктураЗапроса;
		
	
КонецФункции // СформироватьТекстЗапросаПоОстаткам()

Функция СформироватьТекстЗапросаПоОстаткамПериод(СтруктураИспользуемыхИзмерений,Сценарий,ДатаНач,ДатаКон,Периодичность,ОтборСчета,Префикс="") Экспорт
	
	// Выберем статьи оборотов, для которых будем получать данные
	Запрос=Новый Запрос;
	СтруктураПараметров=Новый Структура;
	
	ТекстЗапроса="ВЫБРАТЬ
	|	Бюджетирование.Ссылка КАК Счет,
	|	Бюджетирование.Валютный КАК Валютный,
	|	Бюджетирование.Вид КАК ВидСчета,
	|	Бюджетирование.Количественный КАК Количественный,
	|	БюджетированиеВидыСубконто1.ВидСубконто.Наименование КАК НаименованиеСубконто1,
	|	БюджетированиеВидыСубконто2.ВидСубконто.Наименование КАК НаименованиеСубконто2,
	|	БюджетированиеВидыСубконто3.ВидСубконто.Наименование КАК НаименованиеСубконто3,
	|	Бюджетирование.ИсточникДанныхДляФакта.ТекстЗапроса КАК ТекстЗапроса,
	|	Бюджетирование.ИсточникДанныхДляФакта.НастройкиПостроителя КАК НастройкиПостроителя,
	|	Бюджетирование.ИсточникДанныхДляФакта.ПроизвольныйЗапрос КАК ПроизвольныйЗапрос,
	|	Бюджетирование.ПоказательИсточникаДанныхДляФактаСум КАК ПоказательИсточникаДанныхДляФактаСум,
	|	Бюджетирование.КоэффициентДляФактаСум КАК КоэффициентДляФактаСум,
	|	Бюджетирование.СпособОпределенияВалютыОборотаФакт КАК СпособОпределенияВалютыОборотаФакт,
	|	Бюджетирование.ПоказательИсточникаДанныхДляФактаКол КАК ПоказательИсточникаДанныхДляФактаКол,
	|	Бюджетирование.КоэффициентДляФактаКол КАК КоэффициентДляФактаКол,
	|	Бюджетирование.ИсточникДанныхДляФакта.ИзмеренияИсточника КАК ИзмеренияИсточника,
	|	Бюджетирование.ИсточникДанныхДляФакта.ДатыОтбораДанныхИсточника КАК ДатыОтбораДанныхИсточника,
	|	Бюджетирование.Представление
	|ИЗ
	|	ПланСчетов.Бюджетирование КАК Бюджетирование
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Бюджетирование.ВидыСубконто КАК БюджетированиеВидыСубконто1
	|		ПО Бюджетирование.Ссылка = БюджетированиеВидыСубконто1.Ссылка И (БюджетированиеВидыСубконто1.НомерСтроки = 1)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Бюджетирование.ВидыСубконто КАК БюджетированиеВидыСубконто2
	|		ПО Бюджетирование.Ссылка = БюджетированиеВидыСубконто2.Ссылка И (БюджетированиеВидыСубконто2.НомерСтроки = 2)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Бюджетирование.ВидыСубконто КАК БюджетированиеВидыСубконто3
	|		ПО Бюджетирование.Ссылка = БюджетированиеВидыСубконто3.Ссылка И (БюджетированиеВидыСубконто3.НомерСтроки = 3)
	|
	|ГДЕ
	|	НЕ Бюджетирование.ИсточникДанныхДляФакта = &ПустойИсточник";
	
	Если НЕ ОтборСчета.Количество()=0 Тогда
		ТекстЗапроса=ТекстЗапроса+"
		|И
		|	Бюджетирование.Ссылка В ИЕРАРХИИ(&Счета)";
		Запрос.УстановитьПараметр("Счета",ОтборСчета);
	КонецЕсли;
	
	Запрос.Текст=ТекстЗапроса;
	Запрос.УстановитьПараметр("ПустойИсточник",Новый(Тип("СправочникСсылка.ИсточникиДанныхДляРасчетовБюджетирования")));
		
	ТекстОсновногоЗапроса="";
	
	СтруктураПараметров=Новый Структура;
	НомерСчета=0;
	
	РезультатЗапроса=Запрос.Выполнить().Выбрать();
	
	Пока РезультатЗапроса.Следующий() Цикл
		
		ДобавитьВТекстОсновногоЗапросаОстаткиПериод(РезультатЗапроса,ТекстОсновногоЗапроса,СтруктураПараметров,НомерСчета,
					СтруктураИспользуемыхИзмерений,ДатаНач,ДатаКон,Периодичность,Префикс);	
		НомерСчета=НомерСчета+1;
		
	КонецЦикла;
	
	ТекстЗапроса=Сред(ТекстОсновногоЗапроса,16);
	
	Если ТекстЗапроса="" Тогда
		
		Возврат Новый Структура("НетИсточников");
		
	КонецЕсли;
	
	ТекстИтог="ВЫБРАТЬ
	|ВЫРАЗИТЬ(ЗапросПоИсточникам"+Префикс+".Счет КАК ПланСчетов.Бюджетирование) КАК Счет,
	|ВЫРАЗИТЬ(ЗапросПоИсточникам"+Префикс+".Период КАК Дата) КАК Период,
	|ВЫРАЗИТЬ(ЗапросПоИсточникам"+Префикс+".Валюта КАК Справочник.Валюты) КАК Валюта,
	|ВЫРАЗИТЬ(ЗапросПоИсточникам"+Префикс+".ЦФО КАК Справочник.Подразделения) КАК ЦФО,
	|ВЫРАЗИТЬ(ЗапросПоИсточникам"+Префикс+".Проект КАК Справочник.Проекты) КАК Проект,
	|ВЫРАЗИТЬ(ЗапросПоИсточникам"+Префикс+".Контрагент КАК Справочник.Контрагенты) КАК Контрагент,
	|ВЫРАЗИТЬ(ЗапросПоИсточникам"+Префикс+".Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|СУММА(ЗапросПоИсточникам"+Префикс+".КоличествоНачальныйОстатокДт) КАК КоличествоНачальныйОстатокДт,
	|СУММА(ЗапросПоИсточникам"+Префикс+".КоличествоНачальныйОстатокКт) КАК КоличествоНачальныйОстатокКт,
	|СУММА(ЗапросПоИсточникам"+Префикс+".КоличествоКонечныйОстатокДт) КАК КоличествоКонечныйОстатокДт,
	|СУММА(ЗапросПоИсточникам"+Префикс+".КоличествоКонечныйОстатокКт) КАК КоличествоКонечныйОстатокКт,
	|СУММА(ЗапросПоИсточникам"+Префикс+".ВалютнаяСуммаНачальныйОстатокДт) КАК ВалютнаяСуммаНачальныйОстатокДт,
	|СУММА(ЗапросПоИсточникам"+Префикс+".ВалютнаяСуммаНачальныйОстатокКт) КАК ВалютнаяСуммаНачальныйОстатокКт,
	|СУММА(ЗапросПоИсточникам"+Префикс+".ВалютнаяСуммаКонечныйОстатокДт) КАК ВалютнаяСуммаКонечныйОстатокДт,
	|СУММА(ЗапросПоИсточникам"+Префикс+".ВалютнаяСуммаКонечныйОстатокКт) КАК ВалютнаяСуммаКонечныйОстатокКт,
	|СУММА(ЗапросПоИсточникам"+Префикс+".СуммаУпрНачальныйОстатокДт) КАК СуммаУпрНачальныйОстатокДт,
	|СУММА(ЗапросПоИсточникам"+Префикс+".СуммаУпрНачальныйОстатокКт) КАК СуммаУпрНачальныйОстатокКт,
	|СУММА(ЗапросПоИсточникам"+Префикс+".СуммаУпрКонечныйОстатокДт) КАК СуммаУпрКонечныйОстатокДт,
	|СУММА(ЗапросПоИсточникам"+Префикс+".СуммаУпрКонечныйОстатокКт) КАК СуммаУпрКонечныйОстатокКт,
	|СУММА(ЗапросПоИсточникам"+Префикс+".КоличествоНачальныйОстатокДтИтог) КАК КоличествоНачальныйОстатокДтИтог,
	|СУММА(ЗапросПоИсточникам"+Префикс+".КоличествоНачальныйОстатокКтИтог) КАК КоличествоНачальныйОстатокКтИтог,
	|СУММА(ЗапросПоИсточникам"+Префикс+".КоличествоКонечныйОстатокДтИтог) КАК КоличествоКонечныйОстатокДтИтог,
	|СУММА(ЗапросПоИсточникам"+Префикс+".КоличествоКонечныйОстатокКтИтог) КАК КоличествоКонечныйОстатокКтИтог,
	|СУММА(ЗапросПоИсточникам"+Префикс+".ВалютнаяСуммаНачальныйОстатокДтИтог) КАК ВалютнаяСуммаНачальныйОстатокДтИтог,
	|СУММА(ЗапросПоИсточникам"+Префикс+".ВалютнаяСуммаНачальныйОстатокКтИтог) КАК ВалютнаяСуммаНачальныйОстатокКтИтог,
	|СУММА(ЗапросПоИсточникам"+Префикс+".ВалютнаяСуммаКонечныйОстатокДтИтог) КАК ВалютнаяСуммаКонечныйОстатокДтИтог,
	|СУММА(ЗапросПоИсточникам"+Префикс+".ВалютнаяСуммаКонечныйОстатокКтИтог) КАК ВалютнаяСуммаКонечныйОстатокКтИтог,
	|СУММА(ЗапросПоИсточникам"+Префикс+".СуммаУпрНачальныйОстатокДтИтог) КАК СуммаУпрНачальныйОстатокДтИтог,
	|СУММА(ЗапросПоИсточникам"+Префикс+".СуммаУпрНачальныйОстатокКтИтог) КАК СуммаУпрНачальныйОстатокКтИтог,
	|СУММА(ЗапросПоИсточникам"+Префикс+".СуммаУпрКонечныйОстатокДтИтог) КАК СуммаУпрКонечныйОстатокДтИтог,
	|СУММА(ЗапросПоИсточникам"+Префикс+".СуммаУпрКонечныйОстатокКтИтог) КАК СуммаУпрКонечныйОстатокКтИтог
	|ИЗ
	|("+ТекстЗапроса+") КАК ЗапросПоИсточникам"+Префикс+" 
	|СГРУППИРОВАТЬ ПО 
	|ВЫРАЗИТЬ(ЗапросПоИсточникам"+Префикс+".Счет КАК ПланСчетов.Бюджетирование),
	|ВЫРАЗИТЬ(ЗапросПоИсточникам"+Префикс+".Период КАК Дата),
	|ВЫРАЗИТЬ(ЗапросПоИсточникам"+Префикс+".Валюта КАК Справочник.Валюты),
	|ВЫРАЗИТЬ(ЗапросПоИсточникам"+Префикс+".ЦФО КАК Справочник.Подразделения),
	|ВЫРАЗИТЬ(ЗапросПоИсточникам"+Префикс+".Проект КАК Справочник.Проекты),
	|ВЫРАЗИТЬ(ЗапросПоИсточникам"+Префикс+".Контрагент КАК Справочник.Контрагенты),
	|ВЫРАЗИТЬ(ЗапросПоИсточникам"+Префикс+".Номенклатура КАК Справочник.Номенклатура)";

	СтруктураПараметров.Вставить("ПустойЦФО",Справочники.Подразделения.ПустаяСсылка());
	СтруктураПараметров.Вставить("ПустойПроект",Справочники.Проекты.ПустаяСсылка());
	СтруктураПараметров.Вставить("ПустойКонтрагент",Справочники.Контрагенты.ПустаяСсылка());	
	СтруктураПараметров.Вставить("ВалютаУпрУчета",Константы.ВалютаРегламентированногоУчета.Получить());
	СтруктураПараметров.Вставить("ВалютаРеглУчета",Константы.ВалютаРегламентированногоУчета.Получить());	
	СтруктураПараметров.Вставить("ПустойНоменклатура",?(Сценарий.ДетализацияПланирования=Перечисления.ДетализацияПланирования.НоменклатурныеГруппы,
													Справочники.НоменклатурныеГруппы.ПустаяСсылка(),Справочники.Номенклатура.ПустаяСсылка()));
													
	СтруктураЗапроса=Новый Структура;
	СтруктураЗапроса.Вставить("ТекстЗапроса",ТекстИтог);
	СтруктураЗапроса.Вставить("ПараметрыЗапроса",СтруктураПараметров);
	
	Возврат СтруктураЗапроса;
			
КонецФункции // СформироватьТекстЗапросаПоОстаткамПериод()

Процедура ДобавитьВТекстОсновногоЗапросаОстатки(СчетИсточник,ТекстОсновногоЗапроса,СтруктураПараметров,НомерСчета, 
								СтруктураИспользуемыхИзмерений,ДатаОстатка)
	
	ПостроительОтчета=Новый ПостроительОтчета; // Основной построитель отчета
	
	ТекстЗапроса=СчетИсточник.ТекстЗапроса;
	
	СохраненнаяНастройка=СчетИсточник.НастройкиПостроителя.Получить();
	
	ИзмеренияИсточника=СчетИсточник.ИзмеренияИсточника.Выгрузить();
	ДатыОтбораДанныхИсточника=СчетИсточник.ДатыОтбораДанныхИсточника.Выгрузить();
	КодИсточника="Счет_"+НомерСчета;
	
	Если ТипЗнч(СохраненнаяНастройка.НастройкиПостроителя)=Тип("НастройкиПостроителяОтчета") Тогда
		
		Для Каждого Параметр Из СохраненнаяНастройка.ПараметрыПостроителя Цикл
			СтруктураПараметров.Вставить(Параметр.Ключ+КодИсточника,Параметр.Значение);
			ТекстЗапроса=СтрЗаменить(ТекстЗапроса,"&"+Параметр.Ключ,"&"+Параметр.Ключ+КодИсточника);
		КонецЦикла;
		
		Для каждого Граница Из ДатыОтбораДанныхИсточника Цикл
						
			ТекстЗапроса=СтрЗаменить(ТекстЗапроса,"&"+Граница.ИмяДатаГраницы,"&"+Граница.ИмяДатаГраницы+КодИсточника);
			СтруктураПараметров.Вставить(Граница.ИмяДатаГраницы+КодИсточника,ДатаОстатка);
			
		КонецЦикла;
		
		ПостроительОтчета.Текст=ТекстЗапроса;
		
		Если СчетИсточник.ПроизвольныйЗапрос Тогда
			
			ПостроительОтчета.ЗаполнитьНастройки();
			
		КонецЕсли;
		
		ПостроительОтчета.УстановитьНастройки(СохраненнаяНастройка.НастройкиПостроителя,Истина,Ложь,Истина,Истина);
	Иначе
		Возврат;
	КонецЕсли;
	
	// Формируем структуру измерений для запроса
	
	СтруктураИзмерений=Новый Структура;
		
	//Сформируем структуру, являющуюся пересечением структуры измерений общего запроса и используемых для счета субконто.
	
	СтруктураСубконтоИзмерения=Новый Структура;
	СтруктураСубконтоИзмерения.Вставить("Контрагенты","Контрагент");
	СтруктураСубконтоИзмерения.Вставить("Номенклатура","Номенклатура");
	СтруктураСубконтоИзмерения.Вставить("Проекты","Проект");
	СтруктураСубконтоИзмерения.Вставить("СтатьиОборотов","СтатьяОборотов");
	СтруктураСубконтоИзмерения.Вставить("ЦФО","ЦФО");
		
	СтруктураИспользуемыхСубконто=Новый Структура;
	
	Если (НЕ СчетИсточник.НаименованиеСубконто1=NULL) И СтруктураИспользуемыхИзмерений.Свойство(СтруктураСубконтоИзмерения[СчетИсточник.НаименованиеСубконто1]) Тогда
		СтруктураИспользуемыхСубконто.Вставить(СтруктураСубконтоИзмерения[СчетИсточник.НаименованиеСубконто1]);
	КонецЕсли;
	
	Если (НЕ СчетИсточник.НаименованиеСубконто2=NULL) И СтруктураИспользуемыхИзмерений.Свойство(СтруктураСубконтоИзмерения[СчетИсточник.НаименованиеСубконто2]) Тогда
		СтруктураИспользуемыхСубконто.Вставить(СтруктураСубконтоИзмерения[СчетИсточник.НаименованиеСубконто2]);
	КонецЕсли;
	
	Если (НЕ СчетИсточник.НаименованиеСубконто3=NULL) И СтруктураИспользуемыхИзмерений.Свойство(СтруктураСубконтоИзмерения[СчетИсточник.НаименованиеСубконто3]) Тогда
		СтруктураИспользуемыхСубконто.Вставить(СтруктураСубконтоИзмерения[СчетИсточник.НаименованиеСубконто3]);
	КонецЕсли;
	
	Если СчетИсточник.Валютный Тогда
		СтруктураИспользуемыхСубконто.Вставить("Валюта");
	КонецЕсли;
	
	Для Каждого СтрокаСвязь ИЗ ИзмеренияИсточника Цикл
		
		ИмяИзмерения=Строка(СтрокаСвязь.ИзмерениеБюджетирования);
		
		Если СтруктураИспользуемыхСубконто.Свойство(ИмяИзмерения) Тогда
			
			СтруктураИзмерений.Вставить(ИмяИзмерения,СтрокаСвязь.ИмяПоляИсточника);
			
		Иначе
			
			ПолеКУдалению=ПостроительОтчета.ВыбранныеПоля.Найти(СтрокаСвязь.ИмяПоляИсточника);
			
			Если НЕ ПолеКУдалению=Неопределено Тогда
				ПостроительОтчета.ВыбранныеПоля.Удалить(ПолеКУдалению);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
				
	// Убираем валюту из измерений запроса, если она не используется при получении сумм по статье	
	Если (НЕ (СчетИсточник.СпособОпределенияВалютыОборотаФакт=Перечисления.СпособыОпределенияВалютыОборотаПоСтатье.ВалютаИсточникаДанных И СчетИсточник.Валютный))
		И СтруктураИзмерений.Свойство("Валюта") Тогда
		
		ПолеВалюта=ПостроительОтчета.ВыбранныеПоля.Найти(СтруктураИзмерений.Валюта);
		
		Если Не ПолеВалюта=Неопределено Тогда
			
			ПостроительОтчета.ВыбранныеПоля.Удалить(ПолеВалюта);
			
		КонецЕсли;
		
	КонецЕсли;	
				
	РабочийТекст=ПостроительОтчета.ПолучитьЗапрос().Текст;
	
	// Определим параметры отбора
	Индекс=1;
	Для Каждого СтрокаОтбора Из ПостроительОтчета.Отбор Цикл
		
		Если СтрокаОтбора.Использование=Истина Тогда
			
			Если СтрокаОтбора.ЗначениеС=Неопределено ИЛИ (НЕ ЗначениеЗаполнено(СтрокаОтбора.ЗначениеС)) ИЛИ СтрокаОтбора.ВидСравнения = ВидСравнения.Равно Тогда
				РабочийТекст=СтрЗаменить(РабочийТекст,"Параметр"+Индекс,"Параметр_"+КодИсточника+"_"+Индекс);
						
				СтруктураПараметров.Вставить("Параметр_"+КодИсточника+"_"+Индекс,СтрокаОтбора.Значение);
				Индекс=Индекс+1;
			Иначе
				РабочийТекст=СтрЗаменить(РабочийТекст,"Параметр"+Индекс,"Параметр_"+КодИсточника+"_"+Индекс);
							
				СтруктураПараметров.Вставить("Параметр_"+КодИсточника+"_"+Индекс,СтрокаОтбора.ЗначениеС);
				Индекс=Индекс+1;
				РабочийТекст=СтрЗаменить(РабочийТекст,"Параметр"+Индекс,"Параметр_"+КодИсточника+"_"+Индекс);
				СтруктураПараметров.Вставить("Параметр_"+КодИсточника+"_"+Индекс,СтрокаОтбора.ЗначениеПо);
				Индекс=Индекс+1;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Формируем текст основного запроса
	
	ТекстЗапросаИсточник="
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|&Счет"+КодИсточника+" КАК Счет,";
	
	СтруктураПараметров.Вставить("Счет"+КодИсточника,СчетИсточник.Счет);
			
	Если СтруктураИзмерений.Свойство("ЦФО") Тогда
		ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
		|"+СтруктураИзмерений.ЦФО+" КАК ЦФО,";
	Иначе
		ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
		|&ПустойЦФО КАК ЦФО,";	
	КонецЕсли;
	
	Если СтруктураИзмерений.Свойство("Проект") Тогда
		ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
		|"+СтруктураИзмерений.Проект+" КАК Проект,";
	Иначе
		ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
		|&ПустойПроект КАК Проект,";	
	КонецЕсли;
	
	Если СтруктураИзмерений.Свойство("Контрагент") Тогда
		ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
		|"+СтруктураИзмерений.Контрагент+" КАК Контрагент,";
	Иначе
		ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
		|&ПустойКонтрагент КАК Контрагент,";	
	КонецЕсли;
	
	Если СтруктураИзмерений.Свойство("Номенклатура") Тогда
		ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
		|"+СтруктураИзмерений.Номенклатура+" КАК Номенклатура,";
	Иначе
		ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
		|&ПустойНоменклатура КАК Номенклатура,";	
	КонецЕсли;
	
	Если СчетИсточник.СпособОпределенияВалютыОборотаФакт=Перечисления.СпособыОпределенияВалютыОборотаПоСтатье.ВалютаИсточникаДанных Тогда
		ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
		|"+СтруктураИзмерений.Валюта+" КАК Валюта,";
	ИначеЕсли СчетИсточник.СпособОпределенияВалютыОборотаФакт=Перечисления.СпособыОпределенияВалютыОборотаПоСтатье.ВалютаРегламентированногоУчета Тогда
		ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
		|&ВалютаРеглУчета КАК Валюта,";
	Иначе
		ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
		|&ВалютаУпрУчета КАК Валюта,";
	КонецЕсли;
	
	Если ПустаяСтрока(СчетИсточник.ПоказательИсточникаДанныхДляФактаСум) Тогда
		ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
		|0 КАК Сумма,";
	Иначе
		ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
		|"+СчетИсточник.ПоказательИсточникаДанныхДляФактаСум+"*&КоэффициентДляФактаСум_"+КодИсточника+" КАК Сумма,";
		СтруктураПараметров.Вставить("КоэффициентДляФактаСум_"+КодИсточника,СчетИсточник.КоэффициентДляФактаСум);
	КонецЕсли;
	
	Если ПустаяСтрока(СчетИсточник.ПоказательИсточникаДанныхДляФактаКол) Тогда
		ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
		|0 КАК Количество";
	Иначе
		ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
		|"+СчетИсточник.ПоказательИсточникаДанныхДляФактаКол+"*&КоэффициентДляФактаКол_"+КодИсточника+" КАК Количество,";
		СтруктураПараметров.Вставить("КоэффициентДляФактаКол_"+КодИсточника,СчетИсточник.КоэффициентДляФактаКол);
	КонецЕсли;
	
	ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
	|ИЗ
	|("+РабочийТекст+") КАК "+КодИсточника;
	
	ТекстОсновногоЗапроса=ТекстОсновногоЗапроса+ТекстЗапросаИсточник;
		
КонецПроцедуры // ДобавитьВТекстОсновногоЗапросаОстатки()

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//
Процедура ДобавитьВТекстОсновногоЗапросаОстаткиПериод(СчетИсточник,ТекстОсновногоЗапроса,СтруктураПараметров,НомерСчета, 
								СтруктураИспользуемыхИзмерений,ДатаНач,ДатаКон,Периодичность,Префикс)
								
	Перем НачальнаяДатаГраницы;							
								
	ПостроительОтчета=Новый ПостроительОтчета; // Основной построитель отчета
	
	ТекстЗапроса=СчетИсточник.ТекстЗапроса;
	
	СохраненнаяНастройка=СчетИсточник.НастройкиПостроителя.Получить();
	
	ИзмеренияИсточника=СчетИсточник.ИзмеренияИсточника.Выгрузить();
	ДатыОтбораДанныхИсточника=СчетИсточник.ДатыОтбораДанныхИсточника.Выгрузить();
	КодИсточника="Счет_"+НомерСчета+Префикс;
	
	Если ТипЗнч(СохраненнаяНастройка.НастройкиПостроителя)=Тип("НастройкиПостроителяОтчета") Тогда
		
		Для Каждого Параметр Из СохраненнаяНастройка.ПараметрыПостроителя Цикл
			СтруктураПараметров.Вставить(Параметр.Ключ+КодИсточника,Параметр.Значение);
			ТекстЗапроса=СтрЗаменить(ТекстЗапроса,"&"+Параметр.Ключ,"&"+Параметр.Ключ+КодИсточника);
		КонецЦикла;
		
		Для каждого Граница Из ДатыОтбораДанныхИсточника Цикл
						
			ТекстЗапроса=СтрЗаменить(ТекстЗапроса,"&"+Граница.ИмяДатаГраницы,"&ДатаИсточникаQQQ");
			
		КонецЦикла;
		
		ПостроительОтчета.Текст=ТекстЗапроса;
		
		Если СчетИсточник.ПроизвольныйЗапрос Тогда
			
			ПостроительОтчета.ЗаполнитьНастройки();
			
		КонецЕсли;
		
		ПостроительОтчета.УстановитьНастройки(СохраненнаяНастройка.НастройкиПостроителя,Истина,Ложь,Истина,Истина);
	Иначе
		Возврат;
	КонецЕсли;
	
	// Формируем структуру измерений для запроса
	
	СтруктураИзмерений=Новый Структура;
		
	//Сформируем структуру, являющуюся пересечением структуры измерений общего запроса и используемых для счета субконто.
	
	СтруктураСубконтоИзмерения=Новый Структура;
	СтруктураСубконтоИзмерения.Вставить("Контрагенты","Контрагент");
	СтруктураСубконтоИзмерения.Вставить("Номенклатура","Номенклатура");
	СтруктураСубконтоИзмерения.Вставить("Проекты","Проект");
	СтруктураСубконтоИзмерения.Вставить("СтатьиОборотов","СтатьяОборотов");
	СтруктураСубконтоИзмерения.Вставить("ЦФО","ЦФО");
		
	СтруктураИспользуемыхСубконто=Новый Структура;
	
	Если (НЕ СчетИсточник.НаименованиеСубконто1=NULL) И СтруктураИспользуемыхИзмерений.Свойство(СтруктураСубконтоИзмерения[СчетИсточник.НаименованиеСубконто1]) Тогда
		СтруктураИспользуемыхСубконто.Вставить(СтруктураСубконтоИзмерения[СчетИсточник.НаименованиеСубконто1]);
	КонецЕсли;
	
	Если (НЕ СчетИсточник.НаименованиеСубконто2=NULL) И СтруктураИспользуемыхИзмерений.Свойство(СтруктураСубконтоИзмерения[СчетИсточник.НаименованиеСубконто2]) Тогда
		СтруктураИспользуемыхСубконто.Вставить(СтруктураСубконтоИзмерения[СчетИсточник.НаименованиеСубконто2]);
	КонецЕсли;
	
	Если (НЕ СчетИсточник.НаименованиеСубконто3=NULL) И СтруктураИспользуемыхИзмерений.Свойство(СтруктураСубконтоИзмерения[СчетИсточник.НаименованиеСубконто3]) Тогда
		СтруктураИспользуемыхСубконто.Вставить(СтруктураСубконтоИзмерения[СчетИсточник.НаименованиеСубконто3]);
	КонецЕсли;
	
	Если СчетИсточник.Валютный Тогда
		СтруктураИспользуемыхСубконто.Вставить("Валюта");
	КонецЕсли;
	
	Для Каждого СтрокаСвязь ИЗ ИзмеренияИсточника Цикл
		
		ИмяИзмерения=Строка(СтрокаСвязь.ИзмерениеБюджетирования);
		
		Если СтруктураИспользуемыхСубконто.Свойство(ИмяИзмерения) Тогда
			
			СтруктураИзмерений.Вставить(ИмяИзмерения,СтрокаСвязь.ИмяПоляИсточника);
			
		Иначе
			
			ПолеКУдалению=ПостроительОтчета.ВыбранныеПоля.Найти(СтрокаСвязь.ИмяПоляИсточника);
			
			Если НЕ ПолеКУдалению=Неопределено Тогда
				ПостроительОтчета.ВыбранныеПоля.Удалить(ПолеКУдалению);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
				
	// Убираем валюту из измерений запроса, если она не используется при получении сумм по статье	
	Если (НЕ (СчетИсточник.СпособОпределенияВалютыОборотаФакт=Перечисления.СпособыОпределенияВалютыОборотаПоСтатье.ВалютаИсточникаДанных И СчетИсточник.Валютный))
		И СтруктураИзмерений.Свойство("Валюта") Тогда
		
		ПолеВалюта=ПостроительОтчета.ВыбранныеПоля.Найти(СтруктураИзмерений.Валюта);
		
		Если Не ПолеВалюта=Неопределено Тогда
			
			ПостроительОтчета.ВыбранныеПоля.Удалить(ПолеВалюта);
			
		КонецЕсли;
		
	КонецЕсли;	
				
	РабочийТекст=ПостроительОтчета.ПолучитьЗапрос().Текст;
	
	// Определим параметры отбора
	Индекс=1;
	Для Каждого СтрокаОтбора Из ПостроительОтчета.Отбор Цикл
		
		Если СтрокаОтбора.Использование=Истина Тогда
			
			Если СтрокаОтбора.ЗначениеС=Неопределено ИЛИ (НЕ ЗначениеЗаполнено(СтрокаОтбора.ЗначениеС)) ИЛИ СтрокаОтбора.ВидСравнения = ВидСравнения.Равно Тогда
				РабочийТекст=СтрЗаменить(РабочийТекст,"Параметр"+Индекс,"Параметр_"+КодИсточника+"_"+Индекс);
						
				СтруктураПараметров.Вставить("Параметр_"+КодИсточника+"_"+Индекс,СтрокаОтбора.Значение);
				Индекс=Индекс+1;
			Иначе
				РабочийТекст=СтрЗаменить(РабочийТекст,"Параметр"+Индекс,"Параметр_"+КодИсточника+"_"+Индекс);
							
				СтруктураПараметров.Вставить("Параметр_"+КодИсточника+"_"+Индекс,СтрокаОтбора.ЗначениеС);
				Индекс=Индекс+1;
				РабочийТекст=СтрЗаменить(РабочийТекст,"Параметр"+Индекс,"Параметр_"+КодИсточника+"_"+Индекс);
				СтруктураПараметров.Вставить("Параметр_"+КодИсточника+"_"+Индекс,СтрокаОтбора.ЗначениеПо);
				Индекс=Индекс+1;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не Периодичность=Перечисления.Периодичность.ПустаяСсылка() Тогда
		// Получаем текст запроса для получения остатков на начало и конец каждого периода
		
		ДатаОстатка=ДатаНач;
		НомерПериода=1;
		
		// Формируем текст основного запроса	
		Пока ДатаОстатка<=ДатаКон Цикл
			
			РабочийТекстПериодНач=СтрЗаменить(РабочийТекст,"&ДатаИсточникаQQQ","&ДатаИсточника_"+"_"+КодИсточника+"_"+НомерПериода+"_"+"Нач");
			РабочийТекстПериодКон=СтрЗаменить(РабочийТекст,"&ДатаИсточникаQQQ","&ДатаИсточника_"+"_"+КодИсточника+"_"+НомерПериода+"_"+"Кон");
							
			СтруктураПараметров.Вставить("ДатаИсточника_"+"_"+КодИсточника+"_"+НомерПериода+"_"+"Нач",НачалоДня(ДатаОстатка));
			СтруктураПараметров.Вставить("ДатаИсточника_"+"_"+КодИсточника+"_"+НомерПериода+"_"+"Кон",ОбщегоНазначения.ДатаКонцаПериода(ДатаОстатка,Периодичность));
							
			ТекстЗапросаИсточник="
			|ОБЪЕДИНИТЬ ВСЕ
			|ВЫБРАТЬ
			|&Счет"+КодИсточника+" КАК Счет,
			|&ДатаОстатка"+КодИсточника+"_"+НомерПериода+" КАК Период,";
			
			СтруктураПараметров.Вставить("Счет"+КодИсточника,СчетИсточник.Счет);
			СтруктураПараметров.Вставить("ДатаОстатка"+КодИсточника+"_"+НомерПериода,НачалоДня(ДатаОстатка));
			
			Если СтруктураИзмерений.Свойство("ЦФО") Тогда
				ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
				|"+СтруктураИзмерений.ЦФО+" КАК ЦФО,";
			Иначе
				ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
				|&ПустойЦФО КАК ЦФО,";	
			КонецЕсли;
			
			Если СтруктураИзмерений.Свойство("Проект") Тогда
				ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
				|"+СтруктураИзмерений.Проект+" КАК Проект,";
			Иначе
				ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
				|&ПустойПроект КАК Проект,";	
			КонецЕсли;
			
			Если СтруктураИзмерений.Свойство("Контрагент") Тогда
				ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
				|"+СтруктураИзмерений.Контрагент+" КАК Контрагент,";
			Иначе
				ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
				|&ПустойКонтрагент КАК Контрагент,";	
			КонецЕсли;
			
			Если СтруктураИзмерений.Свойство("Номенклатура") Тогда
				ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
				|"+СтруктураИзмерений.Номенклатура+" КАК Номенклатура,";
			Иначе
				ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
				|&ПустойНоменклатура КАК Номенклатура,";	
			КонецЕсли;
			
			Если СчетИсточник.СпособОпределенияВалютыОборотаФакт=Перечисления.СпособыОпределенияВалютыОборотаПоСтатье.ВалютаИсточникаДанных Тогда
				ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
				|"+СтруктураИзмерений.Валюта+" КАК Валюта,";
				
				ТекстСуммаУпр="
				|ВЫБОР
				|		КОГДА КурсыИсточника.Курс <>0 И КурсыУпрУчета.Курс <>0 ТОГДА
				|			"+СчетИсточник.ПоказательИсточникаДанныхДляФактаСум+"*&КоэффициентДляФактаСум_"+КодИсточника+"*КурсыИсточника.Курс * КурсыУпрУчета.Кратность 
				|			/ (КурсыУпрУчета.Курс * КурсыИсточника.Кратность)
				|		ИНАЧЕ
				|			0
				|		КОНЕЦ  КАК СуммаУпрОстаток";
				
				ТекстСоединения="
				|	ЛЕВОЕ СОЕДИНЕНИЕ 
				|	РегистрСведений.КурсыВалют.СрезПоследних(&ДатаИсточника_"+"_"+КодИсточника+"_"+НомерПериода+"_"+"Нач, Валюта=&ВалютаУпрУчета) КАК КурсыУпрУчета
				|	ПО ИСТИНА
				|	ЛЕВОЕ СОЕДИНЕНИЕ
				|	РегистрСведений.КурсыВалют.СрезПоследних(&ДатаИсточника_"+"_"+КодИсточника+"_"+НомерПериода+"_"+"Нач) КАК КурсыИсточника
				|	ПО "+КодИсточника+"Нач."+СтруктураИзмерений.Валюта+"=КурсыИсточника.Валюта";
				
				
			ИначеЕсли СчетИсточник.СпособОпределенияВалютыОборотаФакт=Перечисления.СпособыОпределенияВалютыОборотаПоСтатье.ВалютаРегламентированногоУчета Тогда
				ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
				|&ВалютаРеглУчета КАК Валюта,";
				
				ТекстСуммаУпр="
				|ВЫБОР
				|		КОГДА КурсыУпрУчета.Курс <>0 ТОГДА
				|			"+СчетИсточник.ПоказательИсточникаДанныхДляФактаСум+"*&КоэффициентДляФактаСум_"+КодИсточника+"*КурсыУпрУчета.Кратность 
				|			/ (КурсыУпрУчета.Курс)
				|		ИНАЧЕ
				|			0
				|		КОНЕЦ  КАК СуммаУпрОстаток";
				
				ТекстСоединения="
				|	ЛЕВОЕ СОЕДИНЕНИЕ 
				|	РегистрСведений.КурсыВалют.СрезПоследних(&ДатаИсточника_"+"_"+КодИсточника+"_"+НомерПериода+"_"+"Нач, Валюта=&ВалютаУпрУчета) КАК КурсыУпрУчета
				|	ПО ИСТИНА";
				
			Иначе
				ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
				|&ВалютаУпрУчета КАК Валюта,";
				
				ТекстСуммаУпр=СчетИсточник.ПоказательИсточникаДанныхДляФактаСум+"*&КоэффициентДляФактаСум_"+КодИсточника+" КАК СуммаУпрОстаток";
				ТекстСоединения="";
				
			КонецЕсли;
			
			Если ПустаяСтрока(СчетИсточник.ПоказательИсточникаДанныхДляФактаСум) Тогда
				ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
				|0 КАК ВалютнаяСуммаНачальныйОстатокДт,
				|0 КАК ВалютнаяСуммаНачальныйОстатокКт,
				|0 КАК ВалютнаяСуммаКонечныйОстатокДт,
				|0 КАК ВалютнаяСуммаКонечныйОстатокКт,";
				
			Иначе
				
				Если СчетИсточник.ВидСчета=ВидСчета.Пассивный Тогда	
					
					ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
					|0 КАК ВалютнаяСуммаНачальныйОстатокДт,
					|"+СчетИсточник.ПоказательИсточникаДанныхДляФактаСум+"*&КоэффициентДляФактаСум_"+КодИсточника+" КАК ВалютнаяСуммаНачальныйОстатокКт,
					|0 КАК ВалютнаяСуммаКонечныйОстатокДт,
					|0 КАК ВалютнаяСуммаКонечныйОстатокКт,
					|0 КАК СуммаУпрНачальныйОстатокДт,
					|"+СтрЗаменить(ТекстСуммаУпр,"СуммаУпрОстаток","СуммаУпрНачальныйОстатокКт")+",
					|0 КАК СуммаУпрКонечныйОстатокДт,
					|0 КАК СуммаУпрКонечныйОстатокКт,";
					
				Иначе
					
					ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
					|"+СчетИсточник.ПоказательИсточникаДанныхДляФактаСум+"*&КоэффициентДляФактаСум_"+КодИсточника+" КАК ВалютнаяСуммаНачальныйОстатокДт,
					|0 КАК ВалютнаяСуммаНачальныйОстатокКт,
					|0 КАК ВалютнаяСуммаКонечныйОстатокДт,
					|0 КАК ВалютнаяСуммаКонечныйОстатокКт,
					|"+СтрЗаменить(ТекстСуммаУпр,"СуммаУпрОстаток","СуммаУпрНачальныйОстатокДт")+",
					|0 КАК СуммаУпрНачальныйОстатокКт,
					|0 КАК СуммаУпрКонечныйОстатокДт,
					|0 КАК СуммаУпрКонечныйОстатокКт,";
					
				КонецЕсли;
				
				СтруктураПараметров.Вставить("КоэффициентДляФактаСум_"+КодИсточника,СчетИсточник.КоэффициентДляФактаСум);
				
			КонецЕсли;
			
			Если ПустаяСтрока(СчетИсточник.ПоказательИсточникаДанныхДляФактаКол) Тогда
				ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
				|0 КАК КоличествоНачальныйОстатокДт,
				|0 КАК КоличествоНачальныйОстатокКт,
				|0 КАК КоличествоКонечныйОстатокДт,
				|0 КАК КоличествоКонечныйОстатокКт,";
			Иначе
				Если СчетИсточник.ВидСчета=ВидСчета.Пассивный Тогда	
					
					ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
					|0 КАК КоличествоНачальныйОстатокДт,
					|"+СчетИсточник.ПоказательИсточникаДанныхДляФактаКол+"*&КоэффициентДляФактаКол_"+КодИсточника+" КАК КоличествоНачальныйОстатокКт,
					|0 КАК КоличествоКонечныйОстатокДт,
					|0 КАК КоличествоКонечныйОстатокКт,";
					
				Иначе
					
					ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
					|"+СчетИсточник.ПоказательИсточникаДанныхДляФактаКол+"*&КоэффициентДляФактаКол_"+КодИсточника+" КАК КоличествоНачальныйОстатокДт,
					|0 КАК КоличествоНачальныйОстатокКт,
					|0 КАК КоличествоКонечныйОстатокДт,
					|0 КАК КоличествоКонечныйОстатокКт,";
					
				КонецЕсли;
				
				СтруктураПараметров.Вставить("КоэффициентДляФактаКол_"+КодИсточника,СчетИсточник.КоэффициентДляФактаКол);
				
			КонецЕсли;
			
			ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
			|0 КАК ВалютнаяСуммаНачальныйОстатокДтИтог,
			|0 КАК ВалютнаяСуммаНачальныйОстатокКтИтог,
			|0 КАК ВалютнаяСуммаКонечныйОстатокДтИтог,
			|0 КАК ВалютнаяСуммаКонечныйОстатокКтИтог,
			|0 КАК СуммаУпрНачальныйОстатокДтИтог,
			|0 КАК СуммаУпрНачальныйОстатокКтИтог,
			|0 КАК СуммаУпрКонечныйОстатокДтИтог,
			|0 КАК СуммаУпрКонечныйОстатокКтИтог,
			|0 КАК КоличествоНачальныйОстатокДтИтог,
			|0 КАК КоличествоНачальныйОстатокКтИтог,
			|0 КАК КоличествоКонечныйОстатокДтИтог,
			|0 КАК КоличествоКонечныйОстатокКтИтог";
			
			ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
			|ИЗ
			|("+РабочийТекстПериодНач+") КАК "+КодИсточника+"Нач"+ТекстСоединения;
			
			//Остатки на конец периода
			
			ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
			|ОБЪЕДИНИТЬ ВСЕ
			|ВЫБРАТЬ
			|&Счет"+КодИсточника+" КАК Счет,
			|&ДатаОстатка"+КодИсточника+"_"+НомерПериода+" КАК Период,";
			
			СтруктураПараметров.Вставить("Счет"+КодИсточника,СчетИсточник.Счет);
			
			Если СтруктураИзмерений.Свойство("ЦФО") Тогда
				ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
				|"+СтруктураИзмерений.ЦФО+" КАК ЦФО,";
			Иначе
				ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
				|&ПустойЦФО КАК ЦФО,";	
			КонецЕсли;
			
			Если СтруктураИзмерений.Свойство("Проект") Тогда
				ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
				|"+СтруктураИзмерений.Проект+" КАК Проект,";
			Иначе
				ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
				|&ПустойПроект КАК Проект,";	
			КонецЕсли;
			
			Если СтруктураИзмерений.Свойство("Контрагент") Тогда
				ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
				|"+СтруктураИзмерений.Контрагент+" КАК Контрагент,";
			Иначе
				ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
				|&ПустойКонтрагент КАК Контрагент,";	
			КонецЕсли;
			
			Если СтруктураИзмерений.Свойство("Номенклатура") Тогда
				ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
				|"+СтруктураИзмерений.Номенклатура+" КАК Номенклатура,";
			Иначе
				ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
				|&ПустойНоменклатура КАК Номенклатура,";	
			КонецЕсли;
			
			Если СчетИсточник.СпособОпределенияВалютыОборотаФакт=Перечисления.СпособыОпределенияВалютыОборотаПоСтатье.ВалютаИсточникаДанных Тогда
				ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
				|"+СтруктураИзмерений.Валюта+" КАК Валюта,";
				
				ТекстСуммаУпр="
				|ВЫБОР
				|		КОГДА КурсыИсточника.Курс <>0 И КурсыУпрУчета.Курс <>0 ТОГДА
				|			"+СчетИсточник.ПоказательИсточникаДанныхДляФактаСум+"*&КоэффициентДляФактаСум_"+КодИсточника+"*КурсыИсточника.Курс * КурсыУпрУчета.Кратность 
				|			/ (КурсыУпрУчета.Курс * КурсыИсточника.Кратность)
				|		ИНАЧЕ
				|			0
				|		КОНЕЦ  КАК СуммаУпрОстаток";
				
				ТекстСоединения="
				|	ЛЕВОЕ СОЕДИНЕНИЕ 
				|	РегистрСведений.КурсыВалют.СрезПоследних(&ДатаИсточника_"+"_"+КодИсточника+"_"+НомерПериода+"_"+"Кон, Валюта=&ВалютаУпрУчета) КАК КурсыУпрУчета
				|	ПО ИСТИНА
				|	ЛЕВОЕ СОЕДИНЕНИЕ
				|	РегистрСведений.КурсыВалют.СрезПоследних(&ДатаИсточника_"+"_"+КодИсточника+"_"+НомерПериода+"_"+"Кон) КАК КурсыИсточника
				|	ПО "+КодИсточника+"Кон."+СтруктураИзмерений.Валюта+"=КурсыИсточника.Валюта";
				
				
			ИначеЕсли СчетИсточник.СпособОпределенияВалютыОборотаФакт=Перечисления.СпособыОпределенияВалютыОборотаПоСтатье.ВалютаРегламентированногоУчета Тогда
				ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
				|&ВалютаРеглУчета КАК Валюта,";
				
				ТекстСуммаУпр="
				|ВЫБОР
				|		КОГДА КурсыУпрУчета.Курс <>0 ТОГДА
				|			"+СчетИсточник.ПоказательИсточникаДанныхДляФактаСум+"*&КоэффициентДляФактаСум_"+КодИсточника+"*КурсыУпрУчета.Кратность 
				|			/ (КурсыУпрУчета.Курс)
				|		ИНАЧЕ
				|			0
				|		КОНЕЦ  КАК СуммаУпрОстаток";
				
				ТекстСоединения="
				|	ЛЕВОЕ СОЕДИНЕНИЕ 
				|	РегистрСведений.КурсыВалют.СрезПоследних(&ДатаИсточника_"+"_"+КодИсточника+"_"+НомерПериода+"_"+"Кон, Валюта=&ВалютаУпрУчета) КАК КурсыУпрУчета
				|	ПО ИСТИНА";
				
			Иначе
				ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
				|&ВалютаУпрУчета КАК Валюта,";
				
				ТекстСуммаУпр=СчетИсточник.ПоказательИсточникаДанныхДляФактаСум+"*&КоэффициентДляФактаСум_"+КодИсточника+" КАК СуммаУпрОстаток";
				ТекстСоединения="";
				
			КонецЕсли;
			
			Если ПустаяСтрока(СчетИсточник.ПоказательИсточникаДанныхДляФактаСум) Тогда
				ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
				|0 КАК ВалютнаяСуммаНачальныйОстатокДт,
				|0 КАК ВалютнаяСуммаНачальныйОстатокКт,
				|0 КАК ВалютнаяСуммаКонечныйОстатокДт,
				|0 КАК ВалютнаяСуммаКонечныйОстатокКт,";
				
			Иначе
				
				Если СчетИсточник.ВидСчета=ВидСчета.Пассивный Тогда	
					
					ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
					|0 КАК ВалютнаяСуммаНачальныйОстатокДт,
					|0 КАК ВалютнаяСуммаНачальныйОстатокКт,
					|0 КАК ВалютнаяСуммаКонечныйОстатокДт,
					|"+СчетИсточник.ПоказательИсточникаДанныхДляФактаСум+"*&КоэффициентДляФактаСум_"+КодИсточника+" КАК ВалютнаяСуммаКонечныйОстатокКт,
					|0 КАК СуммаУпрНачальныйОстатокДт,
					|0 КАК СуммаУпрНачальныйОстатокКт,
					|0 КАК СуммаУпрКонечныйОстатокДт,
					|"+СтрЗаменить(ТекстСуммаУпр,"СуммаУпрОстаток","СуммаУпрКонечныйОстатокКт")+",";
					
				Иначе
					
					ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
					|0 КАК ВалютнаяСуммаНачальныйОстатокДт,
					|0 КАК ВалютнаяСуммаНачальныйОстатокКт,
					|"+СчетИсточник.ПоказательИсточникаДанныхДляФактаСум+"*&КоэффициентДляФактаСум_"+КодИсточника+" КАК ВалютнаяСуммаКонечныйОстатокДт,
					|0 КАК ВалютнаяСуммаКонечныйОстатокКт,
					|0 КАК СуммаУпрНачальныйОстатокДт,
					|0 КАК СуммаУпрНачальныйОстатокКт,
					|"+СтрЗаменить(ТекстСуммаУпр,"СуммаУпрОстаток","СуммаУпрКонечныйОстатокДт")+",
					|0 КАК СуммаУпрКонечныйОстатокКт,";
					
				КонецЕсли;
				
			КонецЕсли;
			
			Если ПустаяСтрока(СчетИсточник.ПоказательИсточникаДанныхДляФактаКол) Тогда
				ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
				|0 КАК КоличествоНачальныйОстатокДт,
				|0 КАК КоличествоНачальныйОстатокКт,
				|0 КАК КоличествоКонечныйОстатокДт,
				|0 КАК КоличествоКонечныйОстатокКт,";
			Иначе
				Если СчетИсточник.ВидСчета=ВидСчета.Пассивный Тогда	
					
					ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
					|0 КАК КоличествоНачальныйОстатокДт,
					|0 КАК КоличествоНачальныйОстатокКт,
					|0 КАК КоличествоКонечныйОстатокДт,
					|"+СчетИсточник.ПоказательИсточникаДанныхДляФактаКол+"*&КоэффициентДляФактаКол_"+КодИсточника+" КАК КоличествоНачальныйОстатокКт,";
					
				Иначе
					
					ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
					|0 КАК КоличествоНачальныйОстатокДт,
					|0 КАК КоличествоНачальныйОстатокКт,
					|"+СчетИсточник.ПоказательИсточникаДанныхДляФактаКол+"*&КоэффициентДляФактаКол_"+КодИсточника+" КАК КоличествоКонечныйОстатокДт,
					|0 КАК КоличествоКонечныйОстатокКт,";
					
				КонецЕсли;
				
			КонецЕсли;
			
			ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
			|0 КАК ВалютнаяСуммаНачальныйОстатокДтИтог,
			|0 КАК ВалютнаяСуммаНачальныйОстатокКтИтог,
			|0 КАК ВалютнаяСуммаКонечныйОстатокДтИтог,
			|0 КАК ВалютнаяСуммаКонечныйОстатокКтИтог,
			|0 КАК СуммаУпрНачальныйОстатокДтИтог,
			|0 КАК СуммаУпрНачальныйОстатокКтИтог,
			|0 КАК СуммаУпрКонечныйОстатокДтИтог,
			|0 КАК СуммаУпрКонечныйОстатокКтИтог,
			|0 КАК КоличествоНачальныйОстатокДтИтог,
			|0 КАК КоличествоНачальныйОстатокКтИтог,
			|0 КАК КоличествоКонечныйОстатокДтИтог,
			|0 КАК КоличествоКонечныйОстатокКтИтог";
			
			ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
			|ИЗ
			|("+РабочийТекстПериодКон+") КАК "+КодИсточника+"Кон"+ТекстСоединения;
			
			ТекстОсновногоЗапроса=ТекстОсновногоЗапроса+ТекстЗапросаИсточник;
			
			ДатаОстатка=ОбщегоНазначения.ДобавитьИнтервал(ДатаОстатка,Периодичность,1);	
			НомерПериода=НомерПериода+1;
			
		КонецЦикла;
		
	КонецЕсли;
	
	//Формируем запрос по итогам на границы периода
	
	РабочийТекстПериодНач=СтрЗаменить(РабочийТекст,"&ДатаИсточникаQQQ","&ДатаИсточника_"+"_"+КодИсточника+"_"+"Нач");
	РабочийТекстПериодКон=СтрЗаменить(РабочийТекст,"&ДатаИсточникаQQQ","&ДатаИсточника_"+"_"+КодИсточника+"_"+"Кон");
	
	СтруктураПараметров.Вставить("ДатаИсточника_"+"_"+КодИсточника+"_"+"Нач",НачалоДня(ДатаНач));
	СтруктураПараметров.Вставить("ДатаИсточника_"+"_"+КодИсточника+"_"+"Кон",КонецДня(ДатаКон));		
	
	ТекстЗапросаИсточник="
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|&Счет"+КодИсточника+" КАК Счет,
	|&ДатаОстатка"+КодИсточника+" КАК Период,";
	
	СтруктураПараметров.Вставить("Счет"+КодИсточника,СчетИсточник.Счет);
	СтруктураПараметров.Вставить("ДатаОстатка"+КодИсточника,НачалоДня(ДатаНач));
	
	Если СтруктураИзмерений.Свойство("ЦФО") Тогда
		ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
		|"+СтруктураИзмерений.ЦФО+" КАК ЦФО,";
	Иначе
		ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
		|&ПустойЦФО КАК ЦФО,";	
	КонецЕсли;
	
	Если СтруктураИзмерений.Свойство("Проект") Тогда
		ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
		|"+СтруктураИзмерений.Проект+" КАК Проект,";
	Иначе
		ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
		|&ПустойПроект КАК Проект,";	
	КонецЕсли;
	
	Если СтруктураИзмерений.Свойство("Контрагент") Тогда
		ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
		|"+СтруктураИзмерений.Контрагент+" КАК Контрагент,";
	Иначе
		ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
		|&ПустойКонтрагент КАК Контрагент,";	
	КонецЕсли;
	
	Если СтруктураИзмерений.Свойство("Номенклатура") Тогда
		ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
		|"+СтруктураИзмерений.Номенклатура+" КАК Номенклатура,";
	Иначе
		ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
		|&ПустойНоменклатура КАК Номенклатура,";	
	КонецЕсли;
	
	Если СчетИсточник.СпособОпределенияВалютыОборотаФакт=Перечисления.СпособыОпределенияВалютыОборотаПоСтатье.ВалютаИсточникаДанных Тогда
		ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
		|"+СтруктураИзмерений.Валюта+" КАК Валюта,";
		
		ТекстСуммаУпр="
		|ВЫБОР
		|		КОГДА КурсыИсточника.Курс <>0 И КурсыУпрУчета.Курс <>0 ТОГДА
		|			"+СчетИсточник.ПоказательИсточникаДанныхДляФактаСум+"*&КоэффициентДляФактаСум_"+КодИсточника+"*КурсыИсточника.Курс * КурсыУпрУчета.Кратность 
		|			/ (КурсыУпрУчета.Курс * КурсыИсточника.Кратность)
		|		ИНАЧЕ
		|			0
		|		КОНЕЦ  КАК СуммаУпрОстаток";
		
		ТекстСоединения="
		|	ЛЕВОЕ СОЕДИНЕНИЕ 
		|	РегистрСведений.КурсыВалют.СрезПоследних(&ДатаИсточника_"+"_"+КодИсточника+"_"+"Нач, Валюта=&ВалютаУпрУчета) КАК КурсыУпрУчета
		|	ПО ИСТИНА
		|	ЛЕВОЕ СОЕДИНЕНИЕ
		|	РегистрСведений.КурсыВалют.СрезПоследних(&ДатаИсточника_"+"_"+КодИсточника+"_"+"Нач) КАК КурсыИсточника
		|	ПО "+КодИсточника+"Нач."+СтруктураИзмерений.Валюта+"=КурсыИсточника.Валюта";
		
		
	ИначеЕсли СчетИсточник.СпособОпределенияВалютыОборотаФакт=Перечисления.СпособыОпределенияВалютыОборотаПоСтатье.ВалютаРегламентированногоУчета Тогда
		ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
		|&ВалютаРеглУчета КАК Валюта,";
		
		ТекстСуммаУпр="
		|ВЫБОР
		|		КОГДА КурсыУпрУчета.Курс <>0 ТОГДА
		|			"+СчетИсточник.ПоказательИсточникаДанныхДляФактаСум+"*&КоэффициентДляФактаСум_"+КодИсточника+"*КурсыУпрУчета.Кратность 
		|			/ (КурсыУпрУчета.Курс)
		|		ИНАЧЕ
		|			0
		|		КОНЕЦ  КАК СуммаУпрОстаток";
		
		ТекстСоединения="
		|	ЛЕВОЕ СОЕДИНЕНИЕ 
		|	РегистрСведений.КурсыВалют.СрезПоследних(&ДатаИсточника_"+"_"+КодИсточника+"_"+"Нач, Валюта=&ВалютаУпрУчета) КАК КурсыУпрУчета
		|	ПО ИСТИНА";
		
	Иначе
		ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
		|&ВалютаУпрУчета КАК Валюта,";
		
		ТекстСуммаУпр=СчетИсточник.ПоказательИсточникаДанныхДляФактаСум+"*&КоэффициентДляФактаСум_"+КодИсточника+" КАК СуммаУпрОстаток";
		ТекстСоединения="";
		
	КонецЕсли;
	
	ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
	|0 КАК ВалютнаяСуммаНачальныйОстатокДт,
	|0 КАК ВалютнаяСуммаНачальныйОстатокКт,
	|0 КАК ВалютнаяСуммаКонечныйОстатокДт,
	|0 КАК ВалютнаяСуммаКонечныйОстатокКт,
	|0 КАК СуммаУпрНачальныйОстатокДт,
	|0 КАК СуммаУпрНачальныйОстатокКт,
	|0 КАК СуммаУпрКонечныйОстатокДт,
	|0 КАК СуммаУпрКонечныйОстатокКт,
	|0 КАК КоличествоНачальныйОстатокДт,
	|0 КАК КоличествоНачальныйОстатокКт,
	|0 КАК КоличествоКонечныйОстатокДт,
	|0 КАК КоличествоКонечныйОстатокКт,";
	
	Если ПустаяСтрока(СчетИсточник.ПоказательИсточникаДанныхДляФактаСум) Тогда
		ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
		|0 КАК ВалютнаяСуммаНачальныйОстатокДтИтог,
		|0 КАК ВалютнаяСуммаНачальныйОстатокКтИтог,
		|0 КАК ВалютнаяСуммаКонечныйОстатокДтИтог,
		|0 КАК ВалютнаяСуммаКонечныйОстатокКтИтог,";
		
	Иначе
		
		Если СчетИсточник.ВидСчета=ВидСчета.Пассивный Тогда	
			
			ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
			|0 КАК ВалютнаяСуммаНачальныйОстатокДтИтог,
			|"+СчетИсточник.ПоказательИсточникаДанныхДляФактаСум+"*&КоэффициентДляФактаСум_"+КодИсточника+" КАК ВалютнаяСуммаНачальныйОстатокКтИтог,
			|0 КАК ВалютнаяСуммаКонечныйОстатокДтИтог,
			|0 КАК ВалютнаяСуммаКонечныйОстатокКтИтог,
			|0 КАК СуммаУпрНачальныйОстатокДтИтог,
			|"+СтрЗаменить(ТекстСуммаУпр,"СуммаУпрОстаток","СуммаУпрНачальныйОстатокКтИтог")+",
			|0 КАК СуммаУпрКонечныйОстатокДтИтог,
			|0 КАК СуммаУпрКонечныйОстатокКтИтог,";
			
		Иначе
			
			ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
			|"+СчетИсточник.ПоказательИсточникаДанныхДляФактаСум+"*&КоэффициентДляФактаСум_"+КодИсточника+" КАК ВалютнаяСуммаНачальныйОстатокДтИтог,
			|0 КАК ВалютнаяСуммаНачальныйОстатокКтИтог,
			|0 КАК ВалютнаяСуммаКонечныйОстатокДтИтог,
			|0 КАК ВалютнаяСуммаКонечныйОстатокКтИтог,
			|"+СтрЗаменить(ТекстСуммаУпр,"СуммаУпрОстаток","СуммаУпрНачальныйОстатокДтИтог")+",
			|0 КАК СуммаУпрНачальныйОстатокКтИтог,
			|0 КАК СуммаУпрКонечныйОстатокДтИтог,
			|0 КАК СуммаУпрКонечныйОстатокКтИтог,";
			
		КонецЕсли;
		
		СтруктураПараметров.Вставить("КоэффициентДляФактаСум_"+КодИсточника,СчетИсточник.КоэффициентДляФактаСум);
		
	КонецЕсли;
	
	Если ПустаяСтрока(СчетИсточник.ПоказательИсточникаДанныхДляФактаКол) Тогда
		ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
		|0 КАК КоличествоНачальныйОстатокДтИтог,
		|0 КАК КоличествоНачальныйОстатокКтИтог,
		|0 КАК КоличествоКонечныйОстатокДтИтог,
		|0 КАК КоличествоКонечныйОстатокКтИтог";
	Иначе
		Если СчетИсточник.ВидСчета=ВидСчета.Пассивный Тогда	
			
			ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
			|0 КАК КоличествоНачальныйОстатокДтИтог,
			|"+СчетИсточник.ПоказательИсточникаДанныхДляФактаКол+"*&КоэффициентДляФактаКол_"+КодИсточника+" КАК КоличествоНачальныйОстатокКтИтог,
			|0 КАК КоличествоКонечныйОстатокДтИтог,
			|0 КАК КоличествоКонечныйОстатокКтИтог";
			
		Иначе
			
			ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
			|"+СчетИсточник.ПоказательИсточникаДанныхДляФактаКол+"*&КоэффициентДляФактаКол_"+КодИсточника+" КАК КоличествоНачальныйОстатокДтИтог,
			|0 КАК КоличествоНачальныйОстатокКтИтог,
			|0 КАК КоличествоКонечныйОстатокДтИтог,
			|0 КАК КоличествоКонечныйОстатокКтИтог";
			
		КонецЕсли;
		
		СтруктураПараметров.Вставить("КоэффициентДляФактаКол_"+КодИсточника,СчетИсточник.КоэффициентДляФактаКол);
		
	КонецЕсли;
	
	ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
	|ИЗ
	|("+РабочийТекстПериодНач+") КАК "+КодИсточника+"Нач"+ТекстСоединения;
	
	//Остатки на конец периода
	
	ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|&Счет"+КодИсточника+" КАК Счет,
	|&ДатаОстатка"+КодИсточника+" КАК Период,";
	
	СтруктураПараметров.Вставить("Счет"+КодИсточника,СчетИсточник.Счет);
	
	Если СтруктураИзмерений.Свойство("ЦФО") Тогда
		ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
		|"+СтруктураИзмерений.ЦФО+" КАК ЦФО,";
	Иначе
		ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
		|&ПустойЦФО КАК ЦФО,";	
	КонецЕсли;
	
	Если СтруктураИзмерений.Свойство("Проект") Тогда
		ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
		|"+СтруктураИзмерений.Проект+" КАК Проект,";
	Иначе
		ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
		|&ПустойПроект КАК Проект,";	
	КонецЕсли;
	
	Если СтруктураИзмерений.Свойство("Контрагент") Тогда
		ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
		|"+СтруктураИзмерений.Контрагент+" КАК Контрагент,";
	Иначе
		ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
		|&ПустойКонтрагент КАК Контрагент,";	
	КонецЕсли;
	
	Если СтруктураИзмерений.Свойство("Номенклатура") Тогда
		ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
		|"+СтруктураИзмерений.Номенклатура+" КАК Номенклатура,";
	Иначе
		ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
		|&ПустойНоменклатура КАК Номенклатура,";	
	КонецЕсли;
	
	Если СчетИсточник.СпособОпределенияВалютыОборотаФакт=Перечисления.СпособыОпределенияВалютыОборотаПоСтатье.ВалютаИсточникаДанных Тогда
		ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
		|"+СтруктураИзмерений.Валюта+" КАК Валюта,";
		
		ТекстСуммаУпр="
		|ВЫБОР
		|		КОГДА КурсыИсточника.Курс <>0 И КурсыУпрУчета.Курс <>0 ТОГДА
		|			"+СчетИсточник.ПоказательИсточникаДанныхДляФактаСум+"*&КоэффициентДляФактаСум_"+КодИсточника+"*КурсыИсточника.Курс * КурсыУпрУчета.Кратность 
		|			/ (КурсыУпрУчета.Курс * КурсыИсточника.Кратность)
		|		ИНАЧЕ
		|			0
		|		КОНЕЦ  КАК СуммаУпрОстаток";
		
		ТекстСоединения="
		|	ЛЕВОЕ СОЕДИНЕНИЕ 
		|	РегистрСведений.КурсыВалют.СрезПоследних(&ДатаИсточника_"+"_"+КодИсточника+"_"+"Кон, Валюта=&ВалютаУпрУчета) КАК КурсыУпрУчета
		|	ПО ИСТИНА
		|	ЛЕВОЕ СОЕДИНЕНИЕ
		|	РегистрСведений.КурсыВалют.СрезПоследних(&ДатаИсточника_"+"_"+КодИсточника+"_"+"Кон) КАК КурсыИсточника
		|	ПО "+КодИсточника+"Кон."+СтруктураИзмерений.Валюта+"=КурсыИсточника.Валюта";
		
		
	ИначеЕсли СчетИсточник.СпособОпределенияВалютыОборотаФакт=Перечисления.СпособыОпределенияВалютыОборотаПоСтатье.ВалютаРегламентированногоУчета Тогда
		ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
		|&ВалютаРеглУчета КАК Валюта,";
		
		ТекстСуммаУпр="
		|ВЫБОР
		|		КОГДА КурсыУпрУчета.Курс <>0 ТОГДА
		|			"+СчетИсточник.ПоказательИсточникаДанныхДляФактаСум+"*&КоэффициентДляФактаСум_"+КодИсточника+"*КурсыУпрУчета.Кратность 
		|			/ (КурсыУпрУчета.Курс)
		|		ИНАЧЕ
		|			0
		|		КОНЕЦ  КАК СуммаУпрОстаток";
		
		ТекстСоединения="
		|	ЛЕВОЕ СОЕДИНЕНИЕ 
		|	РегистрСведений.КурсыВалют.СрезПоследних(&ДатаИсточника_"+"_"+КодИсточника+"_"+"Кон, Валюта=&ВалютаУпрУчета) КАК КурсыУпрУчета
		|	ПО ИСТИНА";
		
	Иначе
		ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
		|&ВалютаУпрУчета КАК Валюта,";
		
		ТекстСуммаУпр=СчетИсточник.ПоказательИсточникаДанныхДляФактаСум+"*&КоэффициентДляФактаСум_"+КодИсточника+" КАК СуммаУпрОстаток";
		ТекстСоединения="";
		
	КонецЕсли;
	
	ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
	|0 КАК ВалютнаяСуммаНачальныйОстатокДт,
	|0 КАК ВалютнаяСуммаНачальныйОстатокКт,
	|0 КАК ВалютнаяСуммаКонечныйОстатокДт,
	|0 КАК ВалютнаяСуммаКонечныйОстатокКт,
	|0 КАК СуммаУпрНачальныйОстатокДт,
	|0 КАК СуммаУпрНачальныйОстатокКт,
	|0 КАК СуммаУпрКонечныйОстатокДт,
	|0 КАК СуммаУпрКонечныйОстатокКт,
	|0 КАК КоличествоНачальныйОстатокДт,
	|0 КАК КоличествоНачальныйОстатокКт,
	|0 КАК КоличествоКонечныйОстатокДт,
	|0 КАК КоличествоКонечныйОстатокКт,";
	
	Если ПустаяСтрока(СчетИсточник.ПоказательИсточникаДанныхДляФактаСум) Тогда
		ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
		|0 КАК ВалютнаяСуммаНачальныйОстатокДтИтог,
		|0 КАК ВалютнаяСуммаНачальныйОстатокКтИтог,
		|0 КАК ВалютнаяСуммаКонечныйОстатокДтИтог,
		|0 КАК ВалютнаяСуммаКонечныйОстатокКтИтог,";
		
	Иначе
		
		Если СчетИсточник.ВидСчета=ВидСчета.Пассивный Тогда	
			
			ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
			|0 КАК ВалютнаяСуммаНачальныйОстатокДтИтог,
			|0 КАК ВалютнаяСуммаНачальныйОстатокКтИтог,
			|0 КАК ВалютнаяСуммаКонечныйОстатокДтИтог,
			|"+СчетИсточник.ПоказательИсточникаДанныхДляФактаСум+"*&КоэффициентДляФактаСум_"+КодИсточника+" КАК ВалютнаяСуммаКонечныйОстатокКтИтог,
			|0 КАК СуммаУпрНачальныйОстатокДтИтог,
			|0 КАК СуммаУпрНачальныйОстатокКтИтог,
			|0 КАК СуммаУпрКонечныйОстатокДтИтог,
			|"+СтрЗаменить(ТекстСуммаУпр,"СуммаУпрОстаток","СуммаУпрКонечныйОстатокКтИтог")+",";
			
		Иначе
			
			ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
			|0 КАК ВалютнаяСуммаНачальныйОстатокДтИтог,
			|0 КАК ВалютнаяСуммаНачальныйОстатокКтИтог,
			|"+СчетИсточник.ПоказательИсточникаДанныхДляФактаСум+"*&КоэффициентДляФактаСум_"+КодИсточника+" КАК ВалютнаяСуммаКонечныйОстатокДтИтог,
			|0 КАК ВалютнаяСуммаКонечныйОстатокКтИтог,
			|0 КАК СуммаУпрНачальныйОстатокДтИтог,
			|0 КАК СуммаУпрНачальныйОстатокКтИтог,
			|"+СтрЗаменить(ТекстСуммаУпр,"СуммаУпрОстаток","СуммаУпрКонечныйОстатокДтИтог")+",
			|0 КАК СуммаУпрКонечныйОстатокКтИтог,";
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПустаяСтрока(СчетИсточник.ПоказательИсточникаДанныхДляФактаКол) Тогда
		ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
		|0 КАК КоличествоНачальныйОстатокДтИтог,
		|0 КАК КоличествоНачальныйОстатокКтИтог,
		|0 КАК КоличествоКонечныйОстатокДтИтог,
		|0 КАК КоличествоКонечныйОстатокКтИтог";
	Иначе
		Если СчетИсточник.ВидСчета=ВидСчета.Пассивный Тогда	
			
			ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
			|0 КАК КоличествоНачальныйОстатокДтИтог,
			|0 КАК КоличествоНачальныйОстатокКтИтог,
			|0 КАК КоличествоКонечныйОстатокДтИтог,
			|"+СчетИсточник.ПоказательИсточникаДанныхДляФактаКол+"*&КоэффициентДляФактаКол_"+КодИсточника+" КАК КоличествоНачальныйОстатокКтИтог,";
			
		Иначе
			
			ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
			|0 КАК КоличествоНачальныйОстатокДтИтог,
			|0 КАК КоличествоНачальныйОстатокКтИтог,
			|"+СчетИсточник.ПоказательИсточникаДанныхДляФактаКол+"*&КоэффициентДляФактаКол_"+КодИсточника+" КАК КоличествоКонечныйОстатокДтИтог,
			|0 КАК КоличествоКонечныйОстатокКтИтог";
			
		КонецЕсли;
		
	КонецЕсли;
	
	ТекстЗапросаИсточник=ТекстЗапросаИсточник+"
	|ИЗ
	|("+РабочийТекстПериодКон+") КАК "+КодИсточника+"Кон"+ТекстСоединения;
	
	ТекстОсновногоЗапроса=ТекстОсновногоЗапроса+ТекстЗапросаИсточник;
		
					
КонецПроцедуры // ДобавитьВТекстОсновногоЗапросаОстаткиПериод()

#КонецЕсли
