
&НаКлиенте
Процедура ЮЦ_УдалитьПодразделениеВместо(Команда)
	ПутевойЛист_Задание_Подразделение = Неопределено;
КонецПроцедуры

&НаКлиенте
Процедура ЮЦ_ВыбратьПодразделениеВместо(Команда)
	ОповещениеВыбора = Новый ОписаниеОповещения("ОбработкаВыбораПодразделение", ЭтотОбъект);
	ОткрытьФорму("Обработка.уатТерминалПриемаИВыдачиПутевыхЛистов.Форма.ФормаВыбораСправочников",
		Новый Структура("ИмяОбъектаВыбора", "Подразделение"),
		ЭтотОбъект,,,, ОповещениеВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораПодразделение(Результат, ДопПараметры) Экспорт
	Если ЗначениеЗаполнено(Результат) Тогда
		ПутевойЛист_Задание_Подразделение = Результат;
		ПутевойЛист_Задание_ПодразделениеПриИзменении(Неопределено);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПутевойЛист_Задание_ПодразделениеПриИзменении(Элемент)
	ПутевойЛист_Задание[ПутевойЛист_Задание_НомерСтроки - 1].Подразделение = ПутевойЛист_Задание_Подразделение;
КонецПроцедуры

&НаКлиенте
&Вместо("ОтобразитьСтрокуЗадания")
Процедура ЮЦ_ОтобразитьСтрокуЗадания(НомерСтроки)
	Если ПутевойЛист_Задание.Количество() = 0 Тогда
		Элементы.ГруппаЗаданиеСтрока.Видимость = Ложь;
		
		ПутевойЛист_Задание_Выполнено = Ложь;
		ПутевойЛист_Задание_ВыполненоТумблер = 0;
		ПутевойЛист_Задание_КоличествоЕздок = 0;
		ПутевойЛист_Задание_КоличествоКмГруз = 0;
		ПутевойЛист_Задание_КоличествоКмПорожний = 0;
		ПутевойЛист_Задание_КоличествоОпераций = 0;
		ПутевойЛист_Задание_Объем = 0;
		ПутевойЛист_Задание_КоличествоТонн = 0;
		ПутевойЛист_Задание_КоличествоЧасов = 0;
		ПутевойЛист_Задание_УсловиеРаботы       = Неопределено;
		ПутевойЛист_Задание_Контрагент          = Неопределено;
		ПутевойЛист_Задание_ОбъектСтроительства = Неопределено;
		ПутевойЛист_Задание_НомерСтроки = 0;
		ПутевойЛист_Задание_Подразделение = Неопределено;
	Иначе
		Элементы.ГруппаЗаданиеСтрока.Видимость = Истина;
		
		ТекСтрока = ПутевойЛист_Задание[НомерСтроки-1];
		
		ПутевойЛист_Задание_Выполнено = ТекСтрока.Выполнено;
		ПутевойЛист_Задание_ВыполненоТумблер = ?(ТекСтрока.Выполнено, 1, 0);
		ПутевойЛист_Задание_КоличествоЕздок = ТекСтрока.КоличествоЕздок;
		ПутевойЛист_Задание_КоличествоКмГруз = ТекСтрока.КоличествоКмГруз;
		ПутевойЛист_Задание_КоличествоКмПорожний = ТекСтрока.КоличествоКмПорожний;
		ПутевойЛист_Задание_КоличествоОпераций = ТекСтрока.КоличествоОпераций;
		ПутевойЛист_Задание_КоличествоТонн = ТекСтрока.КоличествоТонн;
		ПутевойЛист_Задание_Объем = ТекСтрока.Объем;
		ПутевойЛист_Задание_КоличествоЧасов = ТекСтрока.КоличествоЧасов;
		ПутевойЛист_Задание_УсловиеРаботы = ТекСтрока.УсловиеРаботы;
		ПутевойЛист_Задание_Контрагент          = ТекСтрока.Контрагент;
		ПутевойЛист_Задание_ОбъектСтроительства = ТекСтрока.ОбъектСтроительства;
		ПутевойЛист_Задание_НомерСтроки = НомерСтроки;
		ПутевойЛист_Задание_Подразделение = ТекСтрока.Подразделение;
	КонецЕсли;
	
	ОбновитьНавигациюЗадания();
КонецПроцедуры


&НаКлиенте
Процедура ЮЦ_УдалитьКАУПосле(Команда)
	ПутевойЛист_Задание_КАУ = Неопределено;
КонецПроцедуры


&НаКлиенте
Процедура ЮЦ_ВыбратьКАУПосле(Команда)
	ОповещениеВыбора = Новый ОписаниеОповещения("ОбработкаВыбораКАУ", ЭтотОбъект);
	ОткрытьФорму("Обработка.уатТерминалПриемаИВыдачиПутевыхЛистов.Форма.ФормаВыбораСправочников",
		Новый Структура("ИмяОбъектаВыбора", "КАУ"),
		ЭтотОбъект,,,, ОповещениеВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

	КонецПроцедуры   
	&НаКлиенте
Процедура ОбработкаВыбораКАУ(Результат, ДопПараметры) Экспорт
	Если ЗначениеЗаполнено(Результат) Тогда
		ПутевойЛист_Задание_КАУ = Результат;
		ПутевойЛист_Задание_КАУПриИзменении(Неопределено);
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура ПутевойЛист_Задание_КАУПриИзменении(Элемент)
	ПутевойЛист_Задание[ПутевойЛист_Задание_НомерСтроки - 1].КАУ = ПутевойЛист_Задание_КАУ;
КонецПроцедуры



