
&НаКлиенте
Процедура Заполнить(Команда)
	ПараметрыОткрытия = Новый СТруктура("СтруктураНастроек",СтруктураНастроек);
	Ответ = Неопределено;
	
	ОткрытьФорму("Справочник.ПрофилиИзмененияПлановПоПериодам.Форма.Автозаполнение",ПараметрыОткрытия,ЭтаФорма,,,, Новый ОписаниеОповещения("ЗаполнитьЗавершение", ЭтаФорма), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Ответ = Результат;
	Если Ответ = Неопределено Тогда
		Возврат;	
	Конецесли;
	
	Если ТипЗнч(Ответ) = Тип("Структура") Тогда
		СтруктураНастроек = Ответ.СтруктураНастроек;
		Объект.ПрофильИзменения.Очистить();
		Для Каждого ЭлементСтруткуры Из Ответ.Данные Цикл
			НоваяСтрока = Объект.ПрофильИзменения.Добавить();
			НоваяСтрока.НомерПериода = ЭлементСтруткуры.Ключ;
			НоваяСтрока.Коэффициент = ЭлементСтруткуры.Значение;
		КонецЦикла;	
		СортироватьНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтруктураНастроек = Новый Структура;
КонецПроцедуры

&НаСервере
Процедура СортироватьНаСервере()
	ТЗ= Объект.ПрофильИзменения.Выгрузить();
	ТЗ.Сортировать("НомерПериода");
	Объект.ПрофильИзменения.Загрузить(ТЗ);
КонецПроцедуры

&НаКлиенте
Процедура Сортировать(Команда)
	СортироватьНаСервере();
КонецПроцедуры
