
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ЮЦАУ_РабочееВремяПоУчасткам 
	Движения.ОборотыБюджетов.Записывать = Истина;
	
	Для Каждого ТекСтрокаКоличество Из ДанныеПоДням Цикл
		
		Для i = 1 По 31 Цикл
			
			Если ТекСтрокаКоличество["Количество"+i] > 0 Тогда
				
				Движение = Движения.ОборотыБюджетов.Добавить();
				Движение.Период = НачалоМесяца(Дата) + (i-1)*24*60*60;
				Движение.Организация = Организация;
				//Движение. = Участок;
				//Движение.КАУ = КАУ;
				Движение.СтатьяОборотов = ТекСтрокаКоличество.Показатель;
				Движение.Количество = ТекСтрокаКоличество["Количество"+i];
				
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры
