&НаКлиенте
Процедура Заполнить(Команда)
	Если Объект.БюджетныеОперации.Количество() > 0 Тогда
		Ответ = Неопределено;
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьЗавершение", ЭтаФорма), "Перед заполнением табличная часть будет очищена. Заполнить?",РежимДиалогаВопрос.ДаНет);  //ЭтотОбъект //Паша
	Иначе
		ЗаполнитьНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса;
	Если Ответ=КодВозвратаДиалога.Да Тогда
		ЗаполнитьНаСервере();	
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьНаСервере()
	Для НомерРасчета = 1 По 2 Цикл
		ПолучитьФактическиеДанные(НомерРасчета);	
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПолучитьФактическиеДанные(НомерРасчета) Экспорт
	
	Если НомерРасчета = 2 Тогда
		ПараметрыЗаписи = Новый Структура("РежимЗаписДокумента",РежимЗаписиДокумента.Проведение);
		Записать(ПараметрыЗаписи);
	ИначеЕсли НомерРасчета = 1 Тогда
		Если Объект.Проведен  Тогда
			ПараметрыЗаписи = Новый Структура("РежимЗаписДокумента",РежимЗаписиДокумента.ОтменаПроведения);
			Записать(ПараметрыЗаписи);
		КонецЕсли;
	КонецЕсли;	
	
	// Выберем статьи оборотов, для которых будем получать данные
	Запрос=Новый Запрос;
	СтруктураПараметров=Новый Структура;
	
	ТекстЗапроса="ВЫБРАТЬ
	|	СтатьиОборотовПоБюджетам.Ссылка КАК СтатьяОборотов,
	|	СтатьиОборотовПоБюджетам.Ссылка.ИсточникДанныхДляФакта КАК ИсточникДанных,
	|	СтатьиОборотовПоБюджетам.Ссылка.ПоказательИсточникаДанныхКонтрагент КАК ПоказательКонтрагнет,
	|	СтатьиОборотовПоБюджетам.Ссылка.ПоказательИсточникаДанныхНоменклатура КАК ПоказательНоменклатура,
	|	СтатьиОборотовПоБюджетам.Ссылка.Представление КАК СтатьяОборотовПредставление,
	|	СтатьиОборотовПоБюджетам.УчетПоКоличеству,
	|	СтатьиОборотовПоБюджетам.УчетПоСумме,
	|	СтатьиОборотовПоБюджетам.ИсточникДанныхДляФакта.ТекстЗапроса КАК ТекстЗапроса,
	|	СтатьиОборотовПоБюджетам.ИсточникДанныхДляФакта.НастройкиПостроителя КАК НастройкиПостроителя,
	|	СтатьиОборотовПоБюджетам.ИсточникДанныхДляФакта.ИзмеренияИсточника КАК ИзмеренияИсточника,
	|	СтатьиОборотовПоБюджетам.ИсточникДанныхДляФакта.ПроизвольныйЗапрос КАК ПроизвольныйЗапрос,
	|	СтатьиОборотовПоБюджетам.ИсточникДанныхДляФакта.ДатыОтбораДанныхИсточника КАК ДатыОтбораДанныхИсточника,
	|	СтатьиОборотовПоБюджетам.ПоказательИсточникаДанныхДляФактаСум,
	|	СтатьиОборотовПоБюджетам.КоэффициентДляФактаСум,
	|	СтатьиОборотовПоБюджетам.СпособОпределенияВалютыОборотаФакт,
	|	СтатьиОборотовПоБюджетам.ПоказательИсточникаДанныхДляФактаКол,
	|	СтатьиОборотовПоБюджетам.КоэффициентДляФактаКол,
	|	СтатьиОборотовПоБюджетам.ОсновнаяВалюта,
	|	СтатьиОборотовПоБюджетам.РазделениеПоКонтрагентам,
	|	СтатьиОборотовПоБюджетам.РазделениеПоНоменклатуре
	|ИЗ
	|	Справочник.СтатьиОборотовПоБюджетам КАК СтатьиОборотовПоБюджетам";
	Если ЗначениеЗаполнено(Объект.ЦФО) Тогда // Выбираем источники, в измерениях которых есть ЦФО
		ТекстЗапроса=ТекстЗапроса+"		  		  
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИсточникиДанныхДляРасчетовБюджетирования.ИзмеренияИсточника КАК ИсточникиДанныхДляРасчетовБюджетированияИзмеренияИсточника
		|		ПО СтатьиОборотовПоБюджетам.ИсточникДанныхДляФакта = ИсточникиДанныхДляРасчетовБюджетированияИзмеренияИсточника.Ссылка 
		|		И (ИсточникиДанныхДляРасчетовБюджетированияИзмеренияИсточника.ИзмерениеБюджетирования = &ЦФО)";
		СтруктураПараметров.Вставить("ЦФО",Перечисления.ИзмеренияБюджетирования.ЦФО);
	КонецЕсли;
	ТекстЗапроса=ТекстЗапроса+"
	|ГДЕ
	|	СтатьиОборотовПоБюджетам.ИсточникДанныхДляФакта <> &ПустойИсточникДанных";
	Если ЗначениеЗаполнено(Объект.СтатьиОборотов) Тогда
		ТекстЗапроса=ТекстЗапроса+"
		|И
		|	СтатьиОборотовПоБюджетам.Ссылка В ИЕРАРХИИ(&СтатьиОборотов)";
		СтруктураПараметров.Вставить("СтатьиОборотов",Объект.СтатьиОборотов);
	КонецЕсли;
	
	Запрос.Текст=ТекстЗапроса;
	Запрос.УстановитьПараметр("ПустойИсточникДанных",Новый(Тип("СправочникСсылка.ИсточникиДанныхДляРасчетовБюджетирования")));
	
	Для Каждого Параметр Из СтруктураПараметров Цикл
		
		Запрос.УстановитьПараметр(Параметр.Ключ,Параметр.Значение);
		
	КонецЦикла;
	
	РезультатЗапроса=Запрос.Выполнить().Выбрать();
	
	СписокЦФО=Новый СписокЗначений;
	
	//Заполним список ЦФО для отбора
	Если ЗначениеЗаполнено(Объект.ЦФО) Тогда
		
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
		|	Подразделения.Ссылка КАК ЦФО
		|ИЗ
		|	Справочник.Подразделения КАК Подразделения
		|
		|ГДЕ
		|	Подразделения.Ссылка В ИЕРАРХИИ(&ЦФО)";
		
		Запрос.УстановитьПараметр("ЦФО",Объект.ЦФО);
		СписокЦФО.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ЦФО"));
		
	КонецЕсли;
	
	Объект.БюджетныеОперации.Очистить();
	ТабОперации=Объект.БюджетныеОперации.Выгрузить();
	
	Пока РезультатЗапроса.Следующий() Цикл
		
		ПолучитьДанныеПоСтатье(РезультатЗапроса,СписокЦФО,ТабОперации,НомерРасчета);
		
	КонецЦикла; 
	
КонецПроцедуры // ПолучитьФактическиеДанные()


&НаСервере
Процедура ПолучитьДанныеПоСтатье(Статья,СписокЦФО,ТабОперации,НомерРасчета)
	
	Если Статья.ИсточникДанных.Отключен Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "По статье "+ Строка(Статья.СтатьяОборотовПредставление) + " " + СокрЛП(Строка(Статья.СтатьяОборотов.Код))+ " источник данных отключен. ";
		Сообщение.ПутьКДанным = Статья.ИсточникДанных;
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;	
	// тут вместо построителя создаем схему компоновки данных
	СхемаКомпоновкиДанных = Статья.ИсточникДанных.СхемаИсточникаДанных.Получить();
	// для использования отбора из статьи оборотов 
	СохраненныеНастройкиКомпоновщика = Статья.СтатьяОборотов.КомпоновщикНастроек.Получить();
	
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	
	// параметры начало и конец периода
	ПараметрНачало = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("НачалоПериода");
	Если ПараметрНачало <> Неопределено Тогда
		ПараметрНачало.Значение = НачалоДня(Объект.ДатаНачала);
		ПараметрНачало.Использование=Истина;
	КонецЕсли;
	
	ПараметрКонец  = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("КонецПериода");
	Если ПараметрКонец <> Неопределено Тогда
		ПараметрКонец.Значение = КонецДня(Объект.ДатаКонца);
		ПараметрКонец.Использование=Истина;
	КонецЕсли;
	
	// получаем непосредственно данные из СКД
	// подготовим макет 
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	Макет = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.ПолучитьНастройки(),,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(Макет);
	ПроцессорКомпоновки.Сбросить();
	
	// выведем результат       
	ТабИсточника = Новый ТаблицаЗначений;
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(ТабИсточника);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Если ТабИсточника.Количество()=0 Тогда
		Если НомерРасчета = 2 Тогда
			Сообщить("Нет данных по статье "+ Строка(Статья.СтатьяОборотовПредставление) + " " + СокрЛП(Строка(Статья.СтатьяОборотов.Код)));
		КонецЕсли;               
		Возврат;
	КонецЕсли;
	
	Для каждого СтрокаИсточник Из ТабИсточника Цикл
		
		НоваяОперация=ТабОперации.Добавить();
		
		Для каждого Колонка Из ТабОперации.Колонки Цикл
			
			КолонкаИсточника = ТабИсточника.Колонки.Найти(Колонка.Имя);
			Если КолонкаИсточника <> Неопределено Тогда			
				НоваяОперация[Колонка.Имя] = СтрокаИсточник[Колонка.Имя];
			КонецЕсли;
			
		КонецЦикла;
		
		Если НЕ Статья.ПоказательИсточникаДанныхДляФактаКол="" Тогда
			
			Если НЕ СтрокаИсточник[Статья.ПоказательИсточникаДанныхДляФактаКол]=NULL Тогда 
				
				НоваяОперация.Количество=СтрокаИсточник[Статья.ПоказательИсточникаДанныхДляФактаКол]*Статья.КоэффициентДляФактаКол;
				
			Иначе
				
				НоваяОперация.Количество=0;
				
			КонецЕсли;
			
		Иначе
			
			НоваяОперация.Количество=0;
			
		КонецЕсли;
		
		Если НЕ Статья.ПоказательИсточникаДанныхДляФактаСум="" Тогда
			
			Если НЕ СтрокаИсточник[Статья.ПоказательИсточникаДанныхДляФактаСум]=NULL Тогда
				
				НоваяОперация.Сумма=СтрокаИсточник[Статья.ПоказательИсточникаДанныхДляФактаСум]*Статья.КоэффициентДляФактаСум;
				
			Иначе
				
				НоваяОперация.Сумма=0;
				
			КонецЕсли;
			
		Иначе
			
			НоваяОперация.Сумма=0;
			
		КонецЕсли;
		
		// КОНТРАГЕНТ
		Если Статья.РазделениеПоКонтрагентам и ЗначениеЗаполнено(Статья.ПоказательКонтрагнет) Тогда
				НоваяОперация.Контрагент=СтрокаИсточник[Статья.ПоказательКонтрагнет];
		Иначе	
				НоваяОперация.Контрагент="";
		КонецЕсли;
		
		// НОМЕНКЛАТУРА
		Если Статья.РазделениеПоНоменклатуре и ЗначениеЗаполнено(Статья.ПоказательНоменклатура) Тогда
				НоваяОперация.Номенклатура=СтрокаИсточник[Статья.ПоказательНоменклатура];
		Иначе	
				НоваяОперация.Номенклатура="";
		КонецЕсли;
		
		
	КонецЦикла; 
	
	// принудительно ставлю валюту из статьи
	ТабОперации.ЗаполнитьЗначения(Статья.ОсновнаяВалюта,"Валюта");
	
	ТабОперации.ЗаполнитьЗначения(Статья.СтатьяОборотов,"СтатьяОборотов");
	
	// Переносим сформированные операции в табличную часть
	Для каждого СтрокаОперации Из ТабОперации Цикл
		
		Если СтрокаОперации.Количество=0 И СтрокаОперации.Сумма=0 Тогда
			
			Продолжить;
			
		Иначе
			
			НоваяОперация=Объект.БюджетныеОперации.Добавить();
			НоваяОперация.Период=СтрокаОперации.Период;
			НоваяОперация.Валюта=СтрокаОперации.Валюта;
			НоваяОперация.СтатьяОборотов=СтрокаОперации.СтатьяОборотов;
			НоваяОперация.ЦФО=СтрокаОперации.ЦФО;
			НоваяОперация.Проект=СтрокаОперации.Проект;
			НоваяОперация.Контрагент=СтрокаОперации.Контрагент;
			НоваяОперация.Номенклатура=СтрокаОперации.Номенклатура;
			НоваяОперация.Количество=СтрокаОперации.Количество;
			НоваяОперация.Сумма=СтрокаОперации.Сумма;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ТабОперации.Очистить();
	
КонецПроцедуры // ПолучитьДанныеПоСтатье()


&НаКлиенте
Процедура ВыбратьПериод(Команда)
	Диалог = Новый ДиалогРедактированияСтандартногоПериода;
	Диалог.Период.ДатаНачала = Объект.ДатаНачала;
	Диалог.Период.ДатаОкончания = Объект.ДатаКонца;
	
	Если Диалог.Редактировать() Тогда
		Объект.ДатаНачала = Диалог.Период.ДатаНачала;
		Объект.ДатаКонца  = Диалог.Период.ДатаОкончания;
	КонецЕсли;
КонецПроцедуры

