
&НаКлиенте
Процедура ПроверитьПодключение(Команда)
	
	ИдентификаторДействия = "Справочник.SDL_НастройкиФортМонитор.ПроверитьПодключение";
	уатРаботаСРасширениямиКлиент.ПСМ_ВыполнитьДействияВФорме(ИдентификаторДействия, 
			уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Объект.СистемаМониторинга, "НаименованиеПС"),
			Объект.УчетнаяЗапись,
			ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ИнтервалЗагрузкиПредставлениеПриИзменении(Элемент)
	
	Объект.ИнтервалЗагрузки = Число(ИнтервалЗагрузкиПредставление);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокИнтервалов = Элементы.ИнтервалЗагрузкиПредставление.СписокВыбора;
//	ИнтервалЗагрузкиПредставление = СписокИнтервалов.НайтиПоЗначению(Формат(Объект.ИнтервалЗагрузки, "ЧГ=0"));
	ИнтервалЗагрузкиПредставление = Формат(Объект.ИнтервалЗагрузки, "ЧГ=0");
	
КонецПроцедуры

&НаКлиенте
Процедура SDL_ПересчетОдометраПоПробегуНаВозвратПриИзменении(Элемент)
	
	Если Объект.SDL_ПересчетОдометраПоПробегуНаВозврат И Объект.SDL_ПересчетПробегаПоОдометруНаВозврат Тогда
		 Объект.SDL_ПересчетПробегаПоОдометруНаВозврат = Ложь;
	 КонецЕсли;
	 
КонецПроцедуры

&НаКлиенте
Процедура SDL_ПересчетПробегаПоОдометруНаВозвратПриИзменении(Элемент)

	Если Объект.SDL_ПересчетПробегаПоОдометруНаВозврат И  Объект.SDL_ПересчетОдометраПоПробегуНаВозврат Тогда
	   Объект.SDL_ПересчетОдометраПоПробегуНаВозврат = Ложь;
   КонецЕсли;
   
КонецПроцедуры
