
&Вместо("уатВидыПЛ")
Функция ЮЦ_уатВидыПЛ()
	
	мСписокВидовПЛ = Новый СписокЗначений;
	мСписокВидовПЛ.Добавить(Перечисления.уатВидыПЛ._3,НСтр("ru='3 (легковой)';en='NTRS'"));
	мСписокВидовПЛ.Добавить(Перечисления.уатВидыПЛ._3спец,НСтр("ru='3С (спец. автомобиля)';en='NTRS'"));
	мСписокВидовПЛ.Добавить(Перечисления.уатВидыПЛ._4М,НСтр("ru='4М (междугородний)';en='NTRS'"));
	мСписокВидовПЛ.Добавить(Перечисления.уатВидыПЛ._4П,НСтр("ru='4П (повременный)';en='NTRS'"));
	мСписокВидовПЛ.Добавить(Перечисления.уатВидыПЛ._4С,НСтр("ru='4С (сдельный)';en='NTRS'"));
	мСписокВидовПЛ.Добавить(Перечисления.уатВидыПЛ._6С,НСтр("ru='6С (автобус необщего пользования)';en='NTRS'"));
	мСписокВидовПЛ.Добавить(Перечисления.уатВидыПЛ._ЭСМ2,НСтр("ru='ЭСМ2 (строительный)';en='NTRS'"));
	мСписокВидовПЛ.Добавить(Перечисления.уатВидыПЛ._ПЛ1,НСтр("ru='ПЛ1 (легковой ЧП)';en='NTRS'"));
	мСписокВидовПЛ.Добавить(Перечисления.уатВидыПЛ._ПГ1,НСтр("ru='ПГ1 (грузовой ЧП)';en='NTRS'"));
	мСписокВидовПЛ.Добавить(Перечисления.уатВидыПЛ._ПА1,НСтр("ru='ПА1 (автобус ЧП)';en='NTRS'"));
	
	мСписокВидовПЛ.Добавить(Перечисления.уатВидыПЛ._6,"6 (автобус городской)"); //Ширшов городские перевозки

	Если уатОбщегоНазначенияПовтИсп.ВариантПоставкиКОРП() ИЛИ уатОбщегоНазначенияПовтИсп.ВариантПоставкиПРОФ() Тогда
		МодульЗащищенныеФункцииСерверПроф = ОбщегоНазначения.ОбщийМодуль("уатЗащищенныеФункцииСервер_проф");
		МодульЗащищенныеФункцииСерверПроф.ДобавитьВидыПЛСТ(мСписокВидовПЛ);
		МодульЗащищенныеФункцииСерверПроф.ДобавитьВидыПЛПП(мСписокВидовПЛ);
	КонецЕсли;	
		
	мСписокВидовПЛ.СортироватьПоПредставлению();
	
	Возврат мСписокВидовПЛ;

КонецФункции

&Вместо("КонтактнаяИнформацияОбъектовНаДату")
Функция ЮЦ_КонтактнаяИнформацияОбъектовНаДату(МассивОбъектов, ТипыКИ, ВидыКИ, Дата)
	Если Дата = Неопределено Тогда
		Дата = ТекущаяДатаСеанса();
	КонецЕсли;
	
	СвязанныеАдресаДляИстории = СвязанныеАдресаДляПолученияИсторическихЗначений();
	
	ВидыКИДляЗапроса = МассивВидовКонтактнойИнформацииДляЗапроса(ВидыКИ, СвязанныеАдресаДляИстории);
	
	КонтактнаяИнформация = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъектов(
		МассивОбъектов,
		ТипыКИ,
		ВидыКИДляЗапроса, Дата);
	
	ЗначенияИсторииКонтактнойИнформации = ЗначенияИсторииКонтактнойИнформацииОбъектов(МассивОбъектов, ВидыКИДляЗапроса, Дата);
	
	// Если для адреса есть связанный адрес (см. СвязанныеАдресаДляПолученияИсторическихЗначений()),
	// то нужно заменить его значение на историческое значение связанного адреса,
	// если текущее значение адреса совпадает с текущим значением связанного адреса.
	// Например, в форме редактирования Организации можно указать, что фактический адрес совпадает с юридическим.
	// Для фактического адреса история не ведется, поэтому, если актуальные значения фактического и юридического адреса совпадают,
	// то в качестве значения фактического адреса на дату нужно использовать значение юридического адреса на дату.
	ЗаменитьЗначенияДляСвязанныхАдресовНаИсторические(КонтактнаяИнформация, ЗначенияИсторииКонтактнойИнформации, СвязанныеАдресаДляИстории);
	
	// Для всех адресов теперь нужно заменить значение на историческое, если оно есть.
	// Заменять в предыдущем цикле нельзя, т.к. важно сохранить актуальное значение связанного адреса.
	ЗаменитьЗначенияКонтактнойИнформацииНаИсторические(КонтактнаяИнформация, ЗначенияИсторииКонтактнойИнформации);
	
	// Поле Значение может быть не заполнено, если адрес не редактировался в БСП 3.0.1.
	// В этом случае нужно заполнить его из поля ЗначенияПолей.
	ЗаполнитьПолеЗначениеЕслиПустое(КонтактнаяИнформация);
	
	// Т.к. мы дополнили виды контактной информации связанными адресами, а их могло не быть
	// в списке требуемых видов КИ, то нам нужно их удалить из результата.
	ЗапрашиваемыеВидыКИ = МассивВидовКонтактнойИнформации(ВидыКИ);
	ОставитьТолькоЗапрашиваемыеВидыКонтактнойИнформации(КонтактнаяИнформация, ЗапрашиваемыеВидыКИ);
	
	Возврат КонтактнаяИнформация;
	

КонецФункции
