Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = Новый Структура;
	МассивНазначений = Новый Массив;
	
	ПараметрыРегистрации.Вставить("Вид", "ДополнительныйОтчет");
	ПараметрыРегистрации.Вставить("Назначение", МассивНазначений);
	ПараметрыРегистрации.Вставить("Наименование", "Тестовый отчёт по оборотам бюджета"); 
	ПараметрыРегистрации.Вставить("Версия", "1.0");
	ПараметрыРегистрации.Вставить("БезопасныйРежим", Истина);
	ПараметрыРегистрации.Вставить("Информация", "Дополнительный отчет");
	
	ТаблицаКоманд = ПолучитьТаблицуКоманд();
	
	ДобавитьКоманду(ТаблицаКоманд, "Тестовый отчёт по оборотам бюджета", "Тестовый отчёт по оборотам бюджета", "ОткрытиеФормы", Истина);
	
	ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);
	
	Возврат ПараметрыРегистрации;
КонецФункции

Функция ПолучитьТаблицуКоманд()
	
	Команды = Новый ТаблицаЗначений;
	Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
	Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
	Возврат Команды;
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
	
	НоваяКоманда = ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление = Представление;
	НоваяКоманда.Идентификатор = Идентификатор;
	НоваяКоманда.Использование = Использование;
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
	НоваяКоманда.Модификатор = Модификатор;
КонецПроцедуры

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ДокументРезультат.АвтоМасштаб = Истина;
	
	СтандартнаяОбработка = Ложь;
	
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	ТипГенератора = Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений");
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки,,,ТипГенератора);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	
	тзРезультат =  Новый ТаблицаЗначений;
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	
	ПроцессорВывода.УстановитьОбъект(тзРезультат);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);   
	
	Макет = ПолучитьМакет("Макет");
	
	ОбластьШапка 	= Макет.ПолучитьОбласть("Шапка");
	ОбластьСтатья	= Макет.ПолучитьОбласть("грСтатья");
	ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");
	//ОбластьДетальныхЗаписей1 = Макет.ПолучитьОбласть("Детали");
	//ОбластьДетальныхЗаписей2 = Макет.ПолучитьОбласть("Детали");
	//ОбластьДетальныхЗаписей3 = Макет.ПолучитьОбласть("Детали");
	//ОбластьДетальныхЗаписей4 = Макет.ПолучитьОбласть("Детали");
	//ОбластьДетальныхЗаписей5 = Макет.ПолучитьОбласть("Детали");
	//ОбластьДетальныхЗаписей6 = Макет.ПолучитьОбласть("Детали");

	ДокументРезультат.НачатьАвтогруппировкуСтрок();
	ДокументРезультат.Вывести(ОбластьШапка);
	
	Для Каждого Стр Из тзРезультат Цикл
		Если Стр.Период = Неопределено Тогда //гр. Статья оборотов
			
			ДокументРезультат.Присоединить(ОбластьДетальныхЗаписей);
			Для к = 1 По 31 Цикл
				ОбластьДетальныхЗаписей.Параметры["П" + Строка(к)] = 0;
				ОбластьДетальныхЗаписей.Параметры["Ф" + Строка(к)] = 0;
				ОбластьДетальныхЗаписей.Параметры["О" + Строка(к)] = 0;
			КонецЦикла;
			
			ОбластьДетальныхЗаписей.Параметры.Ед 		= Стр.Единица;
			ОбластьДетальныхЗаписей.Параметры.Статья 	= Стр.Наименование;
			ОбластьДетальныхЗаписей.Параметры.ПИтог 	= Стр.СуммаСценария;
			ОбластьДетальныхЗаписей.Параметры.ФИтог 	= Стр.Количество;
			ОбластьДетальныхЗаписей.Параметры.ОИтог 	= Стр.СуммаСценария - Стр.Количество;
			Продолжить;
		КонецЕсли;
		НомерДня = День(Стр.Период); 
		
		ОбластьДетальныхЗаписей.Параметры.Ед 					  = Стр.Единица;
		ОбластьДетальныхЗаписей.Параметры["П" + Строка(НомерДня)] = Стр.СуммаСценария;
		ОбластьДетальныхЗаписей.Параметры["Ф" + Строка(НомерДня)] = Стр.Количество;
		ОбластьДетальныхЗаписей.Параметры["О" + Строка(НомерДня)] = Стр.СуммаСценария - Стр.Количество;
		
	КонецЦикла;	
	
	ДокументРезультат.ЗакончитьАвтогруппировкуСтрок();
	
КонецПроцедуры