
&Вместо("СформироватьТаблицаИзносПробегШин")
Процедура ЮЦ_СформироватьТаблицаИзносПробегШин(ДокументСсылка, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Выработка.Ссылка.ДатаЗакрытия КАК Период,
	|	Выработка.Ссылка.Организация КАК Организация,
	|	Выработка.ПараметрВыработки КАК ПараметрВыработки,
	|	Выработка.ТС КАК ТС,
	|	СУММА(Выработка.Количество) КАК Пробег,
	|	УстановленныеШины.СерияНоменклатуры КАК СерияНоменклатуры,
	|	СУММА(уатМоделиШин.НормаЗатрат * УстановленныеШины.СерияНоменклатуры.ПервоначальнаяСтоимость / 100 * Выработка.Количество / 1000) КАК Износ
	|ИЗ
	|	Документ.уатПутевойЛист.ВыработкаТС КАК Выработка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			уатАгрегатыТССрезПоследних.Период КАК Период,
	|			уатАгрегатыТССрезПоследних.Регистратор КАК Регистратор,
	|			уатАгрегатыТССрезПоследних.СерияНоменклатуры КАК СерияНоменклатуры,
	|			уатАгрегатыТССрезПоследних.ТС КАК ТС,
	|			уатАгрегатыТССрезПоследних.МестоУстановки КАК МестоУстановки,
	|			уатАгрегатыТССрезПоследних.СостояниеАгрегата КАК СостояниеАгрегата
	|		ИЗ
	|			РегистрСведений.уатАгрегатыТС.СрезПоследних(&Дата, ) КАК уатАгрегатыТССрезПоследних
	|		ГДЕ
	|			уатАгрегатыТССрезПоследних.СостояниеАгрегата В(&СостояниеАгрегата)
	|			И уатАгрегатыТССрезПоследних.ТС В(&ВСоставе)
	|			И уатАгрегатыТССрезПоследних.СерияНоменклатуры.ТипАгрегата = &ТипАгрегата) КАК УстановленныеШины
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.уатМоделиАгрегатов КАК уатМоделиШин
	|			ПО УстановленныеШины.СерияНоменклатуры.Модель = уатМоделиШин.Ссылка
	|		ПО Выработка.ТС = УстановленныеШины.ТС
	|ГДЕ
	|	Выработка.ПараметрВыработки = &ПараметрВыработки
	|	И Выработка.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Выработка.Ссылка.ДатаЗакрытия,
	|	Выработка.Ссылка.Организация,
	|	Выработка.ПараметрВыработки,
	|	Выработка.ТС,
	|	УстановленныеШины.СерияНоменклатуры";
	Запрос.УстановитьПараметр("Дата", Новый Граница(ДокументСсылка.ДатаЗакрытия, ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("ВСоставе", ДокументСсылка.ВыработкаТС.ВыгрузитьКолонку("ТС"));
	СписокСостоянийАгрегата = Новый СписокЗначений();
	СписокСостоянийАгрегата.Добавить(Перечисления.уатСостоянияАгрегатов.УстановленоВРаботе);
	Если уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(ДокументСсылка.Организация, ПланыВидовХарактеристик.уатПраваИНастройки.НачислятьИзносНаЗапаску) Тогда
		СписокСостоянийАгрегата.Добавить(Перечисления.уатСостоянияАгрегатов.УстановленоВЗапас);
	КонецЕсли;
	Запрос.УстановитьПараметр("СостояниеАгрегата", СписокСостоянийАгрегата);
	Запрос.УстановитьПараметр("СостояниеСнято", Перечисления.уатСостоянияАгрегатов.Снято);
	Запрос.УстановитьПараметр("ТипАгрегата", Справочники.уатТипыАгрегатов.Шина);
	Если ДокументСсылка.ТранспортноеСредство.Модель.НаличиеСпидометра Тогда //ЮЦАУ
		Запрос.УстановитьПараметр("ПараметрВыработки", Справочники.уатПараметрыВыработки.ПробегОбщий);
	Иначе
		Запрос.УстановитьПараметр("ПараметрВыработки", Справочники.уатПараметрыВыработки.ВремяВРаботе);
	КонецЕсли;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	мТаблицаУстановленныхШин = Запрос.Выполнить().Выгрузить();
	Если НЕ ДокументСсылка.ТранспортноеСредство.Модель.НаличиеСпидометра Тогда //ЮЦАУ
		Для Каждого Стр Из мТаблицаУстановленныхШин Цикл  
			Стр.Пробег = уатОбщегоНазначения.уатВремяВЧЧ_ММ(Стр.Пробег);
		КонецЦикла;
	КонецЕсли;
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаИзносаПробегаШин", мТаблицаУстановленныхШин);
	
КонецПроцедуры // СформироватьТаблицаИзносПробегШин()

&Вместо("уатПечать_6")
Функция ЮЦ_уатПечать_6(ТекущийДокумент, ИмяМакета, ФлагПечати)
		ТабДокумент = Новый ТабличныйДокумент;
	Если ИмяМакета <> "ПФ_MXL_6_пп" тогда
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.уатПутевойЛист." + ИмяМакета);
иначе
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.уатПутевойЛист.ЮЦ_Макет_Путь");
	конецЕсли;
	
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПутевойЛист_6";
	
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДокумент.РазмерСтраницы = "A4";
	ТабДокумент.АвтоМасштаб = Истина;
	
	ТабДокумент.ПолеСверху 	= 0;
	ТабДокумент.ПолеСлева 	= 0;
	ТабДокумент.ПолеСнизу 	= 0;
	ТабДокумент.ПолеСправа 	= 0;
	
	// лицевая сторона
	Если ФлагПечати <> 2 И ФлагПечати <> 3 Тогда
		
		Обл = Макет.ПолучитьОбласть("Лицевая");

		// номера и дата приказа Минтранса РФ
	    ЗаполнитьЗначенияСвойств(Обл.Параметры, ПолучитьПараметрыПриказаМинтранса(ТекущийДокумент.Дата));
		
		// реквизиты шапки
	    ЗаполнитьЗначенияСвойств(Обл.Параметры, ПолучитьПараметрыШапкиДляПечати(ТекущийДокумент, ФлагПечати));

		// ТС 
	    ЗаполнитьЗначенияСвойств(Обл.Параметры, ПолучитьПараметрыТСДляПечати(ТекущийДокумент.ТранспортноеСредство));

		// водитель 1
	    ЗаполнитьЗначенияСвойств(Обл.Параметры, ПолучитьПараметрыВодителяДляПечати(ТекущийДокумент.Водитель1, 1, 
			ТекущийДокумент.Дата, ТекущийДокумент.Организация, Ложь));
		
		// водитель 2
	    ЗаполнитьЗначенияСвойств(Обл.Параметры, ПолучитьПараметрыВодителяДляПечати(ТекущийДокумент.Водитель2, 2, 
			ТекущийДокумент.Дата, ТекущийДокумент.Организация, Ложь));
		
		// подписи ответственных лиц
	    ЗаполнитьЗначенияСвойств(Обл.Параметры, ЮЦ_ПолучитьОтветственныхДляПечати(ТекущийДокумент));

		// медосмотр
	    //ЗаполнитьЗначенияСвойств(Обл.Параметры, ПолучитьПараметрыМедосмотраДляПечати(ТекущийДокумент));
		
		ДокОбъект = ТекущийДокумент.ПолучитьОбъект();
		//уатПутевыеЛисты.РасчитатьВременныеПараметры(ДокОбъект);
		ДокОбъект.РасчитатьВременныеПараметры();      
		
		//Обл.Параметры.КоличествоЧасовРаботы = Формат(уатОбщегоНазначения.уатВремяВЧЧ_ММ(ДокОбъект.мВремяВНаряде),"ЧДЦ=2; ЧРД=:");
		//Обл.Параметры.КоличествоЧасовПробег = Формат(уатОбщегоНазначения.уатВремяВЧЧ_ММ(ДокОбъект.мВремяВРаботе), "ЧДЦ=2; ЧРД=:");
		//Обл.Параметры.КоличествоЧасовНочное = Формат(уатОбщегоНазначения.уатВремяВЧЧ_ММ(ДокОбъект.мВремяНочь), "ЧДЦ=2; ЧРД=:");
		
		ПробегОбщий = 0;
		ПробегСПассажирами = 0;
		Для Каждого ТекСтрока Из ТекущийДокумент.Задание Цикл
			Если ТекСтрока.Выполнено Тогда 	
				ПробегОбщий = ПробегОбщий + (ТекСтрока.КоличествоКмГруз + ТекСтрока.КоличествоКмПорожний) * ТекСтрока.КоличествоЕздок;
				ПробегСПассажирами = ПробегСПассажирами + ТекСтрока.КоличествоКмГруз * ТекСтрока.КоличествоЕздок;
				Обл.Параметры.КоличествоПробегОбщий = Формат(ПробегОбщий, "ЧЦ=15; ЧДЦ=3");
				Обл.Параметры.КоличествоПробегСПассажирами = Формат(ПробегСПассажирами, "ЧЦ=15; ЧДЦ=3");
			КонецЕсли;
		КонецЦикла;
		
		// ГСМ
	    ЗаполнитьЗначенияСвойств(Обл.Параметры, ПолучитьПараметрыГСМДляПечати(ТекущийДокумент, ФлагПечати));
		
		// задание водителю        
		мМаксСтрок = 2;
		Для Каждого ТекСтрока Из ТекущийДокумент.Задание Цикл

			ТекИндекс = ТекущийДокумент.Задание.Индекс(ТекСтрока) + 1;
			Если ТекИндекс > мМаксСтрок Тогда
				Прервать;
			КонецЕсли;
			
			ПараметрНаименованиеМаршрута = "НаименованиеМаршрута" + Строка(ТекИндекс);
	   		Обл.Параметры[ПараметрНаименованиеМаршрута] = ТекСтрока.Маршрут.Наименование;
			
			ПараметрНомерМаршрута = "НомерМаршрута" + Строка(ТекИндекс);
			НомерВыезда = ?(ЗначениеЗаполнено(ТекСтрока.Выезд),"   ("+ТекСтрока.Выезд+")","");
			Обл.Параметры[ПараметрНомерМаршрута] = ТекСтрока.Маршрут.НомерМаршрута + НомерВыезда;

		КонецЦикла;

		//Если ТекущийДокумент.Задание.Количество() > 0 Тогда
		//	Обл.Параметры.НаименованиеМаршрута1 = ТекущийДокумент.Задание[0].Маршрут.Наименование;
		//	//Обл.Параметры.НомерМаршрута = ТекущийДокумент.Задание[0].Маршрут.НомерМаршрута;
		//	НомерВыезда1 = ?(ЗначениеЗаполнено(ТекущийДокумент.Задание[0].Выезд)," ("+ТекущийДокумент.Задание[0].Выезд+")","");
		//	Обл.Параметры.НомерМаршрута1 = ТекущийДокумент.Задание[0].Маршрут.НомерМаршрута + НомерВыезда1;
		//КонецЕсли;
		
		мМаксСтрок = 2;
		Для Каждого ТекСтрока Из ТекущийДокумент.Задание Цикл

			ТекИндекс = ТекущийДокумент.Задание.Индекс(ТекСтрока) + 1;
			Если ТекИндекс > мМаксСтрок Тогда
				Прервать;
			КонецЕсли;
			
//			ПараметрЗаказчик = "Заказчик" + Строка(ТекИндекс);
//	   		Обл.Параметры[ПараметрЗаказчик] = ТекСтрока.Контрагент.Наименование;
			
		КонецЦикла;
		
		ТабДокумент.Вывести(Обл);
		
	КонецЕсли;
	
	// новая страница для печати полного путевого листа
	Если ФлагПечати = 0 Или ФлагПечати = 4 Тогда	
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЕсли;
	
	// оборотная сторона
	Если ФлагПечати <> 1 И ФлагПечати <> 5 Тогда
		
		мМаксСтрок = 40;

		Обл = Макет.ПолучитьОбласть("Оборотная");
		//мВыводитьПунктОтправленияВПечатнойФорме6_пп = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(ТекущийДокумент.Организация, ПланыВидовХарактеристик.уатПраваИНастройки.ВыводитьПунктОтправленияВПечатнойФорме6);
		мВыводитьПунктОтправленияВПечатнойФорме6_пп = Ложь;
		Для Каждого ТекСтрока Из ТекущийДокумент.Задание Цикл
			
			Прервать; // Оборотная сторона п/л не выводится
			
			ТекИндекс = ТекущийДокумент.Задание.Индекс(ТекСтрока) + 1;
			Если ТекИндекс > мМаксСтрок Тогда
				Прервать;
			КонецЕсли;
			
			стрОбласть = "М" + Строка(ТекИндекс);
			Если мВыводитьПунктОтправленияВПечатнойФорме6_пп Тогда
				//Обл.Область(стрОбласть).Текст = уатОбщегоНазначения.ПолучитьАдресСтрокой(ТекСтрока.АдресПрибытия);                                                         
				Обл.Область(стрОбласть).Текст = ПредставлениеАдреса(ТекСтрока.АдресПрибытия);                                                         
			Иначе
				Обл.Область(стрОбласть).Текст = ТекСтрока.Маршрут.Наименование;
			КонецЕсли;
			стрОбласть = "ВОП" + Строка(ТекИндекс);
			Обл.Область(стрОбласть).Текст = Формат(ТекСтрока.ВремяПрибытия, "ДФ = ЧЧ:мм");
			стрОбласть = "ВПП" + Строка(ТекИндекс);
			Обл.Область(стрОбласть).Текст = Формат(ТекСтрока.ВремяУбытия, "ДФ = ЧЧ:мм"); 
			стрОбласть = "ПСП" + Строка(ТекИндекс);
			Обл.Область(стрОбласть).Текст = Формат(ТекСтрока.КоличествоКмГруз, "ЧЦ=15; ЧДЦ=3");
			
		КонецЦикла;
		
		ТабДокумент.Вывести(Обл);    
		
	КонецЕсли;
	
	Возврат ТабДокумент;

КонецФункции

//Функция возвращает адрес строкой для печати
//
Функция ПредставлениеАдреса(ВхАдрес)
	Если ТипЗнч(ВхАдрес) = Тип("Строка") Тогда
		Рез = ВхАдрес;
	ИначеЕсли ТипЗнч(ВхАдрес) = Тип("СправочникСсылка.уатПунктыНазначения") Тогда
		Если ПустаяСтрока(ВхАдрес.Адрес) Тогда
			Рез = ВхАдрес.Наименование;
		Иначе
			Рез = ВхАдрес.Адрес;
		КонецЕсли;
	Иначе
		Рез = "";
	КонецЕсли;
	
	Возврат Рез;
КонецФункции

// Процедура пересекает исходный интервал таблицей интервалов.
//При этом исходный интервал может изменяться: вырезаться начало/конец/середина интервала, либо полностью замещаться
//
Процедура ПересечениеИнтервалов(ИсходныйИнтервал, тблПересечения, тблРабочееВремя, флОбед = Ложь)
	Для Каждого ТекПересечение Из тблПересечения Цикл
		Если НЕ ЗначениеЗаполнено(ТекПересечение.Начало) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТекПересечение.Начало >= ИсходныйИнтервал.Начало И ТекПересечение.Начало <= ИсходныйИнтервал.Конец
			И ТекПересечение.Конец >= ИсходныйИнтервал.Конец Тогда //интервал пересечения срезает конец рабочего интервала
			ИсходныйИнтервал.Конец = ТекПересечение.Начало;
			ИсходныйИнтервал.Продолжительность = ИсходныйИнтервал.Конец - ИсходныйИнтервал.Начало;
		ИначеЕсли ТекПересечение.Начало <= ИсходныйИнтервал.Начало И ТекПересечение.Конец <= ИсходныйИнтервал.Конец
			И ТекПересечение.Конец >= ИсходныйИнтервал.Начало Тогда //интервал пересечения срезает начало рабочего интервала
			ИсходныйИнтервал.Начало = ТекПересечение.Конец;
			ИсходныйИнтервал.Продолжительность = ИсходныйИнтервал.Конец - ИсходныйИнтервал.Начало;
		ИначеЕсли ИсходныйИнтервал.Начало >= ТекПересечение.Начало И ИсходныйИнтервал.Конец <= ТекПересечение.Конец Тогда //рабочий интервал внутри интервала пересечения
			ИсходныйИнтервал.Начало = Неопределено;
			ИсходныйИнтервал.Конец = Неопределено;
			ИсходныйИнтервал.Продолжительность = 0;
		ИначеЕсли ИсходныйИнтервал.Начало <= ТекПересечение.Начало И ИсходныйИнтервал.Конец >= ТекПересечение.Конец Тогда //интервал пересечения внутри рабочего интервала
			КонецИсхВрем = ИсходныйИнтервал.Конец;
			ИсходныйИнтервал.Конец = ТекПересечение.Начало;
			ИсходныйИнтервал.Продолжительность = ИсходныйИнтервал.Конец - ИсходныйИнтервал.Начало;
			НовыйРабИнтервал = тблРабочееВремя.Добавить();
			Если НЕ флОбед Тогда
				НовыйРабИнтервал.ВидВремени = ИсходныйИнтервал.ВидВремени;
			КонецЕсли;
			НовыйРабИнтервал.Начало = ТекПересечение.Конец;
			НовыйРабИнтервал.Конец = КонецИсхВрем;
			НовыйРабИнтервал.Продолжительность = НовыйРабИнтервал.Конец - НовыйРабИнтервал.Начало;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Функция рассчитывает время в работе за указанный день
// Возвращает значение в секундах
Функция СтруктураВремениЗаДень(ДатаВыезда, ДатаВозвращения, НомерДня, РежимРаботыТС, Простои, Знач ПродолжительностьРабочегоДня, Знач ПродолжительностьОбеда, ВремяДоОбеда) Экспорт
	флРежимРаботыНочной = (РежимРаботыТС.НачалоРаботы > РежимРаботыТС.КонецРаботы);
	флОднодневныйПЛ = (ДатаВозвращения - ДатаВыезда) <= 86400;
	флОднодневныйНочнойПЛ = флОднодневныйПЛ И НачалоДня(ДатаВыезда) <> НачалоДня(ДатаВозвращения);
	КоличествоДней = (НачалоДня(ДатаВозвращения) - НачалоДня(ДатаВыезда))/86400 + 1;
	
	Если ЗначениеЗаполнено(РежимРаботыТС) Тогда
		Если флРежимРаботыНочной Тогда
			ПродолжительностьРабочегоДня = 86400 - (РежимРаботыТС.НачалоРаботы - РежимРаботыТС.КонецРаботы);
		Иначе
			ПродолжительностьРабочегоДня = РежимРаботыТС.КонецРаботы - РежимРаботыТС.НачалоРаботы;
		КонецЕсли;
		Если ЗначениеЗаполнено(РежимРаботыТС.Обед) Тогда //заполнена продолжительность обеда
			ПродолжительностьОбеда = РежимРаботыТС.Обед - '00010101';
		ИначеЕсли РежимРаботыТС.НачалоОбеда > РежимРаботыТС.КонецОбеда Тогда //это ночной обед
			ПродолжительностьОбеда = (РежимРаботыТС.КонецОбеда + 86400) - РежимРаботыТС.НачалоОбеда;
		Иначе //типичный дневной обед
			ПродолжительностьОбеда = РежимРаботыТС.КонецОбеда - РежимРаботыТС.НачалоОбеда;
		КонецЕсли;
	КонецЕсли;
	
	ТекДата = НачалоДня(ДатаВыезда) + 86400*(НомерДня-1);
	
	//простои
	тблПростои = РасчетПростоевНаДень(ТекДата, Простои);
	
	//обеденные часы с вытеснением простоями
	НачалоРабочегоИнтервала = Макс(ДатаВыезда, НачалоДня(ТекДата));
	тблОбеды = РасчетОбедовНаДень(ТекДата, РежимРаботыТС, ПродолжительностьОбеда, ВремяДоОбеда, тблПростои, ДатаВыезда, ДатаВозвращения, флОднодневныйНочнойПЛ);
	
	тблРабочееВремя = Новый ТаблицаЗначений;
	тблРабочееВремя.Колонки.Добавить("ВидВремени");
	тблРабочееВремя.Колонки.Добавить("Начало");
	тблРабочееВремя.Колонки.Добавить("Конец");
	тблРабочееВремя.Колонки.Добавить("Продолжительность");
	
	Если флОднодневныйПЛ И НЕ флОднодневныйНочнойПЛ Тогда //однодневные дневные
		//рабочий интервал
		Если ДатаВозвращения >= НачалоДня(ДатаВозвращения) + 6*3600 И ДатаВыезда <= НачалоДня(ДатаВыезда) + 22*3600 Тогда
			НоваяСтрока = тблРабочееВремя.Добавить();
			НоваяСтрока.ВидВремени = "Работа";
			НоваяСтрока.Начало = ДатаВыезда;
			НоваяСтрока.Конец = ДатаВозвращения;
			НоваяСтрока.Продолжительность = НоваяСтрока.Конец - НоваяСтрока.Начало;
		КонецЕсли;
		
		//часть ночного интервала от 0:00 до 6:00 в день выезда
		Если ДатаВыезда < НачалоДня(ДатаВыезда) + 6*3600 Тогда
			НоваяСтрока = тблРабочееВремя.Добавить();
			НоваяСтрока.ВидВремени = "Ночные";
			НоваяСтрока.Начало = ДатаВыезда;
			НоваяСтрока.Конец = Мин(ДатаВозвращения, НачалоДня(ДатаВыезда) + 6*3600);
			НоваяСтрока.Продолжительность = НоваяСтрока.Конец - НоваяСтрока.Начало;
		КонецЕсли;
		//часть ночного интервала от 22:00 до 0:00 в день возврата
		Если ДатаВозвращения > НачалоДня(ДатаВозвращения) + 22*3600 Тогда
			НоваяСтрока = тблРабочееВремя.Добавить();
			НоваяСтрока.ВидВремени = "Ночные";
			НоваяСтрока.Начало = НачалоДня(ДатаВозвращения) + 22*3600;
			НоваяСтрока.Конец = ДатаВозвращения;
			НоваяСтрока.Продолжительность = НоваяСтрока.Конец - НоваяСтрока.Начало;
		КонецЕсли;
		//для ночного ПЛ - часть ночного интервала от 22:00 до 6:00 в ночь между выездом и возвратом
		Если флОднодневныйНочнойПЛ Тогда
			НоваяСтрока = тблРабочееВремя.Добавить();
			НоваяСтрока.ВидВремени = "Ночные";
			НоваяСтрока.Начало = Макс(ДатаВыезда, НачалоДня(ДатаВыезда) + 22*3600);
			НоваяСтрока.Конец = Мин(ДатаВозвращения, НачалоДня(ДатаВозвращения) + 6*3600);
			НоваяСтрока.Продолжительность = НоваяСтрока.Конец - НоваяСтрока.Начало;
		КонецЕсли;
		
	Иначе //многодневные и однодневные ночные
		Если НомерДня = 1 Тогда //первый день, считаем рабочее время без учета режима работы ТС
			//рабочий интервал
			НоваяСтрока = тблРабочееВремя.Добавить();
			НоваяСтрока.ВидВремени = "Работа";
			НоваяСтрока.Начало = ДатаВыезда;
			Если ДатаВыезда - НачалоДня(ДатаВыезда) + ПродолжительностьРабочегоДня > 86400 Тогда // продолжительность рабочего времени по настройкам меньше промежутка от выезда до конца дня
				НоваяСтрока.Конец = КонецДня(ДатаВыезда)+1;
				НоваяСтрока.Продолжительность = НоваяСтрока.Конец - НоваяСтрока.Начало;
			Иначе
				НоваяСтрока.Продолжительность = ПродолжительностьРабочегоДня;
				НоваяСтрока.Конец = НоваяСтрока.Начало + НоваяСтрока.Продолжительность;
			КонецЕсли;
			КонецРаботы = НоваяСтрока.Конец;
			
			//часть ночного интервала от 0:00
			Если ДатаВыезда < НачалоДня(ДатаВыезда) + 6*3600 Тогда
				НоваяСтрока = тблРабочееВремя.Добавить();
				НоваяСтрока.ВидВремени = "Ночные";
				НоваяСтрока.Начало = ДатаВыезда;
				НоваяСтрока.Конец = НачалоДня(ДатаВыезда) + 6*3600;
				НоваяСтрока.Продолжительность = НоваяСтрока.Конец - НоваяСтрока.Начало;
			КонецЕсли;
			
			//часть ночного интервала до 0:00
			Если ДатаВыезда + ПродолжительностьРабочегоДня > НачалоДня(ДатаВыезда) + 22*3600 Тогда
				НоваяСтрока = тблРабочееВремя.Добавить();
				НоваяСтрока.ВидВремени = "Ночные";
				НоваяСтрока.Начало = Макс(ДатаВыезда, НачалоДня(ДатаВыезда) + 22*3600);
				НоваяСтрока.Конец = Мин(ДатаВыезда + ПродолжительностьРабочегоДня, КонецДня(ДатаВыезда)+1);
				НоваяСтрока.Продолжительность = НоваяСтрока.Конец - НоваяСтрока.Начало;
			КонецЕсли;
			
		ИначеЕсли НомерДня = КоличествоДней Тогда //последний день, считаем рабочее время без учета режима работы ТС
			//рабочий интервал
			НоваяСтрока = тблРабочееВремя.Добавить();
			НоваяСтрока.ВидВремени = "Работа";
			НоваяСтрока.Конец = ДатаВозвращения;
			Если ДатаВозвращения - НачалоДня(ДатаВозвращения) < ПродолжительностьРабочегоДня Тогда // продолжительность рабочего времени по настройкам меньше промежутка от начала дня возвращения до времени возвращения
				НоваяСтрока.Начало = НачалоДня(ДатаВозвращения);
				НоваяСтрока.Продолжительность = ДатаВозвращения - НачалоДня(ДатаВозвращения);
			Иначе
				НоваяСтрока.Продолжительность = ПродолжительностьРабочегоДня;
				НоваяСтрока.Начало = НоваяСтрока.Конец - ПродолжительностьРабочегоДня;
			КонецЕсли;
			
			//часть ночного интервала от 0:00
			Если ДатаВозвращения - ПродолжительностьРабочегоДня < НачалоДня(ДатаВозвращения) + 6*3600 Тогда
				НоваяСтрока = тблРабочееВремя.Добавить();
				НоваяСтрока.ВидВремени = "Ночные";
				НоваяСтрока.Начало = Макс(ДатаВозвращения - ПродолжительностьРабочегоДня, НачалоДня(ДатаВозвращения));
				НоваяСтрока.Конец = Мин(НачалоДня(ДатаВозвращения) + 6*3600, ДатаВозвращения);
				НоваяСтрока.Продолжительность = НоваяСтрока.Конец - НоваяСтрока.Начало;
			КонецЕсли;
			
			//часть ночного интервала до 0:00
			Если ДатаВозвращения > НачалоДня(ДатаВозвращения) + 22*3600 Тогда
				НоваяСтрока = тблРабочееВремя.Добавить();
				НоваяСтрока.ВидВремени = "Ночные";
				НоваяСтрока.Начало = НачалоДня(ДатаВозвращения) + 22*3600;
				НоваяСтрока.Конец = ДатаВозвращения;
				НоваяСтрока.Продолжительность = НоваяСтрока.Конец - НоваяСтрока.Начало;
			КонецЕсли;
			
		Иначе //промежуточные дни
			Если ЗначениеЗаполнено(РежимРаботыТС) Тогда //режим работы указан
				Если флРежимРаботыНочной Тогда
					//часть рабочего интервала от 0:00
					НоваяСтрока = тблРабочееВремя.Добавить();
					НоваяСтрока.ВидВремени = "Работа";
					НоваяСтрока.Начало = НачалоДня(ТекДата);
					НоваяСтрока.Конец = НачалоДня(ТекДата) + (РежимРаботыТС.КонецРаботы - '00010101');
					НоваяСтрока.Продолжительность = НоваяСтрока.Конец - НоваяСтрока.Начало;
					
					//часть рабочего интервала до 0:00
					НоваяСтрока = тблРабочееВремя.Добавить();
					НоваяСтрока.ВидВремени = "Работа";
					НоваяСтрока.Начало = НачалоДня(ТекДата) + (РежимРаботыТС.НачалоРаботы - '00010101');
					НоваяСтрока.Конец = КонецДня(ТекДата) + 1;
					НоваяСтрока.Продолжительность = НоваяСтрока.Конец - НоваяСтрока.Начало;
					
					//часть ночного интервала от 0:00
					НоваяСтрока = тблРабочееВремя.Добавить();
					НоваяСтрока.ВидВремени = "Ночные";
					НоваяСтрока.Начало = НачалоДня(ТекДата);
					Если (РежимРаботыТС.КонецРаботы - '00010101') >= 6*3600 Тогда //конец интервала по режиму больше 6:00
						НоваяСтрока.Продолжительность = 6*3600;
					Иначе //конец интервала по режиму меньше 6:00
						НоваяСтрока.Продолжительность = (РежимРаботыТС.КонецРаботы - '00010101');
					КонецЕсли;
					НоваяСтрока.Конец = НоваяСтрока.Начало + НоваяСтрока.Продолжительность;
					
					//часть ночного интервала до 0:00
					НоваяСтрока = тблРабочееВремя.Добавить();
					НоваяСтрока.ВидВремени = "Ночные";
					НоваяСтрока.Конец = КонецДня(ТекДата) + 1;
					Если (РежимРаботыТС.НачалоРаботы - '00010101') <= 22*3600 Тогда //начало интервала по режиму меньше 22:00
						НоваяСтрока.Продолжительность = 2*3600;
					Иначе //начало интервала по режиму больше 22:00
						НоваяСтрока.Продолжительность = 24*3600 - (РежимРаботыТС.НачалоРаботы - '00010101');
					КонецЕсли;
					НоваяСтрока.Начало = НоваяСтрока.Конец - НоваяСтрока.Продолжительность;
					
				Иначе
					//рабочий интервал
					НоваяСтрока = тблРабочееВремя.Добавить();
					НоваяСтрока.ВидВремени = "Работа";
					НоваяСтрока.Начало = НачалоДня(ТекДата) + (РежимРаботыТС.НачалоРаботы - '00010101');
					НоваяСтрока.Конец = НачалоДня(ТекДата) + (РежимРаботыТС.КонецРаботы - '00010101');
					НоваяСтрока.Продолжительность = НоваяСтрока.Конец - НоваяСтрока.Начало;
					
					//часть ночного интервала от 0:00
					Если (РежимРаботыТС.НачалоРаботы - '00010101') < 6*3600 Тогда
						НоваяСтрока = тблРабочееВремя.Добавить();
						НоваяСтрока.ВидВремени = "Ночные";
						НоваяСтрока.Начало = НачалоДня(ТекДата);
						НоваяСтрока.Продолжительность = 6*3600 - (РежимРаботыТС.НачалоРаботы - '00010101');
						НоваяСтрока.Конец = НоваяСтрока.Начало + НоваяСтрока.Продолжительность;
					КонецЕсли;
					
					//часть ночного интервала до 0:00
					Если (РежимРаботыТС.КонецРаботы - '00010101') > 22*3600 Тогда
						НоваяСтрока = тблРабочееВремя.Добавить();
						НоваяСтрока.ВидВремени = "Ночные";
						НоваяСтрока.Начало = НачалоДня(ТекДата) + 22*3600;
						НоваяСтрока.Конец = НачалоДня(ТекДата) + (РежимРаботыТС.КонецРаботы - '00010101');
						НоваяСтрока.Продолжительность = НоваяСтрока.Конец - НоваяСтрока.Начало;
					КонецЕсли;
				КонецЕсли;
			Иначе
				//рабочий интервал
				//!Внимание! ночной интервал для промежуточных дней для неуказанного режима работы не заполняем
				//если продолжительность раб. дня захватывает ночные (больше 16), то заполняем
				Если ПродолжительностьРабочегоДня > 57600 Тогда
					НоваяСтрока = тблРабочееВремя.Добавить();
					НоваяСтрока.ВидВремени = "Работа";
					НоваяСтрока.Продолжительность = 57600;
					//НоваяСтрока.Начало = НачалоДня(ТекДата) + 6*3600;
					//НоваяСтрока.Конец = НачалоДня(ТекДата) + 22*3600;
					НоваяСтрока = тблРабочееВремя.Добавить();
					НоваяСтрока.ВидВремени = "Ночные";
					НоваяСтрока.Продолжительность = ПродолжительностьРабочегоДня - 57600;
				Иначе
					НоваяСтрока = тблРабочееВремя.Добавить();
					НоваяСтрока.ВидВремени = "Работа";
					НоваяСтрока.Продолжительность = ПродолжительностьРабочегоДня;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	//исключаем из всего рабочего времени ночные - получаем дневное время
	тблНочные = тблРабочееВремя.Скопировать();
	мсвСтрокиУдалить = Новый Массив;
	Для Каждого ТекСтрока Из тблНочные Цикл
		Если ТекСтрока.ВидВремени <> "Ночные" Тогда
			мсвСтрокиУдалить.Добавить(ТекСтрока);
		КонецЕсли;
	КонецЦикла;
	Для Каждого ТекСтрокаУдалить Из мсвСтрокиУдалить Цикл
		тблНочные.Удалить(ТекСтрокаУдалить);
	КонецЦикла;
	Для Каждого ТекСтрокаРабочееВремя Из тблРабочееВремя Цикл
		Если НЕ ЗначениеЗаполнено(ТекСтрокаРабочееВремя.Начало) Тогда //промежуточный день многодневного ПЛ, считаем что ночное время заведомо не входит в дневное
			Продолжить;
		КонецЕсли;
		
		Если ТекСтрокаРабочееВремя.ВидВремени = "Работа" Тогда
			ПересечениеИнтервалов(ТекСтрокаРабочееВремя, тблНочные, тблРабочееВремя);
		КонецЕсли;
	КонецЦикла;
	//удаляем строки с нулевой продолжительностью
	мсвСтрокиУдалить = Новый Массив;
	Для Каждого ТекСтрока Из тблНочные Цикл
		Если ТекСтрока.Продолжительность = 0 Тогда
			мсвСтрокиУдалить.Добавить(ТекСтрока);
		КонецЕсли;
	КонецЦикла;
	Для Каждого ТекСтрокаУдалить Из мсвСтрокиУдалить Цикл
		тблНочные.Удалить(ТекСтрокаУдалить);
	КонецЦикла;
	мсвСтрокиУдалить = Новый Массив;
	Для Каждого ТекСтрока Из тблРабочееВремя Цикл
		Если ТекСтрока.Продолжительность = 0 Тогда
			мсвСтрокиУдалить.Добавить(ТекСтрока);
		КонецЕсли;
	КонецЦикла;
	Для Каждого ТекСтрокаУдалить Из мсвСтрокиУдалить Цикл
		тблРабочееВремя.Удалить(ТекСтрокаУдалить);
	КонецЦикла;
		
	//исключение обеда и простоев из дневного и ночного времени
	Для Каждого ТекСтрокаРабочееВремя Из тблРабочееВремя Цикл
		Если НЕ ЗначениеЗаполнено(ТекСтрокаРабочееВремя.Начало) Тогда //промежуточный день многодневного ПЛ, считаем что простой/обеда полностью входят в рабочий интервал
			Продолжить;
		КонецЕсли;
		
		ПересечениеИнтервалов(ТекСтрокаРабочееВремя, тблПростои, тблРабочееВремя);
		ПересечениеИнтервалов(ТекСтрокаРабочееВремя, тблОбеды, тблРабочееВремя);
	КонецЦикла;
	//удаляем строки с нулевой продолжительностью
	мсвСтрокиУдалить = Новый Массив;
	Для Каждого ТекСтрока Из тблНочные Цикл
		Если ТекСтрока.Продолжительность = 0 Тогда
			мсвСтрокиУдалить.Добавить(ТекСтрока);
		КонецЕсли;
	КонецЦикла;
	Для Каждого ТекСтрокаУдалить Из мсвСтрокиУдалить Цикл
		тблНочные.Удалить(ТекСтрокаУдалить);
	КонецЦикла;
	
	//пересчет итоговой продолжительности
	ВремяДневное = 0;
	ВремяНочное = 0;
	Для Каждого ТекСтрока Из тблРабочееВремя Цикл
		Если ТекСтрока.ВидВремени = "Работа" Тогда
			ВремяДневное = ВремяДневное + ТекСтрока.Продолжительность;
		ИначеЕсли ТекСтрока.ВидВремени = "Ночные" Тогда
			ВремяНочное = ВремяНочное + ТекСтрока.Продолжительность;
		КонецЕсли;
	КонецЦикла;
	ВремяПростои = тблПростои.Итог("Продолжительность");
	
	//доп. обработка
	Если тблРабочееВремя.Количество() > 0 Тогда
		Если НЕ ЗначениеЗаполнено(тблРабочееВремя[0].Начало) Тогда //промежуточный день многодневного ПЛ, считаем что простой/обед полностью входят в рабочий интервал
			Если ВремяДневное + ВремяНочное > ВремяДоОбеда Тогда
				Если флРежимРаботыНочной Тогда
					ВремяНочное = ВремяНочное - тблОбеды.Итог("Продолжительность");
				Иначе
					ВремяДневное = ВремяДневное - тблОбеды.Итог("Продолжительность");
				КонецЕсли;
			КонецЕсли;
			ВремяДневное = ВремяДневное - ВремяПростои;
		ИначеЕсли НЕ ЗначениеЗаполнено(РежимРаботыТС) ИЛИ РежимРаботыТС.Обед <> '00010101' Тогда //рабочий интервал указан, но не известен интервал обеда (не известна продолжительность) - тогда нужно убрать продолжительность обеда
			Если ВремяДневное + ВремяНочное > ВремяДоОбеда Тогда
				Для Каждого ТекОбед Из тблОбеды Цикл
					Если ТекОбед.Начало = Неопределено Тогда
						Если ВремяДневное > ВремяДоОбеда Тогда
							ВремяДневное = ВремяДневное - Мин(ТекОбед.Продолжительность, ВремяДневное-ВремяДоОбеда);
						ИначеЕсли ВремяНочное > ВремяДоОбеда Тогда
							ВремяНочное = ВремяНочное - Мин(ТекОбед.Продолжительность, ВремяНочное-ВремяДоОбеда);
						Иначе
							ВремяДневное = ВремяДневное - Мин(ТекОбед.Продолжительность, ВремяДневное-ВремяДоОбеда);
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Новый Структура("Работа, Дневные, Ночные, Простой", ВремяДневное + ВремяНочное, ВремяДневное, ВремяНочное, ВремяПростои);
КонецФункции	

// Функция рассчитывает обеденное время для ПЛ с указанным режимом работы ТС
// Учитывает пересечение с простоями - интервалы обеда замещаются пересекающимися простоями
// Возвращает таблицу интервалов простоев и продолжительность в секундах
//
Функция РасчетОбедовНаДень(ТекДата, РежимРаботы, ПродолжительностьОбеда, ВремяДоОбеда, Простои, ДатаВыезда, ДатаВозвращения, флОднодневныйНочнойПЛ) Экспорт
	тблРез = Новый ТаблицаЗначений;
	тблРез.Колонки.Добавить("Начало");
	тблРез.Колонки.Добавить("Конец");
	тблРез.Колонки.Добавить("Продолжительность");
	
	Если ЗначениеЗаполнено(РежимРаботы) Тогда
		Если ЗначениеЗаполнено(РежимРаботы.Обед) Тогда // указана продолжительность обеда, интервал не заполнен
			НоваяСтрока = тблРез.Добавить();
			НоваяСтрока.Продолжительность = РежимРаботы.Обед - '00010101';
			Если ДатаВозвращения - ДатаВыезда <= 86400 Тогда //однодневный ПЛ
				НоваяСтрока.Начало = ДатаВыезда + ВремяДоОбеда;
				НоваяСтрока.Конец = НоваяСтрока.Начало + НоваяСтрока.Продолжительность;
			Иначе
				Если НачалоДня(ТекДата) = НачалоДня(ДатаВыезда) Тогда //многодневный ПЛ - первый день
					НоваяСтрока.Начало = ДатаВыезда + ВремяДоОбеда;
					НоваяСтрока.Конец = НоваяСтрока.Начало + НоваяСтрока.Продолжительность;
				Иначе //многодневный ПЛ - второй и последующие дни
					НоваяСтрока.Начало = НачалоДня(ТекДата) + (РежимРаботы.НачалоРаботы - '00010101') + ВремяДоОбеда;
					Если НачалоДня(НоваяСтрока.Начало) > НачалоДня(ТекДата) Тогда //ночной режим
						НоваяСтрока.Начало = НоваяСтрока.Начало - 86400;
					КонецЕсли;
					НоваяСтрока.Конец = НоваяСтрока.Начало + НоваяСтрока.Продолжительность;
				КонецЕсли;
			КонецЕсли;
			
		Иначе // продолжительность обеда не заполнена - берем интервал, продолжительность рассчитываем
			Если РежимРаботы.НачалоОбеда <= РежимРаботы.КонецОбеда Тогда //дневной обед
				НоваяСтрока = тблРез.Добавить();
				НоваяСтрока.Начало = НачалоДня(ТекДата) + (РежимРаботы.НачалоОбеда - '00010101');
				НоваяСтрока.Конец = НачалоДня(ТекДата) + (РежимРаботы.КонецОбеда - '00010101');
				НоваяСтрока.Продолжительность = НоваяСтрока.Конец - НоваяСтрока.Начало;
			Иначе //ночной обед
				//часть ночного обеда до 0:00
				НоваяСтрока = тблРез.Добавить();
				НоваяСтрока.Начало = НачалоДня(ТекДата) + (РежимРаботы.НачалоОбеда - '00010101');
				НоваяСтрока.Конец = КонецДня(ТекДата)+1;
				НоваяСтрока.Продолжительность = НоваяСтрока.Конец - НоваяСтрока.Начало;
				//часть ночного обеда с 0:00
				Если РежимРаботы.КонецОбеда <> '00010101' Тогда
					НоваяСтрока = тблРез.Добавить();
					НоваяСтрока.Начало = НачалоДня(ТекДата);
					НоваяСтрока.Конец = НачалоДня(ТекДата) + (РежимРаботы.КонецОбеда - '00010101');
					НоваяСтрока.Продолжительность = НоваяСтрока.Конец - НоваяСтрока.Начало;
				КонецЕсли;
			КонецЕсли;
			
			//простои вытесняют обед
			Для Каждого СтруктураОбед Из тблРез Цикл
				Если СтруктураОбед.Начало = Неопределено Тогда //обед задан только продолжительностью - вытеснить не можем, не известен интервал обеда
					Продолжить;
				КонецЕсли;
				
				ПересечениеИнтервалов(СтруктураОбед, Простои, тблРез, Истина);
			КонецЦикла;
		КонецЕсли;
			
	Иначе //режим работы не указан, расчет ведем по ВремяДоОбеда и ПродолжительностьОбеда
		Если (ДатаВозвращения - ДатаВыезда) <= 86400 Тогда //однодневный ПЛ
			Если НачалоДня(ТекДата) = НачалоДня(ДатаВыезда) Тогда //дневной и первый день ночного ПЛ
				ОтВыездаДоПолуночи = (КонецДня(ДатаВыезда) + 1) - ДатаВыезда;
				Если ОтВыездаДоПолуночи > ВремяДоОбеда Тогда
					НоваяСтрока = тблРез.Добавить();
					НоваяСтрока.Начало = ДатаВыезда + ВремяДоОбеда;
					НоваяСтрока.Продолжительность = Мин(ПродолжительностьОбеда, ОтВыездаДоПолуночи - ВремяДоОбеда);
					НоваяСтрока.Конец = НоваяСтрока.Начало + НоваяСтрока.Продолжительность;
				КонецЕсли;
			ИначеЕсли НачалоДня(ТекДата) = НачалоДня(ДатаВозвращения) Тогда //второй день ночного ПЛ
				ОтПолуночиДоВозврата = ДатаВозвращения - НачалоДня(ДатаВозвращения);
				Если ОтПолуночиДоВозврата > ВремяДоОбеда Тогда
					НоваяСтрока = тблРез.Добавить();
					НоваяСтрока.Начало = НачалоДня(ДатаВозвращения) + ВремяДоОбеда;
					НоваяСтрока.Продолжительность = Мин(ПродолжительностьОбеда, ОтПолуночиДоВозврата - ВремяДоОбеда);
					НоваяСтрока.Конец = НоваяСтрока.Начало + НоваяСтрока.Продолжительность;
				КонецЕсли;
			КонецЕсли;
		Иначе //многодневный ПЛ
			НоваяСтрока = тблРез.Добавить();
			НоваяСтрока.Начало = Неопределено;
			НоваяСтрока.Конец = Неопределено;
			НоваяСтрока.Продолжительность = ПродолжительностьОбеда;
		КонецЕсли;
		
	КонецЕсли;
	
	//удаление обедов с нулевой продолжительностью
	мсвСтрокиУдалить = тблРез.НайтиСтроки(Новый Структура("Продолжительность", 0));
	Для Каждого СтрокаУдалить Из мсвСтрокиУдалить Цикл
		тблРез.Удалить(СтрокаУдалить);
	КонецЦикла;
	
	////для однодневного ночного нужно найти обеды и на следующий день, поскольку эта функция для однодневных всегда вызывается один раз
	//Если флОднодневныйНочнойПЛ Тогда
	//	тблСледДень = РасчетОбедовНаДень(ТекДата + 86400, РежимРаботы, ПродолжительностьОбеда, ВремяДоОбеда, Простои, ДатаВыезда, ДатаВозвращения, Ложь);
	//	Для Каждого ТекОбед Из тблСледДень Цикл
	//		НовыйОбед = тблРез.Добавить();
	//		ЗаполнитьЗначенияСвойств(НовыйОбед, ТекОбед);
	//	КонецЦикла;
	//	
	//	//лишние обеды удаляем
	//	мсвСтрокиУдалить = Новый Массив;
	//	Для Каждого ТекОбед Из тблРез Цикл
	//		Если ТекОбед.Начало < ДатаВыезда ИЛИ ТекОбед.Конец > ДатаВозвращения Тогда
	//			мсвСтрокиУдалить.Добавить(ТекОбед);
	//		КонецЕсли;
	//	КонецЦикла;
	//	Для Каждого СтрокаУдалить Из мсвСтрокиУдалить Цикл
	//		тблРез.Удалить(СтрокаУдалить);
	//	КонецЦикла;
	//КонецЕсли;
	
	Возврат тблРез;
КонецФункции //РасчетОбедовНаДень()

// Функция расчета времени простоев по заданному дню
// Возвращает таблицу интервалов простоев и продолжительность в секундах
//
Функция РасчетПростоевНаДень(ТекДата, Простои) Экспорт
	тблРез = Новый ТаблицаЗначений;
	тблРез.Колонки.Добавить("Начало");
	тблРез.Колонки.Добавить("Конец");
	тблРез.Колонки.Добавить("Продолжительность");
	
	Для Каждого ТекСтрока Из Простои Цикл
		Если НачалоДня(ТекДата) <> НачалоДня(ТекСтрока.НачалоПростоя) Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = тблРез.Добавить();
		НоваяСтрока.Начало = НачалоДня(ТекДата) + (ТекСтрока.НачалоПростоя - НачалоДня(ТекСтрока.НачалоПростоя));
		НоваяСтрока.Продолжительность = Текстрока.ВремяПростоя - НачалоДня(Текстрока.ВремяПростоя);
		НоваяСтрока.Конец = НоваяСтрока.Начало + НоваяСтрока.Продолжительность;
	КонецЦикла;
	
	Возврат тблРез;
КонецФункции	

// Функция расчета времени по документу
//Возвращает таблицу с колонками:
//	- ВидВремени - Строка - возможные значения: Работа, Ночные, Простой
//  - ДатаРаботы - Дата работ
//  - Продолжительность - время работ в секундах
//Внимание! Время в работе (вид Работа) = Время дневное + Время ночное (вид Ночные)
//
Функция РасчетВремени(ДатаВыезда, ДатаВозвращения, Организация, РежимРаботыТС, Простои) Экспорт
	//переводим время из формата Дата в количество секунд
	мВремяДоОбеда = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(Организация, "ВремяДоОбеда") - '00010101';
	мПродолжительностьОбеда = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(Организация, "ПродолжительностьОбеда") - '00010101';
	мПродолжительностьРабочегоДня = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(Организация, "ПродолжительностьРабочегоДня") - '00010101';
	Если мПродолжительностьРабочегоДня = 0 Тогда
		мПродолжительностьРабочегоДня = 86400;
	КонецЕсли;
	
	резТаблица = Новый ТаблицаЗначений;
	резТаблица.Колонки.Добавить("ВидВремени");
	резТаблица.Колонки.Добавить("ДатаРаботы");
	резТаблица.Колонки.Добавить("Продолжительность");
	
	ТекДата = НачалоДня(ДатаВыезда);
	Сч = 1;
	Пока ТекДата <= НачалоДня(ДатаВозвращения) Цикл
		СтруктураВремениЗаДень = СтруктураВремениЗаДень(ДатаВыезда, ДатаВозвращения, Сч, РежимРаботыТС, Простои, мПродолжительностьРабочегоДня, мПродолжительностьОбеда, мВремяДоОбеда);
		
		Для Каждого ТекВидВремени Из СтруктураВремениЗаДень Цикл
			Если ТекВидВремени.Значение > 0 Тогда
				НоваяСтрока = резТаблица.Добавить();
				Если ТекВидВремени.Ключ = "Дневные" Тогда
					НоваяСтрока.ВидВремени = "Дневные";
				Иначе
					НоваяСтрока.ВидВремени = Справочники.уатВидыИспользованияРабочегоВремени[ТекВидВремени.Ключ];
				КонецЕсли;
				НоваяСтрока.ДатаРаботы = ТекДата;
				НоваяСтрока.Продолжительность = СтруктураВремениЗаДень[ТекВидВремени.Ключ];
			КонецЕсли;
		КонецЦикла;
		
		ТекДата = ТекДата + 86400;
		Сч = Сч + 1;
		
		////выходим, если ПЛ однодневный
		//Если (ДатаВозвращения - ДатаВыезда) <= 86400 Тогда
		//	Прервать;
		//КонецЕсли;
	КонецЦикла;
	
	Возврат резТаблица;
КонецФункции

Функция ЮЦ_ПолучитьОтветственныхДляПечати(ТекущийДокумент)

	ВыдалДиспетчер  = Справочники.Сотрудники.ПустаяСсылка();
	ПринялДиспетчер = Справочники.Сотрудники.ПустаяСсылка();
	Водитель1       = Справочники.Сотрудники.ПустаяСсылка();
	ВыпустилМеханик = Справочники.Сотрудники.ПустаяСсылка();
	ПринялМеханик   = Справочники.Сотрудники.ПустаяСсылка();
	ОсмотрелВрач        = Справочники.Сотрудники.ПустаяСсылка();
	ОсмотрелВрачВозврат = Справочники.Сотрудники.ПустаяСсылка();
	УполномоченныйНаПроставлениеОдометраПриВыезде   = Справочники.Сотрудники.ПустаяСсылка();
	УполномоченныйНаПроставлениеОдометраПриВозврате = Справочники.Сотрудники.ПустаяСсылка();

	Если ТипЗнч(ТекущийДокумент.ВыдалДиспетчер) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		ВыдалДиспетчер      = ТекущийДокумент.ВыдалДиспетчер;
	ИначеЕсли ТипЗнч(ТекущийДокумент.ВыдалДиспетчер) = Тип("СправочникСсылка.Сотрудники") Тогда
		ВыдалДиспетчер      = ТекущийДокумент.ВыдалДиспетчер.ФизическоеЛицо;
	КонецЕсли;
	Если ТипЗнч(ТекущийДокумент.ПринялДиспетчер) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		ПринялДиспетчер     = ТекущийДокумент.ПринялДиспетчер;
	ИначеЕсли ТипЗнч(ТекущийДокумент.ПринялДиспетчер) = Тип("СправочникСсылка.Сотрудники") Тогда
		ПринялДиспетчер     = ТекущийДокумент.ПринялДиспетчер.ФизическоеЛицо;
	КонецЕсли;
	Если ТипЗнч(ТекущийДокумент.Водитель1) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		Водитель1           = ТекущийДокумент.Водитель1;
	ИначеЕсли ТипЗнч(ТекущийДокумент.Водитель1) = Тип("СправочникСсылка.Сотрудники") Тогда
		Водитель1           = ТекущийДокумент.Водитель1.ФизическоеЛицо;
	КонецЕсли; 
	Если ТипЗнч(ТекущийДокумент.ВыпустилМеханик) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		ВыпустилМеханик     = ТекущийДокумент.ВыпустилМеханик;
	ИначеЕсли ТипЗнч(ТекущийДокумент.ВыпустилМеханик) = Тип("СправочникСсылка.Сотрудники") Тогда
		ВыпустилМеханик     = ТекущийДокумент.ВыпустилМеханик.ФизическоеЛицо;
	КонецЕсли;
	Если ТипЗнч(ТекущийДокумент.ПринялМеханик) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		ПринялМеханик       = ТекущийДокумент.ПринялМеханик;
	ИначеЕсли ТипЗнч(ТекущийДокумент.ПринялМеханик) = Тип("СправочникСсылка.Сотрудники") Тогда
		ПринялМеханик       = ТекущийДокумент.ПринялМеханик.ФизическоеЛицо;
	КонецЕсли;
	Если ТипЗнч(ТекущийДокумент.МедработникВыезд) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		ОсмотрелВрач        = ТекущийДокумент.МедработникВыезд;
	ИначеЕсли ТипЗнч(ТекущийДокумент.МедработникВыезд) = Тип("СправочникСсылка.Сотрудники") Тогда
		ОсмотрелВрач        = ТекущийДокумент.МедработникВыезд.ФизическоеЛицо;
	КонецЕсли;
	Если ТипЗнч(ТекущийДокумент.МедработникВозврат) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		ОсмотрелВрачВозврат = ТекущийДокумент.МедработникВозврат;
	ИначеЕсли ТипЗнч(ТекущийДокумент.МедработникВозврат) = Тип("СправочникСсылка.Сотрудники") Тогда
		ОсмотрелВрачВозврат = ТекущийДокумент.МедработникВозврат.ФизическоеЛицо;
	КонецЕсли; 
	Если ТипЗнч(ТекущийДокумент.УполномоченныйНаПроставлениеОдометраПриВыезде) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		УполномоченныйНаПроставлениеОдометраПриВыезде = ТекущийДокумент.УполномоченныйНаПроставлениеОдометраПриВыезде;
	ИначеЕсли ТипЗнч(ТекущийДокумент.УполномоченныйНаПроставлениеОдометраПриВыезде) = Тип("СправочникСсылка.Сотрудники") Тогда
		УполномоченныйНаПроставлениеОдометраПриВыезде = ТекущийДокумент.УполномоченныйНаПроставлениеОдометраПриВыезде.ФизическоеЛицо;
	КонецЕсли;
	Если ТипЗнч(ТекущийДокумент.УполномоченныйНаПроставлениеОдометраПриВозврате) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		УполномоченныйНаПроставлениеОдометраПриВозврате = ТекущийДокумент.УполномоченныйНаПроставлениеОдометраПриВозврате;
	ИначеЕсли ТипЗнч(ТекущийДокумент.УполномоченныйНаПроставлениеОдометраПриВозврате) = Тип("СправочникСсылка.Сотрудники") Тогда
		УполномоченныйНаПроставлениеОдометраПриВозврате = ТекущийДокумент.УполномоченныйНаПроставлениеОдометраПриВозврате.ФизическоеЛицо;
	КонецЕсли;

	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("ВыдалДиспетчер", 
	уатОбщегоНазначенияТиповые.уатФамилияИнициалыФизЛица(ВыдалДиспетчер));
	СтруктураПараметров.Вставить("ПринялДиспетчер", 
	уатОбщегоНазначенияТиповые.уатФамилияИнициалыФизЛица(ПринялДиспетчер));
	СтруктураПараметров.Вставить("ВодительПринял", 
	уатОбщегоНазначенияТиповые.уатФамилияИнициалыФизЛица(Водитель1));
	СтруктураПараметров.Вставить("ВодительСдал", 
	уатОбщегоНазначенияТиповые.уатФамилияИнициалыФизЛица(Водитель1));
	СтруктураПараметров.Вставить("ВыпустилМеханик", 
	уатОбщегоНазначенияТиповые.уатФамилияИнициалыФизЛица(ВыпустилМеханик));
	СтруктураПараметров.Вставить("ПринялМеханик", 
	уатОбщегоНазначенияТиповые.уатФамилияИнициалыФизЛица(ПринялМеханик));
	СтруктураПараметров.Вставить("ОсмотрелВрач", 
	уатОбщегоНазначенияТиповые.уатФамилияИнициалыФизЛица(ОсмотрелВрач));
	СтруктураПараметров.Вставить("ОсмотрелВрачДолжность", 
	уатОбщегоНазначенияТиповые.ПолучитьДолжностьСотрудника(ТекущийДокумент.МедработникВыезд,,ТекущийДокумент.Медорганизация));
	СтруктураПараметров.Вставить("ОсмотрелВрачВозврат", 
	уатОбщегоНазначенияТиповые.уатФамилияИнициалыФизЛица(ОсмотрелВрачВозврат)); 
	СтруктураПараметров.Вставить("ОсмотрелВрачВозвратДолжность", 
	уатОбщегоНазначенияТиповые.ПолучитьДолжностьСотрудника(ТекущийДокумент.МедработникВозврат,,ТекущийДокумент.Медорганизация));	
	СтруктураПараметров.Вставить("УполномоченныйНаПроставлениеОдометраПриВыезде", 
	уатОбщегоНазначенияТиповые.уатФамилияИнициалыФизЛица(УполномоченныйНаПроставлениеОдометраПриВыезде));
	СтруктураПараметров.Вставить("УполномоченныйНаПроставлениеОдометраПриВозврате", 
	уатОбщегоНазначенияТиповые.уатФамилияИнициалыФизЛица(УполномоченныйНаПроставлениеОдометраПриВозврате));

	Возврат СтруктураПараметров;

КонецФункции

//&Вместо("уатПечать_4С")
//Функция ЮЦ_уатПечать_4С(ТекущийДокумент, ИмяМакета, ФлагПечати)
//	
//	Перем мВодительскоеУдСерия , мВодительскоеУдНомер , мВодительскоеУдКатегория;	
//	Перем мВодительскоеУдСерия2, мВодительскоеУдНомер2, мВодительскоеУдКатегория2;	
//	
//	мМаксСтрок = 5;
//	мМаксСтрокПростоя = 3;
//	мМаксСтрокПослЗаданий = 8;
//	
//	ТабДокумент = Новый ТабличныйДокумент;
//	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПутевойЛист_ПутевойЛист";
//	
//	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.уатПутевойЛист." + ИмяМакета);
//	
//	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
//	
//	ТабДокумент.ПолеСверху 	= 0;
//	ТабДокумент.ПолеСлева 	= 0;
//	ТабДокумент.ПолеСнизу 	= 0;
//	ТабДокумент.ПолеСправа 	= 0;
//	
//	//печатаем лицевую сторону п/л
//	Если ФлагПечати <> 2 И ФлагПечати <> 3 Тогда
//		Обл   = Макет.ПолучитьОбласть("Лицевая");
//		
//		мНомерПЛ = уатОбщегоНазначенияТиповые.уатПолучитьНомерНаПечать(ТекущийДокумент);
//		Обл.Параметры.Номер = мНомерПЛ;
//		ФорматДаты = "ДФ='дд ММММ гггг'";
//		Обл.Параметры.ДатаВыписки = Формат(ТекущийДокумент.Дата, ФорматДаты);
//		Обл.Параметры.ТекстДействителенДо = ?(ТекущийДокумент.ДействителенДо = '00010101', "", "Действителен по: " + Формат(ТекущийДокумент.ДействителенДо, ФорматДаты));
//		Обл.Параметры.Организация = уатОбщегоНазначенияТиповыеСервер.ОписаниеОрганизации(уатОбщегоНазначенияСервер.СведенияОЮрФизЛице(
//		ТекущийДокумент.Организация, ТекущийДокумент.ДатаЗакрытия), "ПолноеНаименование,ЮридическийАдрес,Телефоны") + " г. Ханты-Мансийск, ул. Студенческая, д. 8, тел. (34678) 35-69-22, ОГРН 1028600515327";
//		Обл.Параметры.КодПоОКПО = ТекущийДокумент.Организация.КодПоОКПО;
//		Обл.Параметры.МодельТС = уатОбщегоНазначения.уатПредставлениеМоделиТС(ТекущийДокумент.ТранспортноеСредство);
//		Обл.Параметры.ТипТС = ТекущийДокумент.ТранспортноеСредство.ТипТС;
//		Обл.Параметры.ТранспортноеСредствоГосНомер = ТекущийДокумент.ТранспортноеСредство.ГосударственныйНомер;
//		Обл.Параметры.ТранспортноеСредствоГарНомер = ТекущийДокумент.ТранспортноеСредство.ГаражныйНомер;
//		Обл.Параметры.РежимРаботы = ТекущийДокумент.РежимРаботыТС;
//		Если ТекущийДокумент.ТранспортноеСредство.Колонна <> Неопределено Тогда
//			Обл.Параметры.Колонна = ТекущийДокумент.ТранспортноеСредство.Колонна;
//		КонецЕсли;	
//		
//		Если ТекущийДокумент.ВидПЛ = Перечисления.уатВидыПЛ._4П Тогда
//			Обл.Параметры.НомерПЛВТалоне = мНомерПЛ;
//			Обл.Параметры.ДатаПЛВТалоне = Формат(ТекущийДокумент.Дата, ФорматДаты);
//		КонецЕсли;	
//		
//		мРеквизитыВодителя1 = уатОбщегоНазначения.уатПрочитатьРеквизитыВодителя(ТекущийДокумент.Водитель1, ТекущийДокумент.Дата,, ТекущийДокумент.Организация);
//		Обл.Параметры.Водитель1 = уатОбщегоНазначения.уатФИОСотрудникаПолноеСтрокой(ТекущийДокумент.Водитель1, ТекущийДокумент.Дата);
//		Обл.Параметры.Водитель1Расшифровка = ТекущийДокумент.Водитель1;
//		Обл.Параметры.ВодительКод1 = мРеквизитыВодителя1.ТабельныйНомер;
//		Если НЕ ТекущийДокумент.Водитель2.Пустая() Тогда
//			мРеквизитыВодителя2 = уатОбщегоНазначения.уатПрочитатьРеквизитыВодителя(ТекущийДокумент.Водитель2, ТекущийДокумент.Дата,, ТекущийДокумент.Организация);
//			Обл.Параметры.Водитель2 = уатОбщегоНазначения.уатФИОСотрудникаПолноеСтрокой(ТекущийДокумент.Водитель2, ТекущийДокумент.Дата);
//			Обл.Параметры.Водитель2Расшифровка = ТекущийДокумент.Водитель2;
//			Обл.Параметры.ВодительКод2 = мРеквизитыВодителя2.ТабельныйНомер;
//		КонецЕсли;	
//		
//		Если мРеквизитыВодителя1 <> Неопределено Тогда
//			Обл.Параметры.КлассВодителя = мРеквизитыВодителя1.Класс;
//		КонецЕсли;
//		
//		уатОбщегоНазначения.уатУдостоверениеВодителя(ТекущийДокумент.Водитель1, мВодительскоеУдСерия, мВодительскоеУдНомер, мВодительскоеУдКатегория);
//		Обл.Параметры.НомерУдостоверенияВодителя = ?(СокрЛП(мВодительскоеУдСерия)="","",СокрЛП(мВодительскоеУдСерия) + " ") + мВодительскоеУдНомер;
//		
//		уатОбщегоНазначения.уатУдостоверениеВодителя(ТекущийДокумент.Водитель2, мВодительскоеУдСерия2, мВодительскоеУдНомер2, мВодительскоеУдКатегория2);
//		УдостоверениеВторогоВодителя = ?(СокрЛП(мВодительскоеУдСерия2)="","",СокрЛП(мВодительскоеУдСерия2) + " ") + мВодительскоеУдНомер2;
//		Если СокрЛП(УдостоверениеВторогоВодителя) <> "" Тогда
//			Обл.Параметры.НомерУдостоверенияВодителя = ?(СокрЛП(Обл.Параметры.НомерУдостоверенияВодителя)="",
//			УдостоверениеВторогоВодителя, Обл.Параметры.НомерУдостоверенияВодителя + ", " + УдостоверениеВторогоВодителя);
//		КонецЕсли;
//		
//		Обл.Параметры.ЛицензионнаяКарточка = ТекущийДокумент.ТранспортноеСредство.ЛицензионнаяКарточка;
//		Обл.Параметры.НомерЛицензионнойКарточки = ТекущийДокумент.ТранспортноеСредство.НомерЛицензионнойКарточки;
//		Обл.Параметры.СерияЛицензионнойКарточки = ТекущийДокумент.ТранспортноеСредство.СерияЛицензионнойКарточки;
//		Обл.Параметры.НомерСерииЛицензионнойКарточки = ТекущийДокумент.ТранспортноеСредство.НомерСерииЛицензионнойКарточки;
//		
//		СопровождающиеЛица = уатОбщегоНазначения.уатФИОСотрудникаПолноеСтрокой(ТекущийДокумент.Сотрудник1, ТекущийДокумент.Дата);
//		Если ЗначениеЗаполнено(ТекущийДокумент.Сотрудник2) Тогда
//			Обл.Параметры.СопровождающиеЛица = СокрЛП(СопровождающиеЛица) +  ", " + уатОбщегоНазначения.уатФИОСотрудникаПолноеСтрокой(ТекущийДокумент.Сотрудник2, ТекущийДокумент.Дата);
//		Иначе
//			Обл.Параметры.СопровождающиеЛица = СопровождающиеЛица;
//		КонецЕсли;			
//		
//		мТекИнд = 0;
//		Для мИнд = 1 по ТекущийДокумент.Прицепы.Количество() Цикл
//			мПрицеп = ТекущийДокумент.Прицепы[мИнд-1].ТС;
//			Если мПрицеп.Модель.ВидМоделиТС = Перечисления.уатВидыМоделейТС.Прицеп Тогда
//				мТекИнд = мТекИнд + 1;
//				Если мТекИнд = 1 Тогда
//					Обл.Параметры.ПрицепМодель1  = уатОбщегоНазначения.уатПредставлениеМоделиТС(мПрицеп);
//					Попытка
//						Обл.Параметры.ПрицепГосНомер1  = мПрицеп.ГосударственныйНомер;
//						Обл.Параметры.ПрицепГарНомер1  = мПрицеп.ГаражныйНомер;
//					Исключение
//					КонецПопытки;	
//				ИначеЕсли мТекИнд = 2 Тогда
//					Обл.Параметры.ПрицепМодель2  = уатОбщегоНазначения.уатПредставлениеМоделиТС(мПрицеп);
//					Попытка
//						Обл.Параметры.ПрицепГосНомер2  = мПрицеп.ГосударственныйНомер;
//						Обл.Параметры.ПрицепГарНомер2  = мПрицеп.ГаражныйНомер;
//					Исключение
//					КонецПопытки;	
//				ИначеЕсли мТекИнд = 3 Тогда
//					Обл.Параметры.ПрицепМодель3  = уатОбщегоНазначения.уатПредставлениеМоделиТС(мПрицеп);
//					Попытка
//						Обл.Параметры.ПрицепГосНомер3  = мПрицеп.ГосударственныйНомер;
//						Обл.Параметры.ПрицепГарНомер3  = мПрицеп.ГаражныйНомер;
//					Исключение
//					КонецПопытки;	
//				ИначеЕсли мТекИнд = 4 Тогда
//					Обл.Параметры.ПрицепМодель4  = уатОбщегоНазначения.уатПредставлениеМоделиТС(мПрицеп);
//					Попытка
//						Обл.Параметры.ПрицепГосНомер4  = мПрицеп.ГосударственныйНомер;
//						Обл.Параметры.ПрицепГарНомер4  = мПрицеп.ГаражныйНомер;
//					Исключение
//					КонецПопытки;	
//				КонецЕсли;	
//			КонецЕсли;	
//		КонецЦикла;	
//		
//		Обл.Параметры.ДатаВыезда_ДД = Формат(ТекущийДокумент.ДатаВыезда,"ДФ=дд");
//		Обл.Параметры.ДатаВыезда_ММММ = Формат(ТекущийДокумент.ДатаВыезда,"ДФ=ММ");
//		Обл.Параметры.ВремяВыезда_ЧЧ = Формат(ТекущийДокумент.ДатаВыезда,"ДФ=ЧЧ");
//		Обл.Параметры.ВремяВыезда_ММ = Формат(ТекущийДокумент.ДатаВыезда,"ДФ=мм");
//		
//		Обл.Параметры.ДатаВозвращения_ДД = Формат(ТекущийДокумент.ДатаВозвращения,"ДФ=дд");
//		Обл.Параметры.ДатаВозвращения_ММММ = Формат(ТекущийДокумент.ДатаВозвращения,"ДФ=ММ");
//		Обл.Параметры.ВремяВозвращения_ЧЧ = Формат(ТекущийДокумент.ДатаВозвращения,"ДФ=ЧЧ");
//		Обл.Параметры.ВремяВозвращения_ММ = Формат(ТекущийДокумент.ДатаВозвращения,"ДФ=мм");
//		
//		Если ТекущийДокумент.ВыдатьКоличествоГорючего > 0 Тогда
//			Обл.Параметры.ВыдатьГорючее = ТекущийДокумент.ВыдатьГорючее;
//			Обл.Параметры.ВыдатьКоличествоГорючего = ТекущийДокумент.ВыдатьКоличествоГорючего;
//		КонецЕсли;	
//		
//		Обл.Параметры.СпидометрВыезда = ТекущийДокумент.СпидометрВыезда;
//		Обл.Параметры.НулевойПробег = ТекущийДокумент.НулевойПробегВыезда;
//		
//		Если ФлагПечати = 5 Или ФлагПечати = 4 Тогда
//			Обл.Параметры.СпидометрВозвращения = ТекущийДокумент.СпидометрВозвращения;
//		КонецЕсли;
//		
//		
//		Если ФлагПечати = 5 Или ФлагПечати = 4  Тогда
//			Обл.Параметры.НулевойПробегВозврат = ТекущийДокумент.НулевойПробегВозвращения;
//			Обл.Параметры.СпидометрВозвращения = ТекущийДокумент.СпидометрВозвращения;
//		КонецЕсли;
//		
//		Для Каждого ТекСтрока из ТекущийДокумент.РасходГСМ Цикл
//			Если ТекСтрока.ТС = ТекущийДокумент.ТранспортноеСредство Тогда
//				Если ТекСтрока.ГСМ = ТекСтрока.ТС.Модель.ОсновноеТопливо Тогда
//					Обл.Параметры.ГСМ1	= ТекСтрока.ГСМ;
//					Обл.Параметры.ОстатокПриВыезде1	= ТекСтрока.ОстатокПриВыезде;
//					Обл.Параметры.ВыданоГСМ1 = ТекСтрока.Выдано;
//					Если ФлагПечати = 5 Или ФлагПечати = 4   Тогда
//						Обл.Параметры.ОстатокПриВозвращении1 = ТекСтрока.ОстатокПриВозвращении;
//						Обл.Параметры.СданоГСМ1 = ТекСтрока.Сдано;
//					КонецЕсли;
//				Иначе
//					Обл.Параметры.ГСМ2	= ТекСтрока.ГСМ;
//					Обл.Параметры.ОстатокПриВыезде2	= ТекСтрока.ОстатокПриВыезде;
//					Обл.Параметры.ВыданоГСМ2 = ТекСтрока.Выдано;
//					Если ФлагПечати = 5 Или ФлагПечати = 4  Тогда
//						Обл.Параметры.ОстатокПриВозвращении2 = ТекСтрока.ОстатокПриВозвращении;
//						Обл.Параметры.СданоГСМ2 = ТекСтрока.Сдано;
//					КонецЕсли;
//				КонецЕсли;	
//			КонецЕсли;	
//		КонецЦикла;
//		
//		Обл.Параметры.ВыдалДиспетчер = уатОбщегоНазначенияТиповые.уатФамилияИнициалыФизЛица(ТекущийДокумент.ВыдалДиспетчер.ФизическоеЛицо);
//		Если СтрДлина(ТекущийДокумент.ВыпустилМеханик.ФизическоеЛицо) > 30 Тогда
//			Обл.Параметры.ВыпустилМеханик = уатОбщегоНазначенияТиповые.уатФамилияИнициалыФизЛица(ТекущийДокумент.ВыпустилМеханик.ФизическоеЛицо);
//		Иначе
//			Обл.Параметры.ВыпустилМеханик = ТекущийДокумент.ВыпустилМеханик.ФизическоеЛицо;
//		КонецЕсли;
//		Обл.Параметры.ПринялМеханик = ТекущийДокумент.ПринялМеханик.ФизическоеЛицо;
//		Если СтрДлина(ТекущийДокумент.Водитель1.ФизическоеЛицо) > 30 Тогда
//			Обл.Параметры.ВодительПринял = уатОбщегоНазначенияТиповые.уатФамилияИнициалыФизЛица(ТекущийДокумент.Водитель1.ФизическоеЛицо);
//		Иначе
//			Обл.Параметры.ВодительПринял = ТекущийДокумент.Водитель1.ФизическоеЛицо;
//		КонецЕсли;
//		Обл.Параметры.ВодительСдал = ТекущийДокумент.Водитель1.ФизическоеЛицо;
//		Обл.Параметры.ОсмотрелВрач = уатОбщегоНазначенияТиповые.уатФамилияИнициалыФизЛица(ТекущийДокумент.ОсмотрелВрач.ФизическоеЛицо);
//		
//		ЕздкиВсего      = 0;
//		РасстояниеВсего = 0;
//		ТонныВсего      = 0;
//		Для Каждого ТекСтрока Из ТекущийДокумент.Задание Цикл
//			ТекИндекс = ТекущийДокумент.Задание.Индекс(ТекСтрока) + 1;
//			
//			Если ТекИндекс > мМаксСтрок Тогда
//				Прервать;
//			КонецЕсли;
//			
//			стрОбласть = "ВРаспоряжение" + Строка(ТекИндекс);
//			Если ЗначениеЗаполнено(ТекСтрока.Контрагент) Тогда
//				Обл.Область(стрОбласть).Текст = ТекСтрока.Контрагент.НаименованиеПолное;
//				Адрес_ = уатОбщегоНазначенияСервер.СведенияОЮрФизЛице(ТекСтрока.Контрагент, ТекущийДокумент.ДатаЗакрытия).ЮридическийАдрес;
//				Если НЕ ПустаяСтрока(Адрес_) Тогда
//					Обл.Область(стрОбласть).Текст = Обл.Область(стрОбласть).Текст + " " + Адрес_;
//				КонецЕсли;
//				
//			ИначеЕсли ЗначениеЗаполнено(ТекСтрока.Подразделение) Тогда
//				Обл.Область(стрОбласть).Текст = ТекСтрока.Подразделение.Наименование;
//				
//			КонецЕсли;	
//			
//			стрОбласть = "ВремяПрибытия" + Строка(ТекИндекс);
//			Обл.Область(стрОбласть).Текст = Формат(ТекСтрока.ВремяПрибытия, ?(ТекСтрока.ВремяПрибытия - НачалоДня(ТекСтрока.ВремяПрибытия) = 0, "ДФ=""дд.ММ.гг""", "ДФ=""дд.ММ.гг ЧЧ:мм"""));
//			
//			стрОбласть = "АдресПогрузки" + Строка(ТекИндекс);
//			Обл.Область(стрОбласть).Текст = ПредставлениеАдреса(ТекСтрока.АдресПрибытия);
//			
//			стрОбласть = "АдресРазгрузки" + Строка(ТекИндекс);
//			Обл.Область(стрОбласть).Текст = ПредставлениеАдреса(ТекСтрока.АдресУбытия);
//			
//			стрОбласть = "Груз" + Строка(ТекИндекс);
//			Обл.Область(стрОбласть).Текст = ТекСтрока.Номенклатура;
//			
//			ЕздкиВсего = ЕздкиВсего + ТекСтрока.КоличествоЕздок;
//			стрОбласть = "КоличествоЕздок" + Строка(ТекИндекс);
//			Обл.Область(стрОбласть).Текст = ?(ТекСтрока.КоличествоЕздок = 0, "",ТекСтрока.КоличествоЕздок);
//			
//			РасстояниеВсего = РасстояниеВсего + ТекСтрока.КоличествоКмГруз;
//			стрОбласть = "Расстояние" + Строка(ТекИндекс);
//			Обл.Область(стрОбласть).Текст = ?(ТекСтрока.КоличествоКмГруз = 0, "",ТекСтрока.КоличествоКмГруз);
//			
//			ТонныВсего = ТонныВсего + ТекСтрока.КоличествоТонн;
//			стрОбласть = "Тонны" + Строка(ТекИндекс);
//			Обл.Область(стрОбласть).Текст = ?(ТекСтрока.КоличествоТонн = 0, "",ТекСтрока.КоличествоТонн);
//		КонецЦикла;
//		
//		Обл.Область("ЕздкиВсего").Текст      = ?(ЕздкиВсего = 0, "", ЕздкиВсего);
//		Обл.Область("РасстояниеВсего").Текст = ?(РасстояниеВсего = 0, "", РасстояниеВсего);
//		Обл.Область("ТонныВсего").Текст      = ?(ТонныВсего = 0, "", ТонныВсего);
//		
//		ТабДокумент.Вывести(Обл);
//	КонецЕсли;
//	
//	Если ФлагПечати = 0 Или ФлагПечати = 4 Тогда	//Новая страница для печати полного пут. листа
//		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
//	КонецЕсли;
//	
//	//печатаем обратную сторону п/л
//	Если ФлагПечати <> 1 И ФлагПечати <> 5 Тогда
//		
//		Обл   = Макет.ПолучитьОбласть("Оборотная");
//		
//		Если ФлагПечати = 3 Или ФлагПечати = 4 Тогда
//			
//			Для Каждого ТекСтрока из ТекущийДокумент.Простои Цикл
//				
//				ТекИндекс = ТекущийДокумент.Простои.Индекс(ТекСтрока) + 1;
//				
//				Если ТекИндекс > мМаксСтрокПростоя Тогда
//					Прервать;
//				КонецЕсли;
//				
//				стрОбласть = "Видпростоя" + Строка(ТекИндекс);
//				Обл.Область(стрОбласть).Текст = ТекСтрока.ВидПростоя;
//				стрОбласть = "Начало" + Строка(ТекИндекс);
//				Обл.Область(стрОбласть).Текст = Формат(ТекСтрока.НачалоПростоя,"ДФ='dd.MM.yyyy HH.mm'");
//				стрОбласть = "Окончание" + Строка(ТекИндекс);
//				Обл.Область(стрОбласть).Текст = Формат(ТекСтрока.КонецПростоя,"ДФ='dd.MM.yyyy HH.mm'");
//			КонецЦикла;
//			ФорматЧисла = "ДФ=dd.MM.yyyy";
//			ФорматЧасов = "ДФ=HH";
//			ФорматМинут =  "ДФ=mm";
//			Для Каждого ТекСтрока Из ТекущийДокумент.Задание Цикл
//				ТекИндекс = ТекущийДокумент.Задание.Индекс(ТекСтрока) + 1;
//				
//				Если ТекИндекс > мМаксСтрокПослЗаданий Тогда
//					Прервать;
//				КонецЕсли;
//				
//				Если Не ТекСтрока.Выполнено Тогда
//					Продолжить;
//				КонецЕсли;
//				
//				стрОбласть = "ПунктПогрузкиРазгрузки" + Строка(ТекИндекс);
//				Обл.Область(стрОбласть).Текст = ПредставлениеАдреса(ТекСтрока.АдресПрибытия) + " - " + ПредставлениеАдреса(ТекСтрока.АдресУбытия);
//				
//				стрОбласть = "ЧислоПрибытие" + Строка(ТекИндекс);
//				Обл.Область(стрОбласть).Текст = Формат(ТекСтрока.ВремяПрибытия,ФорматЧисла);
//				
//				стрОбласть = "ЧасыПрибытие" + Строка(ТекИндекс);
//				Обл.Область(стрОбласть).Текст = Формат(ТекСтрока.ВремяПрибытия,ФорматЧасов);
//				
//				стрОбласть = "МинутПрибытие" + Строка(ТекИндекс);
//				Обл.Область(стрОбласть).Текст = Формат(ТекСтрока.ВремяПрибытия,ФорматМинут);
//				
//				стрОбласть = "ЧасыУбытие" + Строка(ТекИндекс);
//				Обл.Область(стрОбласть).Текст = Формат(ТекСтрока.ВремяУбытия,ФорматЧасов);
//				
//				стрОбласть = "МинутУбытие" + Строка(ТекИндекс);
//				Обл.Область(стрОбласть).Текст = Формат(ТекСтрока.ВремяУбытия,ФорматМинут);
//				
//				стрОбласть = "НаименованиеОтправителя" + Строка(ТекИндекс);
//				Если ЗначениеЗаполнено(ТекСтрока.Контрагент) Тогда
//					Обл.Область(стрОбласть).Текст = ТекСтрока.Контрагент.НаименованиеПолное;
//				ИначеЕсли ЗначениеЗаполнено(ТекСтрока.Подразделение) Тогда
//					Обл.Область(стрОбласть).Текст = ТекСтрока.Подразделение.Наименование;
//				КонецЕсли;	
//				
//			КонецЦикла;
//			
//			Для Каждого ТекСтрока из ТекущийДокумент.РасходГСМ Цикл
//				Если ТекСтрока.ТС = ТекущийДокумент.ТранспортноеСредство Тогда
//					Если ТекСтрока.ГСМ = ТекСтрока.ТС.Модель.ОсновноеТопливо Тогда
//						Обл.Параметры.РасходПоНорме = ТекСтрока.РасходПоНорме;
//						Обл.Параметры.РасходФактический = ТекСтрока.РасходПоФакту;
//					КонецЕсли;
//				КонецЕсли;	
//			КонецЦикла;
//			ВыработкаТС = ТекущийДокумент.ВыработкаТС.Выгрузить();
//			ВыработкаТС.Свернуть("ТС,ПараметрВыработки","Количество");
//			Прицеп = Неопределено;
//			Для Каждого ТекСтрока Из ТекущийДокумент.Прицепы Цикл 
//				Если ТекСтрока.ТС.ВидМоделиТС = Перечисления.уатВидыМоделейТС.Прицеп Тогда
//					Прицеп = ТекСтрока.ТС;
//					Прервать;
//				КонецЕсли;
//			КонецЦикла;
//			Отбор = Новый Структура("ТС,ПараметрВыработки");
//			Отбор.Вставить("ТС",ТекущийДокумент.ТранспортноеСредство);
//			Отбор.Вставить("ПараметрВыработки",Справочники.уатПараметрыВыработки.ВремяВНаряде);
//			ВремяВНарядеТС = ВыработкаТС.НайтиСтроки(Отбор);
//			Если ВремяВНарядеТС.Количество() > 0 Тогда
//				Обл.Параметры.ВремяВНарядеТС = Формат(уатОбщегоНазначения.уатВремяВЧЧ_ММ(ВремяВНарядеТС[0].Количество),"ЧДЦ=2; ЧРД=:");
//			КонецЕсли;
//			Отбор.Вставить("ПараметрВыработки",Справочники.уатПараметрыВыработки.КоличествоЕздок);
//			ВсегоЕздок = ВыработкаТС.НайтиСтроки(Отбор);
//			Если ВсегоЕздок.Количество() > 0 Тогда
//				Обл.Параметры.ЕздокВсего = ВсегоЕздок[0].Количество;
//			КонецЕсли;
//			Отбор.Вставить("ПараметрВыработки",Справочники.уатПараметрыВыработки.ПробегОбщий);
//			ПробегОбщийТС = ВыработкаТС.НайтиСтроки(Отбор);
//			Если ПробегОбщийТС.Количество() > 0 Тогда
//				Обл.Параметры.ПробегОбщийТС = ПробегОбщийТС[0].Количество;
//			КонецЕсли;
//			Отбор.Вставить("ПараметрВыработки",Справочники.уатПараметрыВыработки.ПробегСГрузом);
//			ПробегСГрузомТС = ВыработкаТС.НайтиСтроки(Отбор);
//			Если ПробегСГрузомТС.Количество() > 0 Тогда
//				Обл.Параметры.ПробегСГрузомТС = ПробегСГрузомТС[0].Количество;
//			КонецЕсли;
//			Отбор.Вставить("ПараметрВыработки",Справочники.уатПараметрыВыработки.ВесГруза);
//			ВсегоТонн = ВыработкаТС.НайтиСтроки(Отбор);
//			Если ВсегоТонн.Количество() > 0 Тогда
//				Обл.Параметры.ТоннВсего = ВсегоТонн[0].Количество;
//			КонецЕсли;
//			Отбор.Вставить("ПараметрВыработки",Справочники.уатПараметрыВыработки.ТнКм);
//			ВсегоТКМ = ВыработкаТС.НайтиСтроки(Отбор);
//			Если ВсегоТКМ.Количество() > 0 Тогда
//				Обл.Параметры.ВсегоТКМ = ВсегоТКМ[0].Количество;
//			КонецЕсли;
//			
//			Если Прицеп <> Неопределено Тогда
//				Отбор.Вставить("ТС",Прицеп);
//				Отбор.Вставить("ПараметрВыработки",Справочники.уатПараметрыВыработки.ПробегОбщий);
//				ПробегОбщийТС = ВыработкаТС.НайтиСтроки(Отбор);
//				Если ПробегОбщийТС.Количество() > 0 Тогда
//					Обл.Параметры.ПробегОбщийПрицеп = ПробегОбщийТС[0].Количество;
//				КонецЕсли;
//				Отбор.Вставить("ПараметрВыработки",Справочники.уатПараметрыВыработки.ПробегСГрузом);
//				ПробегСГрузомТС = ВыработкаТС.НайтиСтроки(Отбор);
//				Если ПробегСГрузомТС.Количество() > 0 Тогда
//					Обл.Параметры.ПробегСГрузомПрицеп = ПробегСГрузомТС[0].Количество;
//				КонецЕсли;
//			КонецЕсли;
//			
//		КонецЕсли;
//		
//		
//		ТабДокумент.Вывести(Обл);
//		
//	КонецЕсли;
//	
//	Возврат ТабДокумент;
//	
//КонецФункции

//&Вместо("уатПечать_6С")
//Функция ЮЦ_уатПечать_6С(ТекущийДокумент, ИмяМакета, ФлагПечати)
//	
//	Перем мВодительскоеУдСерия, мВодительскоеУдНомер, мВодительскоеУдКатегория;	
//	
//	мМаксСтрок = 5;
//	
//	ТабДокумент = Новый ТабличныйДокумент;
//	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПутевойЛист_ПутевойЛист";
//	
//	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.уатПутевойЛист." + ИмяМакета);
//	
//	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
//	
//	ТабДокумент.ПолеСверху 	= 0;
//	ТабДокумент.ПолеСлева 	= 0;
//	ТабДокумент.ПолеСнизу 	= 0;
//	ТабДокумент.ПолеСправа 	= 0;
//	
//	//печатаем лицевую сторону п/л
//	Если ФлагПечати <> 2 И ФлагПечати <> 3 Тогда
//		Обл   = Макет.ПолучитьОбласть("Лицевая");
//		
//		мНомерПЛ = уатОбщегоНазначенияТиповые.уатПолучитьНомерНаПечать(ТекущийДокумент);
//		ФорматДаты = "ДФ='дд ММММ гггг'";
//		Обл.Параметры.Номер = мНомерПЛ;
//		Обл.Параметры.ДатаВыписки = Формат(ТекущийДокумент.Дата, ФорматДаты);
//		Обл.Параметры.ТекстДействителенДо = ?(ТекущийДокумент.ДействителенДо = '00010101', "", "Действителен по: " + Формат(ТекущийДокумент.ДействителенДо, ФорматДаты));
//		Обл.Параметры.Организация = уатОбщегоНазначенияТиповыеСервер.ОписаниеОрганизации(уатОбщегоНазначенияСервер.СведенияОЮрФизЛице(
//		ТекущийДокумент.Организация, ТекущийДокумент.ДатаЗакрытия), "ПолноеНаименование,ЮридическийАдрес,Телефоны") + " г. Ханты-Мансийск, ул. Студенческая, д. 8, тел. (34678) 35-69-22, ОГРН 1028600515327";
//		Обл.Параметры.КодПоОКПО = ТекущийДокумент.Организация.КодПоОКПО;
//		Обл.Параметры.МодельТС = уатОбщегоНазначения.уатПредставлениеМоделиТС(ТекущийДокумент.ТранспортноеСредство);
//		Обл.Параметры.ТипТС = ТекущийДокумент.ТранспортноеСредство.ТипТС;
//		Обл.Параметры.ТранспортноеСредствоГосНомер = ТекущийДокумент.ТранспортноеСредство.ГосударственныйНомер;
//		Обл.Параметры.ТранспортноеСредствоГарНомер = ТекущийДокумент.ТранспортноеСредство.ГаражныйНомер;
//		Если ТекущийДокумент.ТранспортноеСредство.Колонна <> Неопределено Тогда
//			Обл.Параметры.Колонна = ТекущийДокумент.ТранспортноеСредство.Колонна.Код;
//		КонецЕсли;	
//		Если ТекущийДокумент.ВидПЛ = Перечисления.уатВидыПЛ._4П Тогда
//			Обл.Параметры.НомерПЛВТалоне = мНомерПЛ;
//			Обл.Параметры.ДатаПЛВТалоне = Формат(ТекущийДокумент.Дата, ФорматДаты);
//		КонецЕсли;	
//		
//		Водители = уатОбщегоНазначения.уатФИОСотрудникаПолноеСтрокой(ТекущийДокумент.Водитель1, ТекущийДокумент.Дата);
//		Если ЗначениеЗаполнено(ТекущийДокумент.Водитель2) Тогда
//			Обл.Параметры.Водители  = СокрЛП(Водители) +  ", " + уатОбщегоНазначения.уатФИОСотрудникаПолноеСтрокой(ТекущийДокумент.Водитель2, ТекущийДокумент.Дата);
//		Иначе
//			Обл.Параметры.Водители  = Водители;
//		КонецЕсли;	
//		мРеквизитыВодителя1 = уатОбщегоНазначения.уатПрочитатьРеквизитыВодителя(ТекущийДокумент.Водитель1, ТекущийДокумент.Дата,, ТекущийДокумент.Организация);
//		
//		Если мРеквизитыВодителя1 <> Неопределено Тогда
//			Обл.Параметры.ВодительКод 	= мРеквизитыВодителя1.ТабельныйНомер;
//			Обл.Параметры.КлассВодителя = мРеквизитыВодителя1.Класс;
//		КонецЕсли;
//		
//		уатОбщегоНазначения.уатУдостоверениеВодителя(ТекущийДокумент.Водитель1, мВодительскоеУдСерия, мВодительскоеУдНомер, мВодительскоеУдКатегория);	
//		Обл.Параметры.НомерУдостоверенияВодителя = ?(СокрЛП(мВодительскоеУдСерия)="","",СокрЛП(мВодительскоеУдСерия) + " ") + мВодительскоеУдНомер;
//		
//		Если ЗначениеЗаполнено(ТекущийДокумент.Водитель2) Тогда
//			уатОбщегоНазначения.уатУдостоверениеВодителя(ТекущийДокумент.Водитель2, мВодительскоеУдСерия, мВодительскоеУдНомер, мВодительскоеУдКатегория);	
//			Обл.Параметры.НомерУдостоверенияВодителя  = СокрЛП(Обл.Параметры.НомерУдостоверенияВодителя) + ", "
//			+ ?(СокрЛП(мВодительскоеУдСерия)="","",СокрЛП(мВодительскоеУдСерия) + " ") + мВодительскоеУдНомер;
//		КонецЕсли;
//		
//		Обл.Параметры.ЛицензионнаяКарточка = ТекущийДокумент.ТранспортноеСредство.ЛицензионнаяКарточка;
//		Обл.Параметры.НомерЛицензионнойКарточки = ТекущийДокумент.ТранспортноеСредство.НомерЛицензионнойКарточки;
//		Обл.Параметры.СерияЛицензионнойКарточки = ТекущийДокумент.ТранспортноеСредство.СерияЛицензионнойКарточки;
//		Обл.Параметры.НомерСерииЛицензионнойКарточки = ТекущийДокумент.ТранспортноеСредство.НомерСерииЛицензионнойКарточки;
//		
//		Обл.Параметры.ВремяВыезда		= Формат(ТекущийДокумент.ДатаВыезда,"ДФ=ЧЧ:мм");
//		Обл.Параметры.ВремяВозвращения	= Формат(ТекущийДокумент.ДатаВозвращения,"ДФ=ЧЧ:мм");
//		Если ТекущийДокумент.ВыдатьКоличествоГорючего > 0 Тогда
//			Обл.Параметры.ВыдатьГорючее				= ТекущийДокумент.ВыдатьГорючее;
//			Обл.Параметры.ВыдатьКоличествоГорючего  = ТекущийДокумент.ВыдатьКоличествоГорючего;
//		КонецЕсли;	
//		
//		Обл.Параметры.СпидометрВыезда		= ТекущийДокумент.СпидометрВыезда;
//		Обл.Параметры.СпидометрВозвращения	= ТекущийДокумент.СпидометрВозвращения;
//		Обл.Параметры.НулевойПробегВыезда	= ТекущийДокумент.НулевойПробегВыезда;
//		Обл.Параметры.НулевойПробегВозвращения = ТекущийДокумент.НулевойПробегВозвращения;
//		
//		Для Каждого ТекСтрока из ТекущийДокумент.РасходГСМ Цикл
//			Если ТекСтрока.ТС = ТекущийДокумент.ТранспортноеСредство Тогда
//				Если ТекСтрока.ГСМ = ТекСтрока.ТС.Модель.ОсновноеТопливо Тогда
//					Обл.Параметры.ГСМ1              = ТекСтрока.ГСМ;
//					Обл.Параметры.ОстатокПриВыезде1 = ТекСтрока.ОстатокПриВыезде;
//					Обл.Параметры.Выдано1           = ТекСтрока.Выдано;
//					
//					Если ФлагПечати = 5 Или ФлагПечати = 4 Тогда 
//						Обл.Параметры.ОстатокПриВозврате1 = ТекСтрока.ОстатокПриВозвращении;
//						Обл.Параметры.Сдано1              = ТекСтрока.Сдано;
//					КонецЕсли;
//				Иначе
//					Обл.Параметры.ГСМ2              = ТекСтрока.ГСМ;
//					Обл.Параметры.ОстатокПриВыезде2 = ТекСтрока.ОстатокПриВыезде;
//					Обл.Параметры.Выдано2           = ТекСтрока.Выдано;
//					
//					Если ФлагПечати = 5 Или ФлагПечати = 4 Тогда 
//						Обл.Параметры.ОстатокПриВозврате2 = ТекСтрока.ОстатокПриВозвращении;
//						Обл.Параметры.Сдано2              = ТекСтрока.Сдано;
//					КонецЕсли;
//				КонецЕсли;
//			КонецЕсли;
//		КонецЦикла;
//		
//		Обл.Параметры.ВыдалДиспетчер  = уатОбщегоНазначенияТиповые.уатФамилияИнициалыФизЛица(ТекущийДокумент.ВыдалДиспетчер.ФизическоеЛицо);
//		Обл.Параметры.ВыпустилМеханик = уатОбщегоНазначенияТиповые.уатФамилияИнициалыФизЛица(ТекущийДокумент.ВыпустилМеханик.ФизическоеЛицо);
//		Обл.Параметры.ПринялМеханик   = уатОбщегоНазначенияТиповые.уатФамилияИнициалыФизЛица(ТекущийДокумент.ПринялМеханик.ФизическоеЛицо);
//		Обл.Параметры.ВодительСдал    = уатОбщегоНазначенияТиповые.уатФамилияИнициалыФизЛица(ТекущийДокумент.Водитель1.ФизическоеЛицо);
//		Обл.Параметры.ВодительПринял  = уатОбщегоНазначенияТиповые.уатФамилияИнициалыФизЛица(ТекущийДокумент.Водитель1.ФизическоеЛицо);
//		Обл.Параметры.ОсмотрелВрач    = уатОбщегоНазначенияТиповые.уатФамилияИнициалыФизЛица(ТекущийДокумент.ОсмотрелВрач.ФизическоеЛицо);
//		
//		Обл.Параметры.СтрПутевойЛист  = "№" + ТекущийДокумент.Номер + " от " + Формат(ТекущийДокумент.Дата, "ДЛФ=D");
//		
//		Для Каждого ТекСтрока Из ТекущийДокумент.Задание Цикл
//			ТекИндекс = ТекущийДокумент.Задание.Индекс(ТекСтрока) + 1;
//			
//			Если ТекИндекс > мМаксСтрок Тогда
//				Прервать;
//			КонецЕсли;
//			
//			стрОбласть = "ВРаспоряжение" + Строка(ТекИндекс);
//			Если ЗначениеЗаполнено(ТекСтрока.Контрагент) Тогда
//				Обл.Область(стрОбласть).Текст = ТекСтрока.Контрагент.НаименованиеПолное;
//			ИначеЕсли ЗначениеЗаполнено(ТекСтрока.Подразделение) Тогда
//				Обл.Область(стрОбласть).Текст = ТекСтрока.Подразделение.Наименование;
//			КонецЕсли;	
//			стрОбласть = "ВремяПрибытия" + Строка(ТекИндекс);
//			Обл.Область(стрОбласть).Текст = ?(ТекСтрока.ВремяПрибытия - НачалоДня(ТекСтрока.ВремяПрибытия) = 0, "", Формат(ТекСтрока.ВремяПрибытия, "ДФ=ЧЧ:мм"));
//			стрОбласть = "ВремяУбытия" + Строка(ТекИндекс);
//			Обл.Область(стрОбласть).Текст = ?(ТекСтрока.ВремяУбытия - НачалоДня(ТекСтрока.ВремяУбытия) = 0, "", Формат(ТекСтрока.ВремяУбытия, "ДФ=ЧЧ:мм"));
//			стрОбласть = "КоличествоЕздок" + Строка(ТекИндекс);
//			Обл.Область(стрОбласть).Текст = ?(ТекСтрока.КоличествоЕздок = 0, "",ТекСтрока.КоличествоЕздок);
//			стрОбласть = "КоличествоЧасов" + Строка(ТекИндекс);
//			Обл.Область(стрОбласть).Текст = ?(ТекСтрока.КоличествоЧасов = 0, "", Формат(ТекСтрока.КоличествоЧасов, "ЧДЦ=2; ЧРД=:"));
//			
//		КонецЦикла;
//		
//		ТабДокумент.Вывести(Обл);
//	КонецЕсли;
//	
//	Если ФлагПечати = 0 Или ФлагПечати = 4 Тогда	//Новая страница для печати полного пут. листа
//		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
//	КонецЕсли;
//	
//	//печатаем обратную сторону п/л
//	Если ФлагПечати <> 1 И ФлагПечати <> 5 Тогда
//		
//		Обл   = Макет.ПолучитьОбласть("Оборотная");
//		
//		Обл.Параметры.Организация  		= ТекущийДокумент.Организация;
//		Обл.Параметры.МодельТС  		= уатОбщегоНазначения.уатПредставлениеМоделиТС(ТекущийДокумент.ТранспортноеСредство);
//		Обл.Параметры.ТранспортноеСредствоГосНомер	= ТекущийДокумент.ТранспортноеСредство.ГосударственныйНомер;
//		Обл.Параметры.СтрПутевойЛист  = "№" + ТекущийДокумент.Номер + " от " + Формат(ТекущийДокумент.Дата, "ДЛФ=D");
//		
//		ТабДокумент.Вывести(Обл);
//		
//	КонецЕсли;
//	
//	Возврат ТабДокумент;
//	
//КонецФункции // ПечатьПлатежногоПоручения()
