&После("ПересчетСданногоГСМ")
Процедура ЮЦ_ПересчетСданногоГСМ(ТаблицаСливыГСМ)//если заправляют ... через слив.
	
	Если ТаблицаСливыГСМ = Неопределено Тогда
		ТаблицаСливыГСМ = уатОбщегоНазначения.уатПолучитьСливыДляПЛ(Ссылка);
	КонецЕсли;
	
	Для Каждого ТекСтрока Из РасходГСМ Цикл
		мМассивСтрокСливовГСМ = ТаблицаСливыГСМ.НайтиСтроки(Новый Структура("АЗС", ТекСтрока.ТС));
		
		тзАналогиГСМ = уатОбщегоНазначения.уатПолучитьАналогиГСМ(ТекСтрока.ГСМ);
		
		чСдано = 0;
		Для сч = 0 По мМассивСтрокСливовГСМ.Количество() - 1 Цикл
			//если заправка не проведена - не учитываем
			Если НЕ мМассивСтрокСливовГСМ[сч].Ссылка.Проведен Тогда
				Продолжить;
			КонецЕсли;
			
			//слив ГСМ или его аналога
			мГСМ		= мМассивСтрокСливовГСМ[сч].ГСМ;
			мКоличество = мМассивСтрокСливовГСМ[сч].Количество;
			
			Если тзАналогиГСМ.Найти(мГСМ, "Аналог") <> Неопределено Или	мГСМ = ТекСтрока.ГСМ Тогда
				чСдано = чСдано + мКоличество;
			КонецЕсли;	
		КонецЦикла;	
		
		Если ТекСтрока.Выдано <> Окр(чСдано, 3) Тогда
			ТекСтрока.Выдано = ТекСтрока.Выдано + чСдано;
			Если Рассчитан Тогда
				ТекСтрока.РасходПоФакту = ТекСтрока.ОстатокПриВыезде - ТекСтрока.ОстатокПриВозвращении + ТекСтрока.Выдано - ТекСтрока.Сдано;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&Вместо("РасчетВыработкиТС_ПоЗаданию")
Процедура ЮЦ_РасчетВыработкиТС_ПоЗаданию(Отказ, ОбновлятьПробегМоточасыВПЛПриРасчетеИтогов)
		//очистка выработки - только для предопределенных параметров выработки
	Сч = ВыработкаТС.Количество() - 1;
	Пока Сч >= 0 Цикл
		ТекСтрока = ВыработкаТС[Сч];
		Если ТекСтрока.ПараметрВыработки.Предопределенный Или Не Задание.Найти(ТекСтрока.ПараметрВыработки) = Неопределено Тогда
			ВыработкаТС.Удалить(ТекСтрока);
		КонецЕсли;
		Сч = Сч - 1;
	КонецЦикла;
	
	//пробег общий для ТС со счетчиком моточасов
	Если НЕ ТранспортноеСредство.Модель.НаличиеСпидометра Тогда
		мПробегОбщий = НулевойПробегВыезда + НулевойПробегВозвращения;
		Для Каждого ТекСтрокаЗадания Из Задание Цикл
			Если Не ТекСтрокаЗадания.Выполнено Тогда Продолжить; КонецЕсли;
			ТекСтрокаЗадания_КоличествоЕздок = ?(ТекСтрокаЗадания.КоличествоЕздок = 0, 1, ТекСтрокаЗадания.КоличествоЕздок);
			мПробегОбщий = мПробегОбщий + ТекСтрокаЗадания.КоличествоКмГруз*ТекСтрокаЗадания_КоличествоЕздок
				+ ТекСтрокаЗадания.КоличествоКмПорожний*ТекСтрокаЗадания_КоличествоЕздок;
		КонецЦикла;
	КонецЕсли;
	
	//время в наряде
	ЗаписатьСтрокуВыработкиТС(ТранспортноеСредство, Справочники.уатПараметрыВыработки.ВремяВНаряде, мВремяВНаряде);
	
	//время в простое
	ЗаписатьСтрокуВыработкиТС(ТранспортноеСредство, Справочники.уатПараметрыВыработки.ВремяВПростое, мВремяВПростое - 
		мВремяВПростоеСВклДвигателем);
	
	//время в простое с вкл. двигателем
	ЗаписатьСтрокуВыработкиТС(ТранспортноеСредство, Справочники.уатПараметрыВыработки.ВремяВПростоеСВклДвигателем, 
		мВремяВПростоеСВклДвигателем);
	
	//количество дней
	ЗаписатьСтрокуВыработкиТС(ТранспортноеСредство, Справочники.уатПараметрыВыработки.КоличествоДней, мКоличествоДней);
	
	//количество рейсов
	ЗаписатьСтрокуВыработкиТС(ТранспортноеСредство, Справочники.уатПараметрыВыработки.КоличествоРейсов, 1, , , Ложь);
	
	//пробег с пассажирами
	Если ВидПЛ = Перечисления.уатВидыПЛ._6 Или  //ВидПЛ = Перечисления.уатВидыПЛ._4 Или
			ВидПЛ = Перечисления.уатВидыПЛ._6С Тогда
		ЗаписатьСтрокуВыработкиТС(ТранспортноеСредство, Справочники.уатПараметрыВыработки.ПробегСПассажирами, мПробегОбщий -
			НулевойПробегВыезда - НулевойПробегВозвращения);
	КонецЕсли;	
	
	мКоличествоКмСГрузом = 0;
	мКоличествоЧасов = 0;
	мПробегПорожний = 0;
	мОбщаяНаработка = уатОбщегоНазначения.уатПоказанияСчетчикаВСекунды(уатОбщегоНазначения.уатРазностьПоказанийСчетчика(
		СпидометрВыезда, СпидометрВозвращения));
	
	//делаем таблицу с номерами этапов
	мЭтапыЗадания = Задание.Выгрузить();
	мЭтапыЗадания.Свернуть("НомерЕздки");
	
	ВесГруза_СуммированиеПоЭтапам = (Справочники.уатПараметрыВыработки.ВесГруза.СпособРасчетаПоНомеруЭтапа = 0);
	Объем_СуммированиеПоЭтапам = (Справочники.уатПараметрыВыработки.Объем.СпособРасчетаПоНомеруЭтапа = 0);
	КоличествоЕздок_СуммированиеПоЭтапам = (Справочники.уатПараметрыВыработки.КоличествоЕздок.СпособРасчетаПоНомеруЭтапа = 0);
	
	Для Каждого ТекЭтапЗадания из мЭтапыЗадания Цикл
		//выбираем строки для каждого этапа задания
		мСтрокиЗадания = Задание.НайтиСтроки(Новый Структура("НомерЕздки, Выполнено", ТекЭтапЗадания.НомерЕздки, Истина));
		
		//вес, объем груза, количество ездок для номера этапа <> 0 (учет по этапам ведется)
		//для разных строк с одинаковым номером этапа либо суммируем, либо выбираем максимальное значение
		Если ТекЭтапЗадания.НомерЕздки <> 0 Тогда
			мВесГруза = 0;
			мОбъем = 0;
			мКоличествоЕздок = 0;
			мНомСтрМаксВес = Неопределено;
			мНомСтрМаксОбъем = Неопределено;
			мНомСтрМаксКоличествоЕздок = Неопределено;
			СоотвСпецРаботы = Новый Соответствие;
			
			Для Каждого ТекСтрЗадание Из мСтрокиЗадания Цикл
				Если НЕ ВесГруза_СуммированиеПоЭтапам И мВесГруза < ТекСтрЗадание.КоличествоТонн * ТекСтрЗадание.КоличествоЕздок Тогда
					мВесГруза = ТекСтрЗадание.КоличествоТонн * ТекСтрЗадание.КоличествоЕздок;
					мНомСтрМаксВес = ТекСтрЗадание.НомерСтроки-1;
				КонецЕсли;
				Если НЕ Объем_СуммированиеПоЭтапам И мОбъем < ТекСтрЗадание.Объем * ТекСтрЗадание.КоличествоЕздок Тогда
					мОбъем = ТекСтрЗадание.Объем * ТекСтрЗадание.КоличествоЕздок;
					мНомСтрМаксОбъем = ТекСтрЗадание.НомерСтроки-1;
				КонецЕсли;
				Если НЕ КоличествоЕздок_СуммированиеПоЭтапам И мКоличествоЕздок < ТекСтрЗадание.КоличествоЕздок Тогда
					мКоличествоЕздок = ТекСтрЗадание.КоличествоЕздок;
					мНомСтрМаксКоличествоЕздок = ТекСтрЗадание.НомерСтроки-1;
				КонецЕсли;
				Для СчСпец = 1 По 5 Цикл
					Если ТекСтрЗадание["КоличествоСпецРаботы" + СчСпец] > 0 И ТекСтрЗадание["СпецРабота" + СчСпец].СпособРасчетаПоНомеруЭтапа = 1 Тогда
						СтруктураСпец = СоотвСпецРаботы.Получить(ТекСтрЗадание["СпецРабота" + СчСпец]);
						Если СтруктураСпец = Неопределено Тогда
							СтруктураСпец = Новый Структура("Количество, НомерСтроки", 0, Неопределено);
						КонецЕсли;
						Если СтруктураСпец.Количество < ТекСтрЗадание["КоличествоСпецРаботы" + СчСпец] * ТекСтрЗадание.КоличествоЕздок Тогда
							СтруктураСпец.Количество = ТекСтрЗадание["КоличествоСпецРаботы" + СчСпец] * ТекСтрЗадание.КоличествоЕздок;
							СтруктураСпец.НомерСтроки = ТекСтрЗадание.НомерСтроки-1;
						КонецЕсли;
						СоотвСпецРаботы.Вставить(ТекСтрЗадание["СпецРабота" + СчСпец], СтруктураСпец);
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
			Если мНомСтрМаксВес <> Неопределено Тогда 
				ЗначенияАналитик = Новый Структура;
				ЗначенияАналитик.Вставить("Подразделение", Задание[мНомСтрМаксВес].Подразделение);
				ЗначенияАналитик.Вставить("Контрагент", Задание[мНомСтрМаксВес].Контрагент);
				ЗаписатьСтрокуВыработкиТС(ТранспортноеСредство, Справочники.уатПараметрыВыработки.ВесГруза, мВесГруза,
					ЗначенияАналитик);
			КонецЕсли;
			Если мНомСтрМаксОбъем <> Неопределено Тогда
				ЗаписатьСтрокуВыработкиТС(ТранспортноеСредство, Справочники.уатПараметрыВыработки.Объем, мОбъем,
					Задание[мНомСтрМаксОбъем].Подразделение, Задание[мНомСтрМаксОбъем].Контрагент, Ложь);
			КонецЕсли;
			Если мНомСтрМаксКоличествоЕздок <> Неопределено Тогда
				ЗаписатьСтрокуВыработкиТС(ТранспортноеСредство, Справочники.уатПараметрыВыработки.КоличествоЕздок, мКоличествоЕздок,
					Задание[мНомСтрМаксКоличествоЕздок].Подразделение, Задание[мНомСтрМаксКоличествоЕздок].Контрагент, Ложь);
			КонецЕсли;
			Для Каждого ТекСоотвСпец Из СоотвСпецРаботы Цикл	
				Если ТекСоотвСпец.Значение.НомерСтроки <> Неопределено Тогда
					ЗаписатьСтрокуВыработкиТС(ТранспортноеСредство, ТекСоотвСпец.Ключ, ТекСоотвСпец.Значение.Количество,
						Задание[ТекСоотвСпец.Значение.НомерСтроки].Подразделение, Задание[ТекСоотвСпец.Значение.НомерСтроки].Контрагент, Ложь);
				КонецЕсли;
			КонецЦикла;	
		КонецЕсли;
		
		Для Каждого ТекСтрЗадание Из мСтрокиЗадания Цикл
			ЗначенияАналитик = Новый Структура;
			ЗначенияАналитик.Вставить("Подразделение", ТекСтрЗадание.Подразделение);
			ЗначенияАналитик.Вставить("Контрагент", ТекСтрЗадание.Контрагент);
			//время в работе
			Если ТранспортноеСредство.Модель.НаличиеСпидометра Тогда
				ЗаписатьСтрокуВыработкиТС(ТранспортноеСредство, Справочники.уатПараметрыВыработки.ВремяВРаботе,
					уатОбщегоНазначения.уатВремяВСекунды(ТекСтрЗадание.КоличествоЧасов), ЗначенияАналитик, Ложь);
			Иначе
				//отдельно для порожнего пробега
				//время работы записываем, если общая наработка больше чем уже учтенная до этого
				//(нельзя записать время в работе больше чем разность показаний счетчика в шапке)
				Если мКоличествоЧасов < мОбщаяНаработка Тогда
					ТекНаработка = Мин(мОбщаяНаработка - мКоличествоЧасов, уатОбщегоНазначения.уатВремяВСекунды(
						ТекСтрЗадание.КоличествоЧасов));
					ЗаписатьСтрокуВыработкиТС(ТранспортноеСредство, Справочники.уатПараметрыВыработки.ВремяВРаботе, ТекНаработка,
						ЗначенияАналитик, Ложь);
				КонецЕсли;
			КонецЕсли;
			
			//вес, объем груза, количество ездок для номера этапа = 0 (учет по этапам не ведется)
			Если ТекЭтапЗадания.НомерЕздки = 0 ИЛИ ВесГруза_СуммированиеПоЭтапам Тогда
				ЗаписатьСтрокуВыработкиТС(ТранспортноеСредство, Справочники.уатПараметрыВыработки.ВесГруза,
					ТекСтрЗадание.КоличествоТонн * ТекСтрЗадание.КоличествоЕздок, ЗначенияАналитик);
			КонецЕсли;
			Если ТекЭтапЗадания.НомерЕздки = 0 ИЛИ Объем_СуммированиеПоЭтапам Тогда
				ЗаписатьСтрокуВыработкиТС(ТранспортноеСредство, Справочники.уатПараметрыВыработки.Объем,
					ТекСтрЗадание.Объем * ТекСтрЗадание.КоличествоЕздок, ЗначенияАналитик);
			КонецЕсли;
			Если ТекЭтапЗадания.НомерЕздки = 0 ИЛИ КоличествоЕздок_СуммированиеПоЭтапам Тогда
				ЗаписатьСтрокуВыработкиТС(ТранспортноеСредство, Справочники.уатПараметрыВыработки.КоличествоЕздок,
					ТекСтрЗадание.КоличествоЕздок, ЗначенияАналитик);
			КонецЕсли;
			
			//количество операций
			ЗаписатьСтрокуВыработкиТС(ТранспортноеСредство, Справочники.уатПараметрыВыработки.КоличествоОпераций,
				ТекСтрЗадание.КоличествоОпераций, ЗначенияАналитик);
			
			//подача
			ЗаписатьСтрокуВыработкиТС(ТранспортноеСредство, Справочники.уатПараметрыВыработки.Подача,
			уатОбщегоНазначения.уатВремяВСекунды(ТекСтрЗадание.Подача), ЗначенияАналитик);
			
			//пробег с грузом
			Если Не ВидПЛ = Перечисления.уатВидыПЛ._6 Тогда
				ЗаписатьСтрокуВыработкиТС(ТранспортноеСредство, Справочники.уатПараметрыВыработки.ПробегСГрузом,
				ТекСтрЗадание.КоличествоКмГруз * ТекСтрЗадание.КоличествоЕздок, ЗначенияАналитик);
			Иначе 
				ЗаписатьСтрокуВыработкиТС(ТранспортноеСредство, Справочники.уатПараметрыВыработки.ПробегСГрузом,
				ТекСтрЗадание.КоличествоКмГруз, ЗначенияАналитик);
			КонецЕсли;	
			
			//спец. работа
			Если ТекЭтапЗадания.НомерЕздки = 0 ИЛИ ТекСтрЗадание.СпецРабота1.СпособРасчетаПоНомеруЭтапа = 0 Тогда
				ЗаписатьСтрокуВыработкиТС(ТранспортноеСредство, ТекСтрЗадание.СпецРабота1, ТекСтрЗадание.КоличествоСпецРаботы1 * ТекСтрЗадание.КоличествоЕздок, ЗначенияАналитик);
			КонецЕсли;
			Если ТекЭтапЗадания.НомерЕздки = 0 ИЛИ ТекСтрЗадание.СпецРабота2.СпособРасчетаПоНомеруЭтапа = 0 Тогда
				ЗаписатьСтрокуВыработкиТС(ТранспортноеСредство, ТекСтрЗадание.СпецРабота2, ТекСтрЗадание.КоличествоСпецРаботы2 * ТекСтрЗадание.КоличествоЕздок, ЗначенияАналитик);
			КонецЕсли;
			Если ТекЭтапЗадания.НомерЕздки = 0 ИЛИ ТекСтрЗадание.СпецРабота3.СпособРасчетаПоНомеруЭтапа = 0 Тогда
				ЗаписатьСтрокуВыработкиТС(ТранспортноеСредство, ТекСтрЗадание.СпецРабота3, ТекСтрЗадание.КоличествоСпецРаботы3 * ТекСтрЗадание.КоличествоЕздок, ЗначенияАналитик);
			КонецЕсли;
			Если ТекЭтапЗадания.НомерЕздки = 0 ИЛИ ТекСтрЗадание.СпецРабота4.СпособРасчетаПоНомеруЭтапа = 0 Тогда
				ЗаписатьСтрокуВыработкиТС(ТранспортноеСредство, ТекСтрЗадание.СпецРабота4, ТекСтрЗадание.КоличествоСпецРаботы4 * ТекСтрЗадание.КоличествоЕздок, ЗначенияАналитик);
			КонецЕсли;
			Если ТекЭтапЗадания.НомерЕздки = 0 ИЛИ ТекСтрЗадание.СпецРабота5.СпособРасчетаПоНомеруЭтапа = 0 Тогда
				ЗаписатьСтрокуВыработкиТС(ТранспортноеСредство, ТекСтрЗадание.СпецРабота5, ТекСтрЗадание.КоличествоСпецРаботы5 * ТекСтрЗадание.КоличествоЕздок, ЗначенияАналитик);
			КонецЕсли;
			
			//тн*км
			ЗаписатьСтрокуВыработкиТС(ТранспортноеСредство, Справочники.уатПараметрыВыработки.ТнКм,
				ТекСтрЗадание.КоличествоТонн * ТекСтрЗадание.КоличествоКмГруз * ТекСтрЗадание.КоличествоЕздок,
				ЗначенияАналитик);
			
			//объем*км
			ЗаписатьСтрокуВыработкиТС(ТранспортноеСредство, Справочники.уатПараметрыВыработки.ОбъемКм,
				ТекСтрЗадание.Объем * ТекСтрЗадание.КоличествоКмГруз * ТекСтрЗадание.КоличествоЕздок,
				ЗначенияАналитик);
			
			//количество пассажиров
			ЗаписатьСтрокуВыработкиТС(ТранспортноеСредство, Справочники.уатПараметрыВыработки.КоличествоПассажиров,
				ТекСтрЗадание.КоличествоПассажиров * ТекСтрЗадание.КоличествоЕздок, ЗначенияАналитик);
			
			//время в работе оборудования, у которого есть спидометр, а не счетчик моточасов
			Для Каждого ТекСтрПрицепы из Прицепы Цикл
				Если ТекСтрПрицепы.ТС.Модель.НаличиеСпидометра И ТекСтрЗадание.КоличествоЧасов > 0 Тогда
					ЗаписатьСтрокуВыработкиТС(ТекСтрПрицепы.ТС, Справочники.уатПараметрыВыработки.ВремяВРаботе,
						уатОбщегоНазначения.уатВремяВСекунды(ТекСтрЗадание.КоличествоЧасов), ЗначенияАналитик, Ложь);
				КонецЕсли;
			КонецЦикла;
			
			мКоличествоКмСГрузом = мКоличествоКмСГрузом + ТекСтрЗадание.КоличествоКмГруз * ТекСтрЗадание.КоличествоЕздок;
			мКоличествоЧасов = мКоличествоЧасов + уатОбщегоНазначения.уатВремяВСекунды(ТекСтрЗадание.КоличествоЧасов);
		КонецЦикла;	
	КонецЦикла;
	
	//отдельно для общего и порожнего пробега
	//порожний пробег записываем, если пробег общий больше пробега с грузом
	//(нельзя записать пробег общий больше чем разность показаний спидометра в шапке)
	мПробегОбщийПоЗаданию = 0;
	Для Каждого ТекЭтапЗадания из мЭтапыЗадания Цикл
		//выбираем строки для каждого этапа задания
		мСтрокиЗадания = Задание.НайтиСтроки(Новый Структура("НомерЕздки, Выполнено", ТекЭтапЗадания.НомерЕздки, Истина));
		
		Для Каждого ТекСтрЗадание Из мСтрокиЗадания Цикл
			ЗначенияАналитик = Новый Структура;
			ЗначенияАналитик.Вставить("Подразделение", ТекСтрЗадание.Подразделение);
			ЗначенияАналитик.Вставить("Контрагент", ТекСтрЗадание.Контрагент);

			ТекПробегПорожний = 0;
			Если мПробегПорожний + мКоличествоКмСГрузом + НулевойПробегВыезда + НулевойПробегВозвращения < мПробегОбщий Тогда
				Если Не ВидПЛ = Перечисления.уатВидыПЛ._6 Тогда
					ТекПробегПорожний = Мин(мПробегОбщий - мПробегПорожний - мКоличествоКмСГрузом - НулевойПробегВыезда - 
					НулевойПробегВозвращения, ТекСтрЗадание.КоличествоКмПорожний * ТекСтрЗадание.КоличествоЕздок);
				Иначе
					ТекПробегПорожний = Мин(мПробегОбщий - мПробегПорожний - мКоличествоКмСГрузом - НулевойПробегВыезда - 
					НулевойПробегВозвращения, ТекСтрЗадание.КоличествоКмПорожний);
				КонецЕсли;
				ЗаписатьСтрокуВыработкиТС(ТранспортноеСредство, Справочники.уатПараметрыВыработки.ПробегПорожний,
				ТекПробегПорожний, ЗначенияАналитик);
				мПробегПорожний = мПробегПорожний + ТекПробегПорожний;
			КонецЕсли;
			Если Не ВидПЛ = Перечисления.уатВидыПЛ._6 Тогда
				ТекПробегОбщий = ТекСтрЗадание.КоличествоКмГруз * ТекСтрЗадание.КоличествоЕздок + ТекПробегПорожний;
			Иначе
				ТекПробегОбщий = ТекСтрЗадание.КоличествоКмГруз + ТекПробегПорожний;
			КонецЕсли;
			ЗаписатьСтрокуВыработкиТС(ТранспортноеСредство, Справочники.уатПараметрыВыработки.ПробегОбщий, ТекПробегОбщий,
				ЗначенияАналитик);
			мПробегОбщийПоЗаданию = мПробегОбщийПоЗаданию + ТекПробегОбщий;
		КонецЦикла;
	КонецЦикла;
	
	//пробег порожний, не учитанный по строкам задания
	Если мПробегОбщий - мКоличествоКмСГрузом - мПробегПорожний - НулевойПробегВыезда - НулевойПробегВозвращения > 0 Тогда
		ЗаписатьСтрокуВыработкиТС(ТранспортноеСредство, Справочники.уатПараметрыВыработки.ПробегПорожний, мПробегОбщий - 
			мКоличествоКмСГрузом - мПробегПорожний - НулевойПробегВыезда - НулевойПробегВозвращения,,,Ложь);
	КонецЕсли;
	
	//пробег общий, не учитанный по строкам задания
	Если мПробегОбщий - мПробегОбщийПоЗаданию > 0 Тогда
		ЗаписатьСтрокуВыработкиТС(ТранспортноеСредство, Справочники.уатПараметрыВыработки.ПробегОбщий, мПробегОбщий -
			мПробегОбщийПоЗаданию,,, Ложь);
	КонецЕсли;
	
	//время в работе основного ТС
	Если ТранспортноеСредство.Модель.НаличиеСпидометра Тогда
		Если мКоличествоЧасов = 0 Тогда
			ЗаписатьСтрокуВыработкиТС(ТранспортноеСредство, Справочники.уатПараметрыВыработки.ВремяВРаботе, мВремяВРаботе);
		КонецЕсли;
	Иначе
		мНаработка = уатОбщегоНазначения.уатПоказанияСчетчикаВСекунды(уатОбщегоНазначения.уатРазностьПоказанийСчетчика(
			СпидометрВыезда, СпидометрВозвращения));
		Если мКоличествоЧасов = 0 Тогда
			ЗаписатьСтрокуВыработкиТС(ТранспортноеСредство, Справочники.уатПараметрыВыработки.ВремяВРаботе, мНаработка);
		ИначеЕсли мНаработка > мКоличествоЧасов Тогда
			ЗаписатьСтрокуВыработкиТС(ТранспортноеСредство, Справочники.уатПараметрыВыработки.ВремяВРаботе, мНаработка -
				мКоличествоЧасов,,, Ложь);
		КонецЕсли;
	КонецЕсли;
	
	//теперь прицепы
	Для Каждого ТекСтрПрицепы из Прицепы Цикл
		Если ТекСтрПрицепы.ТС.ВидМоделиТС = перечисления.уатВидыМоделейТС.Автотранспорт
			ИЛИ ТекСтрПрицепы.ТС.ВидМоделиТС = перечисления.уатВидыМоделейТС.Прицеп Тогда
			//пробег общий
			ЗаписатьСтрокуВыработкиТС(ТекСтрПрицепы.ТС, Справочники.уатПараметрыВыработки.ПробегОбщий, мПробегОбщий);
			
			//пробег с грузом
			ЗаписатьСтрокуВыработкиТС(ТекСтрПрицепы.ТС, Справочники.уатПараметрыВыработки.ПробегСГрузом, мКоличествоКмСГрузом);
			
			//пробег порожний
			ЗаписатьСтрокуВыработкиТС(ТекСтрПрицепы.ТС, Справочники.уатПараметрыВыработки.ПробегПорожний, мПробегОбщий -
				мКоличествоКмСГрузом);
		КонецЕсли;	
		
		//время в работе
		Если ТекСтрПрицепы.ТС.Модель.НаличиеСпидометра Тогда
			Если мКоличествоЧасов = 0 Тогда
				ЗаписатьСтрокуВыработкиТС(ТекСтрПрицепы.ТС, Справочники.уатПараметрыВыработки.ВремяВРаботе, мВремяВРаботе,
					Подразделение, Контрагент);
			КонецЕсли;
		Иначе
			мНаработка = уатОбщегоНазначения.уатПоказанияСчетчикаВСекунды(уатОбщегоНазначения.уатРазностьПоказанийСчетчика(
				ТекСтрПрицепы.СчетчикМЧВыезда, ТекСтрПрицепы.СчетчикМЧВозвращения));
			ЗаписатьСтрокуВыработкиТС(ТекСтрПрицепы.ТС, Справочники.уатПараметрыВыработки.ВремяВРаботе, мНаработка);
		КонецЕсли;	
	КонецЦикла;
	
	Если НЕ уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(Организация,
			ПланыВидовХарактеристик.уатПраваИНастройки.УчетВыработкиПоКонтрагентам) Тогда
		ТЗ = ВыработкаТС.Выгрузить();
		ТЗ.ЗаполнитьЗначения(Неопределено, "Контрагент");
		ТЗ.Свернуть("ТС, ПараметрВыработки, Подразделение, Контрагент", "Количество");
		ВыработкаТС.Загрузить(ТЗ);
	КонецЕсли;
	
	Если НЕ уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(Организация,
			ПланыВидовХарактеристик.уатПраваИНастройки.УчетВыработкиПоПодразделениям) Тогда
		ТЗ = ВыработкаТС.Выгрузить();
		ТЗ.ЗаполнитьЗначения(Неопределено, "Подразделение");
		ТЗ.Свернуть("ТС, ПараметрВыработки, Подразделение, Контрагент", "Количество");
		ВыработкаТС.Загрузить(ТЗ);
	КонецЕсли;
	
	//количество ТС
	Если Справочники.уатПараметрыВыработки.КоличествоТС.ДействуетНаТС Тогда
		ЗаписатьСтрокуВыработкиТС(ТранспортноеСредство, Справочники.уатПараметрыВыработки.КоличествоТС, 1);
	КонецЕсли;

КонецПроцедуры

//Процедура рассчитывает время по путевому листу
//
Процедура РасчитатьВременныеПараметры() Экспорт
	тблРабочееВремя = Документы.уатПутевойЛист.РасчетВремени(ДатаВыезда, ДатаВозвращения, Организация, РежимРаботыТС, Простои.Выгрузить());
	тблРабочееВремя.Свернуть("ВидВремени", "Продолжительность");
	
	//работу и ночные часы берем из таблицы рабочего времени
	мВремяВРаботе = 0;
	мВремяНочь = 0;
	мВремяДень = 0;
	Для Каждого ТекСтрокаРабВремя Из тблРабочееВремя Цикл
		Если ТекСтрокаРабВремя.ВидВремени = Справочники.уатВидыИспользованияРабочегоВремени.Работа Тогда
			мВремяВРаботе = мВремяВРаботе + ТекСтрокаРабВремя.Продолжительность;
		ИначеЕсли ТекСтрокаРабВремя.ВидВремени = Справочники.уатВидыИспользованияРабочегоВремени.Ночные Тогда
			мВремяНочь = мВремяНочь + ТекСтрокаРабВремя.Продолжительность;
		ИначеЕсли ТекСтрокаРабВремя.ВидВремени = "Дневные" Тогда
			мВремяДень = мВремяДень + ТекСтрокаРабВремя.Продолжительность;;
		КонецЕсли;
	КонецЦикла;
	
	//простои - из таблицы простоев
	мВремяВПростое = 0;
	мВремяВПростоеСВклДвигателем = 0;
	Для Каждого ТекСтрока Из Простои Цикл
		мВремяВПростое = мВремяВПростое + (ТекСтрока.ВремяПростоя - НачалоДня(ТекСтрока.ВремяПростоя));
		Если ТекСтрока.ВключенДвигатель Тогда
			мВремяВПростоеСВклДвигателем = мВремяВПростоеСВклДвигателем + (ТекСтрока.ВремяПростоя -
				НачалоДня(ТекСтрока.ВремяПростоя));
		КонецЕсли;
	КонецЦикла;
	
	//общее количество дней по ПЛ
	мКоличествоДней = (НачалоДня(ДатаВозвращения) - НачалоДня(ДатаВыезда))/86400 + 1;
	
	//время в наряде
	Если ДатаВозвращения - ДатаВыезда > 86400 Тогда //многодневный ПЛ
		Если ЗначениеЗаполнено(РежимРаботыТС) Тогда
			мПродолжительностьРабочегоДня = РежимРаботыТС.КонецРаботы - РежимРаботыТС.НачалоРаботы;
			Если РежимРаботыТС.НачалоРаботы <= РежимРаботыТС.КонецРаботы Тогда //дневной
				мПродолжительностьРабочегоДня = РежимРаботыТС.КонецРаботы - РежимРаботыТС.НачалоРаботы;
			Иначе //ночной
				мПродолжительностьРабочегоДня = РежимРаботыТС.КонецРаботы + 86400 - РежимРаботыТС.НачалоРаботы;
			КонецЕсли;
		Иначе
			мПродолжительностьРабочегоДня = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(Организация, "ПродолжительностьРабочегоДня") - '00010101';
			Если мПродолжительностьРабочегоДня = 0 Тогда
				мПродолжительностьРабочегоДня = 86400;
			КонецЕсли;
		КонецЕсли;
		
		мВремяВНаряде = ?(ДатаВыезда - НачалоДня(ДатаВыезда) > 86400 - мПродолжительностьРабочегоДня,
			86400 -	(ДатаВыезда - НачалоДня(ДатаВыезда)), мПродолжительностьРабочегоДня)
		+ ?(ДатаВозвращения - НачалоДня(ДатаВозвращения) > мПродолжительностьРабочегоДня,
			мПродолжительностьРабочегоДня, ДатаВозвращения - НачалоДня(ДатаВозвращения))
		+ мПродолжительностьРабочегоДня*((НачалоДня(ДатаВозвращения) -
			НачалоДня(ДатаВыезда))/86400 - 1);
	Иначе //однодневный ПЛ
		мВремяВНаряде = ДатаВозвращения - ДатаВыезда;
	КонецЕсли;
КонецПроцедуры
