Процедура ЗаписатьДвижение(Статья, Период, Сумма)
	// регистр ОперативныйБюджет 
	//Движение                 = Движения.ОперативныйБюджет.Добавить();
	//Движение.Период          = Период;
	//Движение.Организация     = Организация;
	//Движение.СтатьяБюджета   = Статья;
	//Движение.План            = Сумма*?(ПланированиеВТысячах,1000,1);
	//
	Движение = Движения.ОборотыБюджетов.Добавить();
	Движение.Период = Период;
	Движение.Организация = Организация;
	Движение.СтатьяОборотов = Статья;
	
	Движение.Сценарий = ?(Сценарий.Пустая(),Справочники.СценарииПланирования.ОсновнойСценарийПанирования,Сценарий);
	Движение.Валюта   = Сценарий.Валюта;
	Движение.СуммаУпр = Сумма*?(ПланированиеВТысячах,1000,1);
	Движение.ВалютнаяСумма = Сумма*?(ПланированиеВТысячах,1000,1);
	Движение.СуммаСценария = Сумма*?(ПланированиеВТысячах,1000,1);
	
КонецПроцедуры	

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Перем Заголовок;
	СтруктураОбязательныхПолей = Новый Структура("Организация, Сценарий");
	
	//ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	// Проведем доходы
	//Для Каждого ТекСтрока Из Доходы Цикл
	//	ЗаписатьДвижение(ТекСтрока.СтатьяБюджета, Дата, ТекСтрока.Сумма1);//БюджетныйПериод
	//КонецЦикла;
	Для Каждого ТекСтрока Из Доходы Цикл
		
		Для i = 1 По 31 Цикл 
			
			Если ТекСтрока["Сумма" + i] > 0 Тогда 	
				
				ЗаписатьДвижение(ТекСтрока.СтатьяБюджета, БюджетныйПериод + (i-1)*24*60*60, ТекСтрока["Сумма" + i]);
				
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	// проведем расходы
	Для Каждого ТекСтрока Из Расходы Цикл
		ЗаписатьДвижение(ТекСтрока.СтатьяБюджета, Дата, ТекСтрока.Сумма);//БюджетныйПериод
	КонецЦикла;
		
КонецПроцедуры	