//Перем ВведенКопированием Экспорт;
//////////////////////////////////////////////////////////////////////////////////
//// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
////

//////////////////////////////////////////////////////////////////////////////////
//// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

//Функция  ПроверитьДоговор(Договор) Экспорт
//	
//	Просрочен = Ложь;
//	
//	Если Договор.СрокДействия = Дата('00010101') Тогда
//		Сообщить ("У договора: " + Договор.Наименование + " №" + Договор.Код + ", контрагент: " + Договор.Владелец.Наименование + ", не указан срок действия !" );
//	ИначеЕсли КонецДня(Договор.СрокДействия) < КонецДня(Дата) Тогда 
//		Сообщить ("У договора: " + Договор.Наименование + " №" + Договор.Код + ", контрагент: " + Договор.Владелец.Наименование + ", закончился срок действия !" );
//		Просрочен = Истина;
//	КонецЕсли;
//	
//	Возврат (Просрочен);
//	
//КонецФункции	

//Функция  ПолучитьТекстАдреса(Адрес) 
//	
//	Если Найти(Адрес, "Югра АО,") > 0 Тогда
//		стрАдрес = Прав(Адрес,СтрДлина(Адрес)-(Найти(Адрес, "Югра АО,")+8));
//	Иначе	
//		стрАдрес = Строка(Адрес);
//	КонецЕсли;
//	
//	Возврат (стрАдрес);
//	
//КонецФункции	

//Функция ПолучитьАдрес(Адрес)
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	МаршрутыАдреса.НомерСтроки КАК НомерСтроки,
//		|	МаршрутыАдреса.Адрес
//		|ИЗ
//		|	Справочник.Маршруты.Адреса КАК МаршрутыАдреса
//		|ГДЕ
//		|	МаршрутыАдреса.Ссылка = &Ссылка
//		|
//		|УПОРЯДОЧИТЬ ПО
//		|	НомерСтроки";
//	
//	Запрос.УстановитьПараметр("Ссылка", Адрес);
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
//	
//	стрАдрес = "";
//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
//		АдресКратко = ПолучитьТекстАдреса (ВыборкаДетальныеЗаписи.Адрес);
//		стрАдрес = стрАдрес + ВыборкаДетальныеЗаписи.НомерСтроки + ") " + АдресКратко + "; "+ Символы.ПС;
//	КонецЦикла;
//	
//	Возврат(стрАдрес);
//	
//КонецФункции

//// Процедура осуществляет печать документа. Можно направить печать на 
//// экран или принтер, а также распечатать необходимое количество копий.
////
////  Название макета печати передается в качестве параметра,
//// по переданному названию находим имя макета в соответствии.
////
//// Параметры:
////  НазваниеМакета - строка, название макета.
////
//Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
//	
//	ТабДок = Новый ТабличныйДокумент;	
//	
//	ЗапросШапка = Новый Запрос;
//	ЗапросШапка.Текст = 
//		"ВЫБРАТЬ
//		|	МаршрутныйЛист.Автомобиль.Наименование КАК Автомобиль,
//		|	МаршрутныйЛист.Водитель,
//		|	МаршрутныйЛист.Рабочий,
//		|	МаршрутныйЛист.Организация,
//		|	МаршрутныйЛист.Номер,
//		|	МаршрутныйЛист.Дата
//		|ИЗ
//		|	Документ.МаршрутныйЛист_ЮЦАУ КАК МаршрутныйЛист
//		|ГДЕ
//		|	МаршрутныйЛист.Ссылка = &Ссылка";
//	
//	ЗапросШапка.УстановитьПараметр("Ссылка", Ссылка);
//	
//	Шапка = ЗапросШапка.Выполнить().Выбрать();
//	
//	Шапка.Следующий();

//	Макет = ПолучитьМакет("МаршрутныйЛист");
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//	"ВЫБРАТЬ
//	|	МаршрутныйЛистМаршруты.НомерСтроки КАК НомСтр,
//	|	ПРЕДСТАВЛЕНИЕ(МаршрутныйЛистМаршруты.Контрагент) КАК Контрагент,
//	|	ПРЕДСТАВЛЕНИЕ(МаршрутныйЛистМаршруты.Договор) КАК Договор,
//	|	МаршрутныйЛистМаршруты.Адрес,
//	|	ВЫБОР
//	|		КОГДА МаршрутныйЛистМаршруты.Понедельник
//	|			ТОГДА ВЫБОР
//	|					КОГДА МаршрутныйЛистМаршруты.КоличествоКонтейнеров = 0
//	|						ТОГДА ""V""
//	|					ИНАЧЕ МаршрутныйЛистМаршруты.КоличествоКонтейнеров
//	|				КОНЕЦ
//	|		ИНАЧЕ ""-""
//	|	КОНЕЦ КАК Понедельник,
//	|	ВЫБОР
//	|		КОГДА МаршрутныйЛистМаршруты.Вторник
//	|			ТОГДА ВЫБОР
//	|					КОГДА МаршрутныйЛистМаршруты.КоличествоКонтейнеров = 0
//	|						ТОГДА ""V""
//	|					ИНАЧЕ МаршрутныйЛистМаршруты.КоличествоКонтейнеров
//	|				КОНЕЦ
//	|		ИНАЧЕ ""-""
//	|	КОНЕЦ КАК Вторник,
//	|	ВЫБОР
//	|		КОГДА МаршрутныйЛистМаршруты.Среда
//	|			ТОГДА ВЫБОР
//	|					КОГДА МаршрутныйЛистМаршруты.КоличествоКонтейнеров = 0
//	|						ТОГДА ""V""
//	|					ИНАЧЕ МаршрутныйЛистМаршруты.КоличествоКонтейнеров
//	|				КОНЕЦ
//	|		ИНАЧЕ ""-""
//	|	КОНЕЦ КАК Среда,
//	|	ВЫБОР
//	|		КОГДА МаршрутныйЛистМаршруты.Четверг
//	|			ТОГДА ВЫБОР
//	|					КОГДА МаршрутныйЛистМаршруты.КоличествоКонтейнеров = 0
//	|						ТОГДА ""V""
//	|					ИНАЧЕ МаршрутныйЛистМаршруты.КоличествоКонтейнеров
//	|				КОНЕЦ
//	|		ИНАЧЕ ""-""
//	|	КОНЕЦ КАК Четверг,
//	|	ВЫБОР
//	|		КОГДА МаршрутныйЛистМаршруты.Пятница
//	|			ТОГДА ВЫБОР
//	|					КОГДА МаршрутныйЛистМаршруты.КоличествоКонтейнеров = 0
//	|						ТОГДА ""V""
//	|					ИНАЧЕ МаршрутныйЛистМаршруты.КоличествоКонтейнеров
//	|				КОНЕЦ
//	|		ИНАЧЕ ""-""
//	|	КОНЕЦ КАК Пятница,
//	|	ВЫБОР
//	|		КОГДА МаршрутныйЛистМаршруты.Суббота
//	|			ТОГДА ВЫБОР
//	|					КОГДА МаршрутныйЛистМаршруты.КоличествоКонтейнеров = 0
//	|						ТОГДА ""V""
//	|					ИНАЧЕ МаршрутныйЛистМаршруты.КоличествоКонтейнеров
//	|				КОНЕЦ
//	|		ИНАЧЕ ""-""
//	|	КОНЕЦ КАК Суббота,
//	|	ВЫБОР
//	|		КОГДА МаршрутныйЛистМаршруты.Воскресенье
//	|			ТОГДА ВЫБОР
//	|					КОГДА МаршрутныйЛистМаршруты.КоличествоКонтейнеров = 0
//	|						ТОГДА ""V""
//	|					ИНАЧЕ МаршрутныйЛистМаршруты.КоличествоКонтейнеров
//	|				КОНЕЦ
//	|		ИНАЧЕ ""-""
//	|	КОНЕЦ КАК Воскресенье,
//	|	МаршрутныйЛистМаршруты.Периодичность,
//	|	МаршрутныйЛистМаршруты.Договор.Номер,
//	|	МаршрутныйЛистМаршруты.Договор.Дата,
//	|	ВЫБОР
//	|		КОГДА МаршрутныйЛистМаршруты.КоличествоКонтейнеров = 0
//	|			ТОГДА ""V""
//	|		ИНАЧЕ МаршрутныйЛистМаршруты.КоличествоКонтейнеров
//	|	КОНЕЦ КАК КоличествоКонтейнеров
//	|ИЗ
//	|	Документ.МаршрутныйЛист_ЮЦАУ.Маршруты КАК МаршрутныйЛистМаршруты
//	|ГДЕ
//	|	МаршрутныйЛистМаршруты.Ссылка = &Ссылка";
//	
//	Запрос.Параметры.Вставить("Ссылка",Ссылка);
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
//	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
//	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
//	ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
//	ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");
//	
//	ТабДок.Очистить();
//	
//	ОбластьЗаголовок.Параметры.Заголовок = "МАРШРУТНЫЙ ЛИСТ № " + Шапка.Номер + " на " + Формат(Шапка.Дата,"ДЛФ=DD" );
//	ОбластьЗаголовок.Параметры.Автомобиль = Шапка.Автомобиль;
//	ОбластьЗаголовок.Параметры.Водитель = ОбщегоНазначения.ФамилияИнициалыФизЛица(Водитель);
//	
//	ТабДок.Вывести(ОбластьЗаголовок);
//	ТабДок.Вывести(ОбластьШапкаТаблицы);
//	ТабДок.НачатьАвтогруппировкуСтрок();
//	
//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
//	
//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
//		ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
//		ОбластьДетальныхЗаписей.Параметры.Договор = " № " + Строка(ВыборкаДетальныеЗаписи.ДоговорНомер) + " от " + Строка(Формат(ВыборкаДетальныеЗаписи.ДоговорДата,"ДФ=dd.MM.yyyy")); 
//		ОбластьДетальныхЗаписей.Параметры.Адрес = ПолучитьАдрес(ВыборкаДетальныеЗаписи.Адрес); 
//		ТабДок.Вывести(ОбластьДетальныхЗаписей, ВыборкаДетальныеЗаписи.Уровень());
//	КонецЦикла;
//	
//	ТабДок.ЗакончитьАвтогруппировкуСтрок();
//	
//	ТабДок.Вывести(ОбластьПодвалТаблицы);
//	
//	ОбластьПодвал.Параметры.Водитель = ОбщегоНазначения.ФамилияИнициалыФизЛица(Водитель);
//	ОбластьПодвал.Параметры.Рабочий = ОбщегоНазначения.ФамилияИнициалыФизЛица(Рабочий);
//	
//	ТабДок.Вывести(ОбластьПодвал);
//	
//	// Получить экземпляр документа на печать
//	УниверсальныеМеханизмы.НапечататьДокумент(ТабДок, КоличествоЭкземпляров, НаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект,"Кадровое перемещение "), НепосредственнаяПечать);
//	
//КонецПроцедуры // Печать

//// Возвращает доступные варианты печати документа
////
//// Возвращаемое значение:
////  Структура, каждая строка которой соответствует одному из вариантов печати
////  
//Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
//	
//	Возврат Новый Структура("МаршрутныйЛист","Маршрутный лист");
//	
//	
//КонецФункции // ПолучитьСтруктуруПечатныхФорм()

//Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
//	
//	Если ОбменДанными.Загрузка Тогда
//		Возврат;
//	КонецЕсли;
//	
//КонецПроцедуры

//Процедура ПриКопировании(ОбъектКопирования)
//	
//	ВведенКопированием = Истина;
//	
//КонецПроцедуры

//Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
//КонецПроцедуры

//Процедура ОбработкаПроведения(Отказ, РежимПроведения)
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//	"ВЫБРАТЬ
//	|	МаршрутныйЛист_ЮЦАУМаршруты.Договор
//	|ИЗ
//	|	Документ.МаршрутныйЛист_ЮЦАУ.Маршруты КАК МаршрутныйЛист_ЮЦАУМаршруты
//	|ГДЕ
//	|	МаршрутныйЛист_ЮЦАУМаршруты.Ссылка = &Ссылка";
//	
//	Запрос.УстановитьПараметр("Ссылка", Ссылка);
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
//	
//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
//		Отказ = ПроверитьДоговор(ВыборкаДетальныеЗаписи.Договор)
//	КонецЦикла;
//	
//КонецПроцедуры







