
&НаКлиенте
Процедура ОК(Команда)
	
	ТабИзменения=Новый Соответствие;

	БазовоеЗначение=БазовыйКоэффициент;

	Для Индекс=1 По КоличествоПериодовРаспределения Цикл
		
		НомерПериода=СмещениеПервогоПериодаРаспределения+Индекс-1;

		Если ТипРаспределения=ПредопределенноеЗначение("Перечисление.ВидыРаспределенияЗначенийБюджетирования.ПоПериодамСИзменением") Тогда

			Если ТипИзменения=ПредопределенноеЗначение("Перечисление.ВидыИзмененийПоПериодамБюджетирования.ЦепноеИзменение") Тогда
				БазовоеЗначение=БазовоеЗначение+БазовоеЗначение*ПриращениеЗаПериод;
                Коэффициент=БазовоеЗначение;
			 Иначе
				Коэффициент=БазовоеЗначение+ПриращениеЗаПериод*Индекс;
			КонецЕсли;
		 Иначе
			Коэффициент=1/КоличествоПериодовРаспределения;
 		КонецЕсли;
  		ТабИзменения.Вставить(НомерПериода,Коэффициент);
	КонецЦикла;

	СтруктураИзменений=Новый Структура;

	СтруктураНастройки=Новый Структура;
	СтруктураНастройки.Вставить("БазовыйКоэффициент"					,БазовыйКоэффициент);
	СтруктураНастройки.Вставить("КоличествоПериодовРаспределения"		,КоличествоПериодовРаспределения);
	СтруктураНастройки.Вставить("ПриращениеЗаПериод"					,ПриращениеЗаПериод);
	СтруктураНастройки.Вставить("ТипРаспределения"						,ТипРаспределения);
    СтруктураНастройки.Вставить("СмещениеПервогоПериодаРаспределения"	,СмещениеПервогоПериодаРаспределения);
	СтруктураНастройки.Вставить("ТипИзменения"							,ТипИзменения);

	СтруктураИзменений.Вставить("СтруктураНастроек"	,СтруктураНастройки);
	СтруктураИзменений.Вставить("Данные"	,ТабИзменения);
	
	Закрыть(СтруктураИзменений);
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("СтруктураНастроек") Тогда
		Если ТипЗнч(Параметры.СтруктураНастроек) = Тип("Структура") Тогда
			ЗаполнитьЗначенияСвойств(ЭтаФорма,Параметры.СтруктураНастроек);
			СтруктураНастроек = Параметры.СтруктураНастроек;
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры
