
&ИзменениеИКонтроль("ЗаписатьВыработкуСотрудникаРабочееВремя")
Процедура Бит_ЗаписатьВыработкуСотрудникаРабочееВремя(мСотрудник, флЗамещать)
	мВремяДеньСотрудника = 0;
	мВремяНочьСотрудника = 0;
	мВремяВыходнойСотрудника = 0;
	мВремяПраздникСотрудника = 0;
	мВремяВРаботеСотрудника = 0;
	Для Каждого ТекСтрока Из ФактическиОтработанноеВремя Цикл
		Если ТекСтрока.Сотрудник = мСотрудник Тогда
			мВремяДеньСотрудника = мВремяДеньСотрудника + ТекСтрока.ВремяДневное;
			мВремяНочьСотрудника = мВремяНочьСотрудника + ТекСтрока.ВремяНочное;
			мВремяВРаботеСотрудника = мВремяВРаботеСотрудника + ТекСтрока.ВремяДневное + ТекСтрока.ВремяНочное;

			флПраздник = уатПутевыеЛисты.ПраздникПоГрафику(ТекСтрока.Сотрудник, Организация, ТекСтрока.Дата);
			Если флПраздник Тогда
				мВремяПраздникСотрудника = мВремяПраздникСотрудника + ТекСтрока.ВремяДневное + ТекСтрока.ВремяНочное;
			Иначе
				флВыходной = уатПутевыеЛисты.ВыходнойПоГрафику(ТекСтрока.Сотрудник, Организация, ТекСтрока.Дата);
				Если флВыходной Тогда
					мВремяВыходнойСотрудника = мВремяВыходнойСотрудника + ТекСтрока.ВремяДневное + ТекСтрока.ВремяНочное;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	// время в наряде
	ЗаписатьСтрокуВыработкиСотрудника(мСотрудник, Справочники.уатПараметрыВыработки.ВремяВНаряде, мВремяВНаряде,, флЗамещать, флЗамещать);
	
	#Вставка
	// + бит Петянина А.К., 20.04.26
	мЧасовВРаботеПоЗаданию = ЭтотОбъект.Задание.Итог("КоличествоЧасов");
	//мВремяВРаботеСотрудника = Цел(мЧасовВРаботеПоЗаданию) * 3600 + (мЧасовВРаботеПоЗаданию - Цел(мЧасовВРаботеПоЗаданию)) * 100 * 60; 
	// - бит Петянина А.К., 20.04.26 
	#КонецВставки
	// время в работе
	ЗаписатьСтрокуВыработкиСотрудника(мСотрудник, Справочники.уатПараметрыВыработки.ВремяВРаботе, мВремяВРаботеСотрудника,, флЗамещать, флЗамещать);

	// время в работе в выходной
	ЗаписатьСтрокуВыработкиСотрудника(мСотрудник, Справочники.уатПараметрыВыработки.ВремяРаботыВВыходныеДни, мВремяВыходнойСотрудника,, флЗамещать, флЗамещать);

	// время в работе в праздник
	ЗаписатьСтрокуВыработкиСотрудника(мСотрудник, Справочники.уатПараметрыВыработки.ВремяПраздничное, мВремяПраздникСотрудника,, флЗамещать, флЗамещать);

	// время дневное
	ЗаписатьСтрокуВыработкиСотрудника(мСотрудник, Справочники.уатПараметрыВыработки.ВремяДневное, мВремяДеньСотрудника,, флЗамещать, флЗамещать);

	// время ночное
	ЗаписатьСтрокуВыработкиСотрудника(мСотрудник, Справочники.уатПараметрыВыработки.ВремяНочное, мВремяНочьСотрудника,, флЗамещать, флЗамещать);
КонецПроцедуры

&ИзменениеИКонтроль("РасчетФОВ")
Процедура Бит_РасчетФОВ(ВыполнитьПринудительно)
	Если НеВыполнятьАвтоРасчетФОВ И (НЕ ВыполнитьПринудительно) Тогда
		Возврат;
	КонецЕсли;

	ФактическиОтработанноеВремя.Очистить();

	тблРабочееВремя = уатПутевыеЛисты.РасчетВремени(ДатаВыезда, ДатаВозвращения, Организация, РежимРаботыТС, Простои.Выгрузить());

	// составим список задействованных сотрудников
	мсвСотрудники = Новый Массив;
	мсвСотрудники.Добавить(Водитель1);
	Если ЗначениеЗаполнено(Водитель2) Тогда
		мсвСотрудники.Добавить(Водитель2);
	КонецЕсли;	
	Если ЗначениеЗаполнено(Сотрудник1) Тогда
		мсвСотрудники.Добавить(Сотрудник1);
	КонецЕсли;	
	Если ЗначениеЗаполнено(Сотрудник2) Тогда
		мсвСотрудники.Добавить(Сотрудник2);
	КонецЕсли;	

	ВидыИспользованияРабочегоВремени_Явка = "Дневные";
	ВидыИспользованияРабочегоВремени_РаботаНочныеЧасы = Справочники.уатВидыИспользованияРабочегоВремени.РаботаНочныеЧасы;

	Для Каждого ТекСотрудник Из мсвСотрудники Цикл
		Для Каждого ТекСтрока Из тблРабочееВремя Цикл
			Если ТекСтрока.ВидВремени <> ВидыИспользованияРабочегоВремени_Явка
				И ТекСтрока.ВидВремени <> ВидыИспользованияРабочегоВремени_РаботаНочныеЧасы
				ИЛИ ТекСтрока.Продолжительность = 0 Тогда
				Продолжить;
			КонецЕсли;

			НоваяСтрока = ФактическиОтработанноеВремя.Добавить();
			НоваяСтрока.Дата = ТекСтрока.ДатаРаботы;
			НоваяСтрока.Сотрудник = ТекСотрудник;
			Если ТекСтрока.ВидВремени = ВидыИспользованияРабочегоВремени_Явка Тогда
				НоваяСтрока.ВремяДневное = ТекСтрока.Продолжительность;
			ИначеЕсли ТекСтрока.ВидВремени = ВидыИспользованияРабочегоВремени_РаботаНочныеЧасы Тогда
				НоваяСтрока.ВремяНочное = ТекСтрока.Продолжительность;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;

	ФактическиОтработанноеВремя.Свернуть("Сотрудник, Дата", "ВремяДневное, ВремяНочное");
	
	#Вставка
	// + бит Петянина А.К 20.04.26
	Если ЭтотОбъект.ВидПЛ = Перечисления.уатВидыПЛ._6 Тогда
		стОбед = уатПутевыеЛисты.ДанныеОбедаПоЗаданию(ЭтотОбъект.Задание); 
		уатПутевыеЛисты.ДоработатьТЧФОВ(ЭтотОбъект.ФактическиОтработанноеВремя, стОбед);	
	КонецЕсли;
	
	// Включение по подразделению водителя Водитель1 и дате документа.
	Если уатПутевыеЛисты.НовыйРасчетВремениСменыВключен(Водитель1, Дата) Тогда
		Если уатПутевыеЛисты.ПутевойЛистТолькоДляСливаТоплива(Ссылка, Задание) Тогда
			ФактическиОтработанноеВремя.Очистить();
		Иначе
			уатПутевыеЛисты.ОтнестиЧасыНочнойСменыНаДатуВыезда(ФактическиОтработанноеВремя, ДатаВыезда, ДатаВозвращения);
		КонецЕсли;
	КонецЕсли;
	// - бит Петянина А.К 20.04.26
	#КонецВставки
	//// сейчас в таблице время дневное - это время в работе.
	//// корректируем дневное время = время в работе - время ночное
	//Для Каждого ТекСтрока Из ФактическиОтработанноеВремя Цикл
	//	ТекСтрока.ВремяДневное = ТекСтрока.ВремяДневное - ТекСтрока.ВремяНочное;
	//КонецЦикла;
КонецПроцедуры

&ИзменениеИКонтроль("РасчетРасходаТЖ")
Процедура Бит_РасчетРасходаТЖ()
	// обнулим расход ТЖ 
	Для Каждого ТекСтрокаРасходГСМ Из РасходГСМ Цикл
		Если уатГСМ.ЭтоТехническаяЖидкость(ТекСтрокаРасходГСМ.ГСМ) Тогда
			ТекСтрокаРасходГСМ.РасходПоНорме = 0;
			#Удаление
			Если РасчетФактРасходаГСМ = Перечисления.уатВидыРасчетаРасходаГСМ.ПоНорме
				ИЛИ РасчетФактРасходаГСМ = Перечисления.уатВидыРасчетаРасходаГСМ.ПоGPS
				ИЛИ РасчетФактРасходаГСМ = Перечисления.уатВидыРасчетаРасходаГСМ.ПоGPSОстаток Тогда 
			#КонецУдаления
			#Вставка
			//Возврат к функционалу старой версии
			Если РасчетФактРасходаГСМ <> перечисления.уатВидыРасчетаРасходаГСМ.НеРассчитывать Тогда
			#КонецВставки
				ТекСтрокаРасходГСМ.РасходПоФакту = 0;
			КонецЕсли;
			ТекСтрокаРасходГСМ.Активен = Ложь;
		КонецЕсли;
	КонецЦикла;

	Если уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(Организация, ПланыВидовХарактеристик.уатПраваИНастройки.ИспользоватьУчетНормативногоРасходаТехЖидкостей) = ЛОЖЬ Тогда
		Возврат;
	КонецЕсли;

	// получим нормы расхода тех. жидкостей
	мсвТС = Новый Массив;
	мсвТС.Добавить(ТранспортноеСредство);
	Для Каждого ТекСтрока Из Прицепы Цикл
		мсвТС.Добавить(ТекСтрока.ТС);
	КонецЦикла;
	Для Каждого ТекСтрока Из Задание Цикл
		мсвТС.Добавить(ТекСтрока.Прицеп1);
		мсвТС.Добавить(ТекСтрока.Прицеп2);
	КонецЦикла;
	тблНормыРасходаТЖ = уатОбщегоНазначения.ПолучитьНормыРасходаТЖ(мсвТС, ДатаВозвращения);

	// свернем все прицепы в одну табличку
	тблПрицепы = Новый ТаблицаЗначений;
	тблПрицепы.Колонки.Добавить("ТС");
	тблПрицепы.Колонки.Добавить("Моточасы");
	Для Каждого ТекПрицеп Из Прицепы Цикл
		Если ЗначениеЗаполнено(ТекПрицеп.ТС) Тогда
			СтрокаПрицепа = тблПрицепы.Найти(ТекПрицеп.ТС, "ТС");
			Если СтрокаПрицепа = Неопределено Тогда
				СтрокаПрицепа = тблПрицепы.Добавить();
				СтрокаПрицепа.ТС = ТекПрицеп.ТС;
				СтрокаПрицепа.Моточасы = 0;
			КонецЕсли;
			СтрокаПрицепа.Моточасы = СтрокаПрицепа.Моточасы + уатОбщегоНазначения.уатРазностьПоказанийСчетчика(
			ТекПрицеп.СчетчикМЧВыезда, ТекПрицеп.СчетчикМЧВозвращения);
		КонецЕсли;
	КонецЦикла;
	Для Каждого ТекЗадание Из Задание Цикл
		Если ЗначениеЗаполнено(ТекЗадание.Прицеп1) Тогда
			СтрокаПрицепа = тблПрицепы.Найти(ТекЗадание.Прицеп1, "ТС");
			Если СтрокаПрицепа = Неопределено Тогда
				СтрокаПрицепа = тблПрицепы.Добавить();
				СтрокаПрицепа.ТС = ТекЗадание.Прицеп1;
				СтрокаПрицепа.Моточасы = 0;
			КонецЕсли;
			СтрокаПрицепа.Моточасы = СтрокаПрицепа.Моточасы + ТекЗадание.КоличествоЧасовПрицеп1;
		КонецЕсли;
		Если ЗначениеЗаполнено(ТекЗадание.Прицеп2) Тогда
			СтрокаПрицепа = тблПрицепы.Найти(ТекЗадание.Прицеп2, "ТС");
			Если СтрокаПрицепа = Неопределено Тогда
				СтрокаПрицепа = тблПрицепы.Добавить();
				СтрокаПрицепа.ТС = ТекЗадание.Прицеп2;
				СтрокаПрицепа.Моточасы = 0;
			КонецЕсли;
			СтрокаПрицепа.Моточасы = СтрокаПрицепа.Моточасы + ТекЗадание.КоличествоЧасовПрицеп2;
		КонецЕсли;
	КонецЦикла;

	ОбщийПробегНаработка = уатОбщегоНазначения.уатРазностьПоказанийСчетчика(СпидометрВыезда, СпидометрВозвращения);

	// перебираем все строки расхода ТЖ
	Для Каждого ТекСтрокаТЖ Из РасходГСМ Цикл
		Если НЕ уатГСМ.ЭтоТехническаяЖидкость(ТекСтрокаТЖ.ГСМ) Тогда
			Продолжить;
		КонецЕсли;

		мсвНормыРасходаТЖ = тблНормыРасходаТЖ.НайтиСтроки(Новый Структура("МодельТС, ГСМ", ТекСтрокаТЖ.ТС, ТекСтрокаТЖ.ГСМ));
		Если мсвНормыРасходаТЖ.Количество() = 0 Тогда
			мсвНормыРасходаТЖ = тблНормыРасходаТЖ.НайтиСтроки(Новый Структура("МодельТС, ГСМ", ТекСтрокаТЖ.ТС.Модель, ТекСтрокаТЖ.ГСМ));
		КонецЕсли;
		Если мсвНормыРасходаТЖ.Количество() > 0 Тогда
			НормыРасходаТЖ = мсвНормыРасходаТЖ[0];

			СтрокаРасходГСМОснТопливо = РасходГСМ.Найти(ТекСтрокаТЖ.ТС.Модель.ОсновноеТопливо, "ГСМ");
			Если ЗначениеЗаполнено(ТекСтрокаТЖ.ТС.Модель.ДополнительноеТопливо) Тогда
				СтрокаРасходГСМДопТопливо = РасходГСМ.Найти(ТекСтрокаТЖ.ТС.Модель.ДополнительноеТопливо, "ГСМ");
			Иначе
				СтрокаРасходГСМДопТопливо = Неопределено;
			КонецЕсли;

			// норму на осн. и доп. топливо считаем и для одометра и для счетчика моточасов
			#Удаление
			Если СтрокаРасходГСМОснТопливо <> Неопределено И ЗначениеЗаполнено(НормыРасходаТЖ.Норма) Тогда
				ТекСтрокаТЖ.РасходПоНорме = СтрокаРасходГСМОснТопливо.РасходПоНорме * НормыРасходаТЖ.Норма / 100;
				Если РасчетФактРасходаГСМ = Перечисления.уатВидыРасчетаРасходаГСМ.ПоНорме Тогда
					ТекСтрокаТЖ.РасходПоФакту = СтрокаРасходГСМОснТопливо.РасходПоФакту * НормыРасходаТЖ.Норма / 100;
				КонецЕсли;
			КонецЕсли;
			Если СтрокаРасходГСМДопТопливо <> Неопределено И ЗначениеЗаполнено(НормыРасходаТЖ.НормаНаДопТопливо) Тогда
				ТекСтрокаТЖ.РасходПоНорме = ТекСтрокаТЖ.РасходПоНорме 
				+ СтрокаРасходГСМДопТопливо.РасходПоНорме * НормыРасходаТЖ.НормаНаДопТопливо / 100;
				Если РасчетФактРасходаГСМ = Перечисления.уатВидыРасчетаРасходаГСМ.ПоНорме Тогда
					ТекСтрокаТЖ.РасходПоФакту = ТекСтрокаТЖ.РасходПоФакту
					+ СтрокаРасходГСМДопТопливо.РасходПоФакту * НормыРасходаТЖ.НормаНаДопТопливо / 100;
				КонецЕсли;
			КонецЕсли;

			Если ТекСтрокаТЖ.ТС.Модель.НаличиеСпидометра И ЗначениеЗаполнено(НормыРасходаТЖ.ЛинейнаяНорма) Тогда
				ТекСтрокаТЖ.РасходПоНорме = ТекСтрокаТЖ.РасходПоНорме + ОбщийПробегНаработка * НормыРасходаТЖ.ЛинейнаяНорма / 100;
				Если РасчетФактРасходаГСМ = Перечисления.уатВидыРасчетаРасходаГСМ.ПоНорме Тогда
					ТекСтрокаТЖ.РасходПоФакту = ТекСтрокаТЖ.РасходПоНорме;
				КонецЕсли;
			ИначеЕсли НЕ ТекСтрокаТЖ.ТС.Модель.НаличиеСпидометра И ЗначениеЗаполнено(НормыРасходаТЖ.НормаНаМоточас) Тогда
				Если ТекСтрокаТЖ.ТС <> ТранспортноеСредство Тогда // это прицеп или оборудование из ТЧ Прицепы
					ТекСтрокаПрицепа = тблПрицепы.Найти(ТекСтрокаТЖ.ТС, "ТС");
					Если ТекСтрокаПрицепа <> Неопределено Тогда
						ОбщийПробегНаработка = ТекСтрокаПрицепа.Моточасы;
					КонецЕсли;
				КонецЕсли;
				ТекСтрокаТЖ.РасходПоНорме = ТекСтрокаТЖ.РасходПоНорме + ОбщийПробегНаработка * НормыРасходаТЖ.НормаНаМоточас;
				Если РасчетФактРасходаГСМ = Перечисления.уатВидыРасчетаРасходаГСМ.ПоНорме Тогда
					ТекСтрокаТЖ.РасходПоФакту = ТекСтрокаТЖ.РасходПоНорме;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли; 
		#КонецУдаления
		#Вставка
		//Возврат к функционалу старой версии
		Если СтрокаРасходГСМОснТопливо <> Неопределено И ЗначениеЗаполнено(НормыРасходаТЖ.Норма) Тогда
			ТекСтрокаТЖ.РасходПоНорме = СтрокаРасходГСМОснТопливо.РасходПоНорме * НормыРасходаТЖ.Норма / 100;
			ТекСтрокаТЖ.РасходПоФакту = СтрокаРасходГСМОснТопливо.РасходПоФакту * НормыРасходаТЖ.Норма / 100;
		КонецЕсли;
		Если СтрокаРасходГСМДопТопливо <> Неопределено И ЗначениеЗаполнено(НормыРасходаТЖ.НормаНаДопТопливо) Тогда
			ТекСтрокаТЖ.РасходПоНорме = ТекСтрокаТЖ.РасходПоНорме 
				+ СтрокаРасходГСМДопТопливо.РасходПоНорме * НормыРасходаТЖ.НормаНаДопТопливо / 100;
			ТекСтрокаТЖ.РасходПоФакту = ТекСтрокаТЖ.РасходПоФакту
				+ СтрокаРасходГСМДопТопливо.РасходПоФакту * НормыРасходаТЖ.НормаНаДопТопливо / 100;
		КонецЕсли;
		
		Если ТекСтрокаТЖ.ТС.Модель.НаличиеСпидометра И ЗначениеЗаполнено(НормыРасходаТЖ.ЛинейнаяНорма) Тогда
			ТекСтрокаТЖ.РасходПоНорме = ТекСтрокаТЖ.РасходПоНорме + ОбщийПробегНаработка * НормыРасходаТЖ.ЛинейнаяНорма / 100;
			ТекСтрокаТЖ.РасходПоФакту = ТекСтрокаТЖ.РасходПоНорме;
		ИначеЕсли НЕ ТекСтрокаТЖ.ТС.Модель.НаличиеСпидометра И ЗначениеЗаполнено(НормыРасходаТЖ.НормаНаМоточас) Тогда
			Если ТекСтрокаТЖ.ТС <> ТранспортноеСредство Тогда // это прицеп или оборудование из ТЧ Прицепы
				ТекСтрокаПрицепа = тблПрицепы.Найти(ТекСтрокаТЖ.ТС, "ТС");
				Если ТекСтрокаПрицепа <> Неопределено Тогда
					ОбщийПробегНаработка = ТекСтрокаПрицепа.Моточасы;
				КонецЕсли;
			КонецЕсли;
			ТекСтрокаТЖ.РасходПоНорме = ТекСтрокаТЖ.РасходПоНорме + ОбщийПробегНаработка * НормыРасходаТЖ.НормаНаМоточас;
			ТекСтрокаТЖ.РасходПоФакту = ТекСтрокаТЖ.РасходПоНорме;
		КонецЕсли; 
		КонецЕсли; 
		#КонецВставки

		//СтрокиПоискаТЖ[0].ОстатокПриВыезде = уатОбщегоНазначения_проф.ОстатокТЖнаТС(ТекСтрокаТЖ.ТС, ТекСтрокаТЖ.ГСМ, ДатаВыезда);

		Если уатГСМ.УчитыватьОстаткиТЖ(ТекСтрокаТЖ.ГСМ) Тогда
			//Если РасчетФактРасходаГСМ = Перечисления.уатВидыРасчетаРасходаГСМ.ПоНорме
			//	ИЛИ РасчетФактРасходаГСМ = Перечисления.уатВидыРасчетаРасходаГСМ.ПоGPS
			//	ИЛИ РасчетФактРасходаГСМ = Перечисления.уатВидыРасчетаРасходаГСМ.ПоGPSОстаток Тогда
			ТекСтрокаТЖ.ОстатокПриВозвращении = ТекСтрокаТЖ.ОстатокПриВыезде - ТекСтрокаТЖ.РасходПоФакту
			+ ТекСтрокаТЖ.Выдано - ТекСтрокаТЖ.Сдано;
			//ИначеЕсли РасчетФактРасходаГСМ = Перечисления.уатВидыРасчетаРасходаГСМ.ПоGPSОстаток Тогда
			//	ТекСтрокаТЖ.РасходПоФакту = ТекСтрокаТЖ.ОстатокПриВыезде - ТекСтрокаТЖ.ОстатокПриВозвращении
			//		+ ТекСтрокаТЖ.Выдано - ТекСтрокаТЖ.Сдано;
			//КонецЕсли;
		КонецЕсли;

		Если ТекСтрокаТЖ.РасходПоФакту > 0 Тогда
			ТекСтрокаТЖ.Активен = Истина;
		КонецЕсли;
	КонецЦикла;

	уатПутевыеЛисты.ПересчетВыданногоГСМ(ЭтотОбъект);
	ПересчетСданногоГСМ();

КонецПроцедуры
