
&НаКлиенте
Процедура ТипБюджетаПриИзменении(Элемент)
	ТипБюджетаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТипБюджетаПриИзмененииНаСервере()
	
	ВыбранныйЭлемент = Объект.ТипБюджета;
	Если ВыбранныйЭлемент.Уровень() <> 0 Тогда
		Если ВыбранныйЭлемент.ПринадлежитЭлементу(Справочники.СтатьиОборотовПоБюджетам.ДДС) Тогда
			Объект.ТипБюджета = Справочники.СтатьиОборотовПоБюджетам.ДДС;
		ИначеЕсли ВыбранныйЭлемент.ПринадлежитЭлементу(Справочники.СтатьиОборотовПоБюджетам.БДР) Тогда
			Объект.ТипБюджета = Справочники.СтатьиОборотовПоБюджетам.БДР;
		Иначе
			Объект.ТипБюджета = Справочники.СтатьиОборотовПоБюджетам.ПустаяСсылка();
	    КонецЕсли;
	КонецЕсли;
	
	//Перем СтарыйВладелец, СтарыйЗакрыватьПриВыборе;
	//
	//Если ФормаИнициатор = Неопределено Тогда
	//	ФормаИнициатор = ПолучитьФорму("Документ.ПланированиеБюджета.Форма.ФормаДокументаУФ", ЭлементУправления);
	//Иначе
	//	СтарыйВладелец = ФормаИнициатор.ВладелецФормы;
	//	СтарыйЗакрыватьПриВыборе = ФормаИнициатор.ЗакрыватьПриВыборе;
	//	ФормаИнициатор.ВладелецФормы = ЭлементУправления;
	//	ФормаИнициатор.ЗакрыватьПриВыборе = Ложь;
	//КонецЕсли;
	//ФормаИнициатор.ОповеститьОВыборе(Значение); 
	//Если СтарыйЗакрыватьПриВыборе <> Неопределено Тогда
	//	ФормаИнициатор.ВладелецФормы = СтарыйВладелец;
	//	ФормаИнициатор.ЗакрыватьПриВыборе = СтарыйЗакрыватьПриВыборе;
	//КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПериод() ЭКСПОРТ
	
	СтрПериодОтчета = ПредставлениеПериода(НачалоДня(мДатаНачалаПериодаОтчета), КонецДня(мДатаКонцаПериодаОтчета), "ФП = Истина" );
	// Покажем период в диалоге
	ЭтаФорма.Элементы.НадписьБюджетныйПериод.Заголовок = СтрПериодОтчета;
	
КонецПроцедуры // ПоказатьПериод()

&НаКлиенте
Процедура УстановитьПериод(Шаг)
	
	мДатаКонцаПериодаОтчета  = КонецМесяца(ДобавитьМесяц(мДатаКонцаПериодаОтчета, Шаг)); 
	мДатаНачалаПериодаОтчета = НачалоМесяца(мДатаКонцаПериодаОтчета);
	
	Объект.БюджетныйПериод = мДатаНачалаПериодаОтчета;
	
	ПоказатьПериод();
	
КонецПроцедуры

&НаКлиенте
Процедура ПролистатьПериодВМинус(Команда)
	УстановитьПериод(-1);
КонецПроцедуры

&НаКлиенте
Процедура ПролистатьПериодВПлюс(Команда)
	УстановитьПериод(1);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Параметры.Ключ.Пустая() Тогда // проверить объект на то, что он еще не внесен в ИБ
		// Заполнить реквизиты значениями по умолчанию.
		//ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект, глЗначениеПеременной("глТекущийПользователь"));
		Объект.БюджетныйПериод = НачалоМесяца(Объект.Дата);
		
	КонецЕсли;

	мДатаНачалаПериодаОтчета = НачалоМесяца(Объект.БюджетныйПериод);
	мДатаКонцаПериодаОтчета  = КонецМесяца(Объект.БюджетныйПериод);
	
	ПоказатьПериод();

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.БюджетныйПериод = НачалоМесяца(Объект.Дата);
	мДатаНачалаПериодаОтчета = НачалоМесяца(Объект.БюджетныйПериод);
	мДатаКонцаПериодаОтчета  = КонецМесяца(Объект.БюджетныйПериод);

	СтрПериодОтчета = ПредставлениеПериода(НачалоДня(мДатаНачалаПериодаОтчета), КонецДня(мДатаКонцаПериодаОтчета), "ФП = Истина" );
	// Покажем период в диалоге
	ЭтаФорма.Элементы.НадписьБюджетныйПериод.Заголовок = СтрПериодОтчета;

КонецПроцедуры

&НаКлиенте
Процедура ДоходыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	Если ПолучитьДоходыРасходыСтатьи(Элемент.ТекущиеДанные.СтатьяБюджета) = -1 Тогда
		Сообщить("Расходы необходимо вводить на вкладке РАСХОДЫ", СтатусСообщения.Важное);
		Отказ = Истина;
	КонецЕсли;	 
	Если (НЕ Элемент.ТекущиеДанные.СтатьяБюджета.Пустая()) И (НЕ ПринадлежитЭлементу(Элемент.ТекущиеДанные.СтатьяБюджета, Объект.ТипБюджета)) Тогда
		Сообщить("Введенный элемент не соответсвует типу бюджета", СтатусСообщения.Важное);
		Отказ = Истина;
	КонецЕсли;	 

КонецПроцедуры

&НаКлиенте
Процедура РасходыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	Если ПолучитьДоходыРасходыСтатьи(Элемент.ТекущиеДанные.СтатьяБюджета) = 1 Тогда
		Сообщить("Доходы необходимо вводить на вкладке ДОХОДЫ", СтатусСообщения.Важное);
		Отказ = Истина;
	КонецЕсли;	 
	Если (НЕ Элемент.ТекущиеДанные.СтатьяБюджета.Пустая()) И (НЕ ПринадлежитЭлементу(Элемент.ТекущиеДанные.СтатьяБюджета, Объект.ТипБюджета)) Тогда
		Сообщить("Введенный элемент не соответсвует типу бюджета", СтатусСообщения.Важное);
		Отказ = Истина;
	КонецЕсли;	 

КонецПроцедуры

&НаСервере
Функция ПринадлежитЭлементу(СтатьяБюджета, ТипБюджета)
	
	Принадлежит = Ложь;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	СтатьиОборотовПоБюджетам.Ссылка КАК Группа
	|ИЗ
	|	Справочник.СтатьиОборотовПоБюджетам КАК СтатьиОборотовПоБюджетам
	|ГДЕ
	|	СтатьиОборотовПоБюджетам.ЭтоГруппа
	|	И СтатьиОборотовПоБюджетам.Наименование = &ТипБюджета";
	Запрос.УстановитьПараметр("ТипБюджета", ТипБюджета.Наименование);    
	Результат = Запрос.Выполнить().Выгрузить();
	Если Результат.Количество()>0 Тогда
		Группа = Результат[0].Группа;
		Если СтатьяБюджета.ПринадлежитЭлементу(Группа) Тогда
			Принадлежит = Истина;
		КонецЕсли; 
	КонецЕсли;
	
	Возврат Принадлежит;
	
КонецФункции

&НаСервере
Функция ПолучитьДоходыРасходыСтатьи (СтатьяБюджета)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтатьиОборотовПоБюджетам.ДоходыРасходы
	|ИЗ
	|	Справочник.СтатьиОборотовПоБюджетам КАК СтатьиОборотовПоБюджетам
	|ГДЕ
	|	СтатьиОборотовПоБюджетам.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", СтатьяБюджета);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Пока РезультатЗапроса.Следующий() Цикл
		ДоходыРасходы = РезультатЗапроса.ДоходыРасходы;
	КонецЦикла;
	
	Возврат ДоходыРасходы;
КонецФункции


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Не ЗначениеЗаполнено(Объект.Сценарий) Тогда
		Объект.Сценарий=ПредопределенноеЗначение("Справочник.СценарииПланирования.ОсновнойСценарийПанирования");	
	КонецЕсли;
	
КонецПроцедуры

