
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Для каждого Зн Из Параметры.СписокПолей Цикл
		Стр = СписокПолей.ПолучитьЭлементы().Добавить();	
		Стр.Имя = Зн.Ключ;
		Стр.ПутьКДанным = Зн.Значение;
	КонецЦикла;
	
	//СписокПолей.ЗагрузитьЗначения(Параметры.СписокПолей.ВыгрузитьЗначения());
КонецПроцедуры


&НаКлиенте
Процедура СписокПолейВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ЗначениеВыбора = СписокПолей.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Закрыть(ЗначениеВыбора);
КонецПроцедуры
