Процедура ЗаписатьТокенАвторизации(УчетнаяЗапись,ТокенАвторизации,SDL_ИмяПараметраСессии) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если НЕ ЗначениеЗаполнено(УчетнаяЗапись) ИЛИ НЕ ЗначениеЗаполнено(ТокенАвторизации) Тогда
	 	 Возврат;
	 КонецЕсли;
	 УчетнаяЗаписьОбъект = УчетнаяЗапись.ПолучитьОбъект();
	 Если УчетнаяЗаписьОбъект = Неопределено Тогда
	 	  Возврат;
	  КонецЕсли;
	  УчетнаяЗаписьОбъект.ТокенАвторизации = ТокенАвторизации;   
	  УчетнаяЗаписьОбъект.SDL_ИмяПараметраСессии = SDL_ИмяПараметраСессии; 
	  УчетнаяЗаписьОбъект.Записать();
	КонецПроцедуры
