
&НаКлиенте
Процедура ДоходыРасходыПриИзменении(Элемент)
	Объект.КоэффициентДляФактаСум = Объект.ДоходыРасходы;
КонецПроцедуры

&НаКлиенте
Процедура ИсточникДанныхДляФактаПриИзменении(Элемент)
	ЗаполнитьСписокВыборкаПоказателей();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыборкаПоказателей()
	Элементы.ПоказательИсточникаДанныхДляФактаКол.СписокВыбора.Очистить();
	Элементы.ПоказательИсточникаДанныхДляФактаСум.СписокВыбора.Очистить();
	Элементы.ПоказательИсточникаДанныхКонтрагент.СписокВыбора.Очистить();
	Элементы.ПоказательИсточникаДанныхНоменклатура.СписокВыбора.Очистить();
	
   ////// Для использования собственных отборов в статье
   ////ТекущийОбъект = ДанныеФормыВЗначение(Объект,Тип("СправочникОбъект.СтатьиОборотовПоБюджетам"));
   ////СохраненныйКомпоновщикНастроек = ТекущийОбъект.КомпоновщикНастроек.Получить();
   ////ИнициализироватьКомпоновщикСервер(СохраненныйКомпоновщикНастроек);
   //// 
    //Для использования собственных отборов в статье
	// раскоментировать если не используем собственные настройки
	ИнициализироватьКомпоновщикСервер(Неопределено);
	КомпоновщикНастроек.Настройки.Выбор.Элементы.Очистить();
	
	
	Для Каждого ДоступноеПоле Из КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.Элементы Цикл
		Если ДоступноеПоле.Папка Тогда
			ПродолжитЬ;
		КонецЕсли;	
		Если ДоступноеПоле.Ресурс Тогда
			Элементы.ПоказательИсточникаДанныхДляФактаКол.СписокВыбора.Добавить(Строка(ДоступноеПоле.Поле),ДоступноеПоле.Заголовок);
			Элементы.ПоказательИсточникаДанныхДляФактаСум.СписокВыбора.Добавить(Строка(ДоступноеПоле.Поле),ДоступноеПоле.Заголовок);
		Иначе	
			Элементы.ПоказательИсточникаДанныхКонтрагент.СписокВыбора.Добавить(Строка(ДоступноеПоле.Поле),ДоступноеПоле.Заголовок);
			Элементы.ПоказательИсточникаДанныхНоменклатура.СписокВыбора.Добавить(Строка(ДоступноеПоле.Поле),ДоступноеПоле.Заголовок);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьКомпоновщикСервер(НастройкаКомпоновки)
	//Если Не ЗначениеЗаполнено(АдресСхемыКомпоновкиДанных) Тогда
	СхемаКомпоновкиДанных = Объект.ИсточникДанныхДляФакта.СхемаИсточникаДанных.Получить();
	АдресСхемыКомпоновкиДанных = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных,УникальныйИдентификатор);
	//КонецЕсли;
	
	Если СхемаКомпоновкиДанных = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	Попытка
		КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыКомпоновкиДанных));
	Исключение
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Выполнение операции'"),
		УровеньЖурналаРегистрации.Ошибка,,,
		ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));	
	КонецПопытки;
	
	Если НастройкаКомпоновки = Неопределено Тогда
		СхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(АдресСхемыКомпоновкиДанных);
		КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	Иначе
		КомпоновщикНастроек.ЗагрузитьНастройки(НастройкаКомпоновки);
		КомпоновщикНастроек.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ЗаполнитьСписокВыборкаПоказателей();
	//// для получения настроек из статьи оборотов
	//СохраненныйКомпоновщикНастроек = ТекущийОбъект.КомпоновщикНастроек.Получить();
	//ИнициализироватьКомпоновщикСервер(СохраненныйКомпоновщикНастроек);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьПолей()
	Элементы.ПоказательИсточникаДанныхДляФактаКол.Доступность=Объект.УчетПоКоличеству;
	Элементы.КоэффициентДляФактаКол.Доступность = Объект.УчетПоКоличеству;
	
	Элементы.ПоказательИсточникаДанныхДляФактаСум.Доступность=Объект.УчетПоСумме;
	Элементы.КоэффициентДляФактаСум.Доступность = Объект.УчетПоСумме;
	Элементы.ОсновнаяВалюта.Доступность = Объект.УчетПоСумме;
	
	Элементы.ПоказательИсточникаДанныхКонтрагент.Доступность = Объект.РазделениеПоКонтрагентам;
	Элементы.ПоказательИсточникаДанныхНоменклатура.Доступность = Объект.РазделениеПоНоменклатуре;
	
КонецПроцедуры

&НаКлиенте
Процедура УчетПоКоличествуПриИзменении(Элемент)
	УстановитьДоступностьПолей();
КонецПроцедуры

&НаКлиенте
Процедура УчетПоСуммеПриИзменении(Элемент)
	УстановитьДоступностьПолей();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьДоступностьПолей();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОбычнуюФорму(Команда)
	ОткрытьФорму("Справочник.СтатьиОборотовПоБюджетам.Форма.ФормаЭлементаОбычная",Новый Структура("Ключ",Объект.Ссылка));
КонецПроцедуры

&НаКлиенте
Процедура РазделениеПоКонтрагентамПриИзменении(Элемент)
	УстановитьДоступностьПолей();
КонецПроцедуры

&НаКлиенте
Процедура РазделениеПоНоменклатуреПриИзменении(Элемент)
	УстановитьДоступностьПолей();
КонецПроцедуры

&НаКлиенте
Процедура НастроитьИсточник(Команда)
	Если ЗначениеЗаполнено(Объект.ИсточникДанныхДляФакта) Тогда
		ОткрытьФорму("Справочник.ИсточникиДанныхДляРасчетовБюджетирования.ФормаОбъекта",Новый Структура("Ключ",Объект.ИсточникДанныхДляФакта),ЭтаФорма,ЭтаФорма);		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Объект.УчетПоСумме и НЕ ЗначениеЗаполнено(Объект.ОсновнаяВалюта) Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не выбрана валюта статьи";
		Сообщение.Поле = "Объект.ОсновнаяВалюта";
		Сообщение.УстановитьДанные(Объект);  //ЭтотОбъект  //Паша
		Сообщение.Сообщить();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//// сохраним настройки компановщика в хранилище
	//ТекущийОбъект.КомпоновщикНастроек = Новый ХранилищеЗначения(КомпоновщикНастроек.ПолучитьНастройки());
КонецПроцедуры
