
&ИзменениеИКонтроль("УстановитьДатыВыездаВозвращения")
Процедура ЮЦ_УстановитьДатыВыездаВозвращения(ТекущийДокумент, ТехнологическийПЛ)
#Удаление	
	// Для записанного документа отключаем автоматическое изменение даты выезда и даты возвращения.
	Если НЕ ТекущийДокумент.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
#КонецУдаления
	Если НЕ ЗначениеЗаполнено(ТекущийДокумент.ДатаВыезда) Тогда
		ТекущийДокумент.ДатаВыезда = ТекущийДокумент.Дата;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ТекущийДокумент.ДатаВозвращения) Тогда
		ТекущийДокумент.ДатаВозвращения = ТекущийДокумент.ДатаВыезда;
	КонецЕсли;

	Если (НачалоДня(ТекущийДокумент.ДатаВыезда) = НачалоДня(ТекущийДокумент.ДатаВозвращения)
		ИЛИ ТекущийДокумент.ДатаВозвращения - ТекущийДокумент.ДатаВыезда <= 24*3600)
		И НачалоДня(ТекущийДокумент.ДатаВыезда) <> НачалоДня(ТекущийДокумент.Дата) Тогда
		ТекущийДокумент.ДатаВыезда      = НачалоДня(ТекущийДокумент.Дата)
		+ (ТекущийДокумент.ДатаВыезда - НачалоДня(ТекущийДокумент.ДатаВыезда));
		ТекущийДокумент.ДатаВозвращения = НачалоДня(ТекущийДокумент.Дата)
		+ (ТекущийДокумент.ДатаВозвращения - НачалоДня(ТекущийДокумент.ДатаВозвращения));
	КонецЕсли;

	// Заполнение времени выезда и возврата по режиму работы ТС или настройкам программы.
	Если НЕ ТехнологическийПЛ И ЗначениеЗаполнено(ТекущийДокумент.РежимРаботыТС) Тогда
		НачалоРаботы_ = ТекущийДокумент.РежимРаботыТС.НачалоРаботы;
		КонецРаботы_  = ТекущийДокумент.РежимРаботыТС.КонецРаботы;
	Иначе
		НастройкиПользователя = Новый Структура();
		НастройкиПользователя.Вставить("Организация",   ТекущийДокумент.Организация);
		НастройкиПользователя.Вставить("Подразделение", ТекущийДокумент.Подразделение);

		НачалоРаботы_ = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(НастройкиПользователя,
		ПредопределенноеЗначение("ПланВидовХарактеристик.уатПраваИНастройки.ВремяВыездаПЛ"));
		КонецРаботы_ = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(НастройкиПользователя,
		ПредопределенноеЗначение("ПланВидовХарактеристик.уатПраваИНастройки.ВремяВозращенияПЛ"));
	КонецЕсли;
	Если ЗначениеЗаполнено(НачалоРаботы_) ИЛИ ЗначениеЗаполнено(КонецРаботы_) Тогда
		ТекущийДокумент.ДатаВыезда = НачалоДня(ТекущийДокумент.ДатаВыезда) + (НачалоРаботы_ - '00010101');
		ТекущийДокумент.ДатаВозвращения	= НачалоДня(ТекущийДокумент.ДатаВозвращения) + (КонецРаботы_ - '00010101');
	КонецЕсли;

	// Поправка на ночной режим работы.
	// Переход с дневного на ночной - добавляем сутки к времени возвращения.
	Если ТекущийДокумент.ДатаВыезда > ТекущийДокумент.ДатаВозвращения
		И НачалоРаботы_ > КонецРаботы_ Тогда

		ТекущийДокумент.ДатаВозвращения	= ТекущийДокумент.ДатаВозвращения + 24*3600;
	КонецЕсли;

	// Убираем секунды - они не отображаются в интерфейсе, но в расчетах участвуют.
	ТекущийДокумент.ДатаВыезда      = уатОбщегоНазначения.уатДатаБезСекунд(ТекущийДокумент.ДатаВыезда);
	ТекущийДокумент.ДатаВозвращения	= уатОбщегоНазначения.уатДатаБезСекунд(ТекущийДокумент.ДатаВозвращения);
КонецПроцедуры
