Функция ПолучитьПозициюПервогоРазделителяДаты(ДатаСтрокой)

	ПозицияПервогоРазделителя = 0;
	СтрокаЦифр = "0123456789";
	ДлинаСтроки = СтрДлина(ДатаСтрокой);
	Для й=1 По ДлинаСтроки Цикл
		ТекущийСимвол = Сред(ДатаСтрокой,й,1);
		Если СтрНайти(СтрокаЦифр,ТекущийСимвол) = 0 Тогда 
			ПозицияПервогоРазделителя = й;			
			Прервать;
		КонецЕсли;		
	КонецЦикла;	  
	
	Возврат ПозицияПервогоРазделителя;
	
КонецФункции	

Функция ПолучитьДатуИзСтроки(СтрокаСДатой) Экспорт

	ДатаСтрокой = СокрЛП(СтрокаСДатой);
	
	Если ДатаСтрокой = "" Тогда
		Возврат Дата(1, 1, 1);
	КонецЕсли;	
	
	Если СтрДлина(ДатаСтрокой) = 19 Тогда 
		// 2021-09-05 06:59:51
		
		Год = Число(Лев(ДатаСтрокой,4));
		Месяц = Число(Сред(ДатаСтрокой,6,2));
		День = Число(Сред(ДатаСтрокой,9,2));
		Час = Число(Сред(ДатаСтрокой,12,2));
		Минута = Число(Сред(ДатаСтрокой,15,2));
		Секунда = Число(Сред(ДатаСтрокой,18,2));
		
		ДатаДатой = Дата(Год, Месяц, День, Час, Минута, Секунда);
		
	ИначеЕсли СтрДлина(ДатаСтрокой) = 10 Тогда
		
		ПозицияПервогоРазделителя = ПолучитьПозициюПервогоРазделителяДаты(ДатаСтрокой);		
		Если ПозицияПервогоРазделителя = 3 Тогда		

			// 05.11.2019
			
			День = Число(Лев(ДатаСтрокой,2));
			Месяц = Число(Сред(ДатаСтрокой,4,2));
			Год = Число(Сред(ДатаСтрокой,7,4));
			
		ИначеЕсли ПозицияПервогоРазделителя = 5 Тогда			
			
			// 2019-11-05
			Год = Число(Лев(ДатаСтрокой,4));
			Месяц = Число(Сред(ДатаСтрокой,6,2));
			День = Число(Сред(ДатаСтрокой,9,2));
			
		КонецЕсли;	
		
		ДатаДатой = Дата(Год, Месяц, День);
		
	ИначеЕсли СтрДлина(ДатаСтрокой) = 7 Тогда 
		//01.2019
		
		День = 1;
		Месяц = Число(Лев(ДатаСтрокой,2));
		Год = Число(Сред(ДатаСтрокой,4));
		
		ДатаДатой = Дата(Год, Месяц, День);
		
	ИначеЕсли СтрДлина(ДатаСтрокой) = 8 Тогда 
		//13112020
		
		День = Число(Лев(ДатаСтрокой,2));
		Месяц = Число(Сред(ДатаСтрокой,3,2));
		Год = Число(Сред(ДатаСтрокой,5));
		
		ДатаДатой = Дата(Год, Месяц, День);
		
		
	ИначеЕсли СтрДлина(ДатаСтрокой) = 12 Тогда 	
		
		//4 кв.2012 г.
		//3 кв.2012 г.

		НомерКвартала = Число(Лев(ДатаСтрокой,1));
		Год = Число(Сред(ДатаСтрокой,6,4));
		
		ДатаДатой = КонецМесяца(Дата(Год, НомерКвартала*3, 1));
		

	Иначе	
		Возврат Дата(1, 1, 1);
	КонецЕсли;
	
	Возврат ДатаДатой;

КонецФункции		

&НаСервере
Функция ПолучитьСтруктуруТипТС(ТипТС)

	СтруктураОбъекта = Новый Структура;
	СтруктураОбъекта.Вставить("Тип", "Справочник.уатТипыТС");
	СтруктураОбъекта.Вставить("Идентификатор", ТипТС.УникальныйИдентификатор());
	СтруктураОбъекта.Вставить("Код", ТипТС.Код);
	СтруктураОбъекта.Вставить("Наименование", ТипТС.Наименование);
	СтруктураОбъекта.Вставить("Родитель", ТипТС.Родитель);
	СтруктураОбъекта.Вставить("ЭтоГруппа", ТипТС.ЭтоГруппа);
	СтруктураОбъекта.Вставить("ВидТС", Строка(ТипТС.ВидТС));  
	СтруктураОбъекта.Вставить("Комментарий", ТипТС.Комментарий);
	
	Возврат СтруктураОбъекта;

КонецФункции

&НаСервере
Функция ПолучитьСтруктуруМаршрут(Маршрут)

	СтруктураОбъекта = Новый Структура;
	СтруктураОбъекта.Вставить("Тип", "Справочник.уатМаршруты");
	СтруктураОбъекта.Вставить("Идентификатор", Маршрут.УникальныйИдентификатор());
	СтруктураОбъекта.Вставить("Код", Маршрут.Код);
	СтруктураОбъекта.Вставить("Наименование", Маршрут.Наименование);
	СтруктураОбъекта.Вставить("ЭтоГруппа", Маршрут.ЭтоГруппа);
	
	Если ЗначениеЗаполнено(Маршрут.Родитель) Тогда
		СтруктураОбъекта.Вставить("Родитель", ПолучитьСтруктуруМаршрут(Маршрут.Родитель));	
	КонецЕсли;	
		
	Возврат СтруктураОбъекта;

КонецФункции

&НаСервере
Функция ПолучитьСтруктуруМодель(Модель)

	СтруктураОбъекта = Новый Структура;
	СтруктураОбъекта.Вставить("Тип", "Справочник.уатМоделиТС");
	СтруктураОбъекта.Вставить("Идентификатор", Модель.УникальныйИдентификатор());
	СтруктураОбъекта.Вставить("Код", Модель.Код);
	СтруктураОбъекта.Вставить("Наименование", Модель.Наименование);
	СтруктураОбъекта.Вставить("ЭтоГруппа", Модель.ЭтоГруппа);
	
	Если Не Модель.ЭтоГруппа Тогда
	
		СтруктураОбъекта.Вставить("ВидМоделиТС", Строка(Модель.ВидМоделиТС));
		СтруктураОбъекта.Вставить("ТипТС", ПолучитьСтруктуруТипТС(Модель.ТипТС));
		
		//СтруктураОбъекта.Вставить("НормыРасходаТоплива", Модель.НормыРасходаТоплива);    
		////СтруктураОбъекта.Вставить("Топливо", ПолучитьСтруктуруТопливо(Модель.Топливо));
		//СтруктураОбъекта.Вставить("ТипТоплива", Строка(Модель.ТипТоплива));
		//СтруктураОбъекта.Вставить("КатегорияЕЭКООН", Строка(Модель.КатегорияЕЭКООН));
		//СтруктураОбъекта.Вставить("НормыРасходаНаТранспортнуюРаботу", Модель.НормыРасходаНаТранспортнуюРаботу); 
		//СтруктураОбъекта.Вставить("НормыРасходаНаПрицеп", Модель.НормыРасходаНаПрицеп);
		//СтруктураОбъекта.Вставить("СобственнаяМасса", Модель.СобственнаяМасса);
		//СтруктураОбъекта.Вставить("ЭтоПрицеп", Модель.ЭтоПрицеп);
		//СтруктураОбъекта.Вставить("ЕстьТопливныйБак", Модель.ЕстьТопливныйБак);  
		//СтруктураОбъекта.Вставить("УчетВМоточасах", Модель.УчетВМоточасах);
		//СтруктураОбъекта.Вставить("ТипПутевогоЛиста", Строка(Модель.ТипПутевогоЛиста));
		//СтруктураОбъекта.Вставить("Комбинированный", Модель.Комбинированный);   
		//СтруктураОбъекта.Вставить("НормыРасходаМасла", Модель.НормыРасходаМасла); 
		//СтруктураОбъекта.Вставить("НормаРасходаТопливаПриПростое", Модель.НормаРасходаТопливаПриПростое);  
		//СтруктураОбъекта.Вставить("ВесМаксимальнойЗагрузки", Модель.ВесМаксимальнойЗагрузки / 1000);  //Перевод из кг. в тонны 

	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Модель.Родитель) Тогда
		СтруктураОбъекта.Вставить("Родитель", ПолучитьСтруктуруМодель(Модель.Родитель));	
	КонецЕсли;	
		
	Возврат СтруктураОбъекта;

КонецФункции

&НаСервере
Функция ПолучитьСтруктуруНоменклатурнаяГруппа(НоменклатурнаяГруппа)

	СтруктураОбъекта = Новый Структура;     
	
	СтруктураОбъекта.Вставить("Тип", "Справочник.НоменклатурныеГруппы"); 
	СтруктураОбъекта.Вставить("Идентификатор", НоменклатурнаяГруппа.УникальныйИдентификатор());
	
	СтруктураОбъекта.Вставить("Код", НоменклатурнаяГруппа.Код);
	СтруктураОбъекта.Вставить("Наименование", НоменклатурнаяГруппа.Наименование);
	СтруктураОбъекта.Вставить("ЭтоГруппа", НоменклатурнаяГруппа.ЭтоГруппа);
	
	Если Не СтруктураОбъекта.ЭтоГруппа Тогда
	
		//СтруктураОбъекта.Вставить("ГосударственныйНомер", ТранспортноеСредство.ГосударственныйНомер);
		//СтруктураОбъекта.Вставить("ТипТС", ПолучитьСтруктуруТипТС(ТранспортноеСредство.ТипТС));
		//СтруктураОбъекта.Вставить("Модель", ПолучитьСтруктуруМодель(ТранспортноеСредство.Модель));
		
	КонецЕсли;

	Если ЗначениеЗаполнено(НоменклатурнаяГруппа.Родитель) Тогда
		СтруктураОбъекта.Вставить("Родитель", ПолучитьСтруктуруНоменклатурнаяГруппа(НоменклатурнаяГруппа.Родитель));	
	КонецЕсли;	
		
	Возврат СтруктураОбъекта;	
		
КонецФункции		

&НаСервере
Функция ПолучитьСтруктуруТС(ТранспортноеСредство)

	СтруктураОбъекта = Новый Структура;     
	
	СтруктураОбъекта.Вставить("Тип", "Справочник.уатТС"); 
	СтруктураОбъекта.Вставить("Идентификатор", ТранспортноеСредство.УникальныйИдентификатор());
	
	СтруктураОбъекта.Вставить("Наименование", ТранспортноеСредство.Наименование);
	СтруктураОбъекта.Вставить("ЭтоГруппа", ТранспортноеСредство.ЭтоГруппа);
	
	Если Не СтруктураОбъекта.ЭтоГруппа Тогда
	
		СтруктураОбъекта.Вставить("ГосударственныйНомер", ТранспортноеСредство.ГосударственныйНомер);
		СтруктураОбъекта.Вставить("ТипТС", ПолучитьСтруктуруТипТС(ТранспортноеСредство.ТипТС));
		СтруктураОбъекта.Вставить("Модель", ПолучитьСтруктуруМодель(ТранспортноеСредство.Модель));
		
	КонецЕсли;

	Если ЗначениеЗаполнено(ТранспортноеСредство.Родитель) Тогда
		СтруктураОбъекта.Вставить("Родитель", ПолучитьСтруктуруТС(ТранспортноеСредство.Родитель));	
	КонецЕсли;	
		
	Возврат СтруктураОбъекта;	
		
КонецФункции		

&НаСервере
Функция ВыгрузитьДанныеПоМаршрутамПутевыхЛистов(ЗапросJSON) Экспорт
	
	ДатаНачалаСтрокой = ЗапросJSON.ПараметрыЗапроса.Получить("StartDate");
	ДатаКонцаСтрокой = ЗапросJSON.ПараметрыЗапроса.Получить("EndDate");  
	Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
	
	ДатаНачала = ?(ДатаНачалаСтрокой=Неопределено, Дата(1,1,1), ПолучитьДатуИзСтроки(ДатаНачалаСтрокой));		
	ДатаКонца  = ?(ДатаКонцаСтрокой=Неопределено, Дата(1,1,1), ПолучитьДатуИзСтроки(ДатаКонцаСтрокой));		

	СтруктураДанных = ВыгрузитьДанныеПоМаршрутамПутевыхЛистовФрагмент(ДатаКонца, ДатаНачала, Организация);


	Возврат СтруктураДанных;
	
КонецФункции

&НаСервере
Функция ВыгрузитьДанныеПоМаршрутамПутевыхЛистовФрагмент(Знач ДатаКонца, Знач ДатаНачала, Организация) Экспорт
	
	ДанныеПоМаршрутам = Новый Массив;
	
	Запрос = Новый Запрос;  
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	уатМестонахождениеТССрезПоследних.Период КАК Период,
	|	уатМестонахождениеТССрезПоследних.ТС КАК ТС,
	|	уатМестонахождениеТССрезПоследних.Организация КАК Организация,
	|	уатМестонахождениеТССрезПоследних.Подразделение КАК Подразделение,
	|	уатМестонахождениеТССрезПоследних.Колонна КАК Колонна
	|ПОМЕСТИТЬ ВТ_уатМестонахождениеТССрезПоследних
	|ИЗ
	|	РегистрСведений.уатМестонахождениеТС.СрезПоследних(&ГраницаДатаОкончания, Организация = &Организация) КАК уатМестонахождениеТССрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЮЦАУ_ОборотыПоМаршрутамОбороты.Организация КАК Организация,
	|	ЮЦАУ_ОборотыПоМаршрутамОбороты.Организация.Наименование КАК ОрганизацияНаименование,
	|	ЮЦАУ_ОборотыПоМаршрутамОбороты.ТранспортноеСредство КАК ТранспортноеСредство,
	|	ЮЦАУ_ОборотыПоМаршрутамОбороты.Маршрут КАК Маршрут,
	|	ВЫБОР
	|		КОГДА ЮЦАУ_ОборотыПоМаршрутамОбороты.НоменклатурнаяГруппа.Родитель <> ЗНАЧЕНИЕ(Справочник.НоменклатурныеГруппы.ПустаяСсылка)
	|			ТОГДА ЮЦАУ_ОборотыПоМаршрутамОбороты.НоменклатурнаяГруппа.Родитель
	|		ИНАЧЕ ЮЦАУ_ОборотыПоМаршрутамОбороты.НоменклатурнаяГруппа
	|	КОНЕЦ КАК НоменклатурнаяГруппа,
	|	ЮЦАУ_ОборотыПоМаршрутамОбороты.Сотрудник.ФизическоеЛицо КАК Физлицо,
	|	ЮЦАУ_ОборотыПоМаршрутамОбороты.Сотрудник.ФизическоеЛицо.Наименование КАК ФизлицоНаименование,
	|	ЮЦАУ_ОборотыПоМаршрутамОбороты.Сотрудник.ФизическоеЛицо.ИНН КАК ФизлицоИНН,
	|	ЮЦАУ_ОборотыПоМаршрутамОбороты.Сотрудник.ФизическоеЛицо.Пол КАК ФизлицоПол,
	|	ЮЦАУ_ОборотыПоМаршрутамОбороты.Сотрудник.ФизическоеЛицо.ДатаРождения КАК ФизлицоДатаРождения,
	|	ЮЦАУ_ОборотыПоМаршрутамОбороты.РабочееВремяОборот КАК РабочееВремя,
	|	ЮЦАУ_ОборотыПоМаршрутамОбороты.ВыручкаОборот КАК Выручка,
	|	ЮЦАУ_ОборотыПоМаршрутамОбороты.КоличествоПассажировОборот КАК КоличествоПассажиров,
	|	ЮЦАУ_ОборотыПоМаршрутамОбороты.КоличествоЕздокОборот КАК КоличествоЕздок,
	|	ЮЦАУ_ОборотыПоМаршрутамОбороты.ПробегСПассажирамиОборот КАК ПробегСПассажирами,
	|	ВЗ_уатМестонахождениеТССрезПоследних.Подразделение КАК Подразделение
	|ИЗ
	|	РегистрНакопления.ЮЦАУ_ОборотыПоМаршрутам.Обороты(&ДатаНачала, &ГраницаДатаОкончания, Период, ) КАК ЮЦАУ_ОборотыПоМаршрутамОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ВТ_уатМестонахождениеТССрезПоследних.ТС КАК ТС,
	|			ВТ_уатМестонахождениеТССрезПоследних.Подразделение КАК Подразделение
	|		ИЗ
	|			ВТ_уатМестонахождениеТССрезПоследних КАК ВТ_уатМестонахождениеТССрезПоследних) КАК ВЗ_уатМестонахождениеТССрезПоследних
	|		ПО ЮЦАУ_ОборотыПоМаршрутамОбороты.ТранспортноеСредство = ВЗ_уатМестонахождениеТССрезПоследних.ТС
	|ГДЕ
	|	ЮЦАУ_ОборотыПоМаршрутамОбороты.Организация = &Организация
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТранспортноеСредство,
	|	Маршрут,
	|	ЮЦАУ_ОборотыПоМаршрутамОбороты.Сотрудник
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ДатаНачала));
	
	Граница = Новый Граница(КонецДня(ДатаКонца), ВидГраницы.Включая);
	Запрос.УстановитьПараметр("ГраницаДатаОкончания", Граница); 
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ВыборкаДетальныеЗаписи.РабочееВремя = 0 Тогда  //Нулевые коэффициенты не нужны
			Продолжить;
		КонецЕсли;	
		
		СтруктураСтроки = ПолучитьСтруктуруСтроки();
		ЗаполнитьЗначенияСвойств(СтруктураСтроки, ВыборкаДетальныеЗаписи);
		
		СтруктураСтроки.ОрганизацияИдентификатор = ?(ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Организация), ВыборкаДетальныеЗаписи.Организация.УникальныйИдентификатор(), Неопределено);
		СтруктураСтроки.ФизлицоИдентификатор = ?(ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Физлицо), ВыборкаДетальныеЗаписи.Физлицо.УникальныйИдентификатор(), Неопределено);
		
		СтруктураСтроки.ФизлицоПол = Строка(ВыборкаДетальныеЗаписи.ФизлицоПол);
		
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Маршрут) Тогда 
			СтруктураМаршрут = ПолучитьСтруктуруМаршрут(ВыборкаДетальныеЗаписи.Маршрут);
			СтруктураСтроки.Вставить("Маршрут", СтруктураМаршрут);
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Подразделение) Тогда 
			СтруктураПодразделение = ПолучитьСтруктуруПодразделение(ВыборкаДетальныеЗаписи.Подразделение);
			СтруктураСтроки.Вставить("Подразделение", СтруктураПодразделение);
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ТранспортноеСредство) Тогда 
			СтруктураТС = ПолучитьСтруктуруТС(ВыборкаДетальныеЗаписи.ТранспортноеСредство);
			СтруктураСтроки.Вставить("ТранспортноеСредство", СтруктураТС);
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.НоменклатурнаяГруппа) Тогда 
			СтруктураНоменклатурнаяГруппа = ПолучитьСтруктуруНоменклатурнаяГруппа(ВыборкаДетальныеЗаписи.НоменклатурнаяГруппа);
			СтруктураСтроки.Вставить("НоменклатурнаяГруппа", СтруктураНоменклатурнаяГруппа);
		КонецЕсли;
		
		ДанныеПоМаршрутам.Добавить(СтруктураСтроки);  
		
	КонецЦикла;
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("ДанныеПоМаршрутам", ДанныеПоМаршрутам);
	Возврат СтруктураДанных;

КонецФункции

&НаСервере
Функция ПолучитьСтруктуруСтроки()
	
	СтруктураСтроки = Новый Структура;
	СтруктураСтроки.Вставить("ОрганизацияИдентификатор", "");
	СтруктураСтроки.Вставить("ОрганизацияНаименование", "");

	СтруктураСтроки.Вставить("ФизлицоИдентификатор", "");
	СтруктураСтроки.Вставить("ФизлицоНаименование", "");
	СтруктураСтроки.Вставить("ФизлицоИНН", "");
	СтруктураСтроки.Вставить("ФизлицоПол", "");
	СтруктураСтроки.Вставить("ФизлицоДатаРождения", "");
		
	СтруктураСтроки.Вставить("РабочееВремя", 0); 
	СтруктураСтроки.Вставить("Выручка", 0); 
	СтруктураСтроки.Вставить("КоличествоПассажиров", 0); 
	СтруктураСтроки.Вставить("КоличествоЕздок", 0); 
	СтруктураСтроки.Вставить("ПробегСПассажирами", 0); 
	
	Возврат СтруктураСтроки;
	
КонецФункции	

&НаСервере
Функция ПолучитьДанныеJSON(Данные) Экспорт
	
	ЗаписьJSON = Новый ЗаписьJSON;
	НастройкиСериализацииJSON = Новый НастройкиСериализацииJSON;
	НастройкиСериализацииJSON.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.ЛокальнаяДата;	
	НастройкиСериализацииJSON.ФорматСериализацииДаты = ФорматДатыJSON.ISO; 

	ПараметрыJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, " ");
	ЗаписьJSON.УстановитьСтроку(ПараметрыJSON);
	ЗаписатьJSON(ЗаписьJSON, Данные, НастройкиСериализацииJSON, "ФункцияПреобразованияЗаписи", ЮЦАУ_ВнешнийПрограммныйИнтерфейс);
	
	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции

&НаСервере
Функция ФункцияПреобразованияЗаписи(Свойство, Значение, ДополнительныеПараметры, Отказ) Экспорт
    Если ТипЗнч(Значение) = Тип("УникальныйИдентификатор") Тогда
        Возврат Строка(Значение);
	Иначе
		Сообщить(ТипЗнч(Значение));
    КонецЕсли;
    Отказ = Истина;
КонецФункции

&НаСервере
Функция ПолучитьСтруктуруОрганизация(Организация)
	
	СтруктураОбъекта = Новый Структура();
	СтруктураОбъекта.Вставить("Тип", "Справочник.Организации");
	СтруктураОбъекта.Вставить("Идентификатор", Организация.УникальныйИдентификатор());
	
	СтруктураОбъекта.Вставить("Код", Организация.Код);
	СтруктураОбъекта.Вставить("Наименование", Организация.Наименование);
	СтруктураОбъекта.Вставить("ИНН", Организация.ИНН);
	СтруктураОбъекта.Вставить("КПП", Организация.КПП);
		
	Возврат СтруктураОбъекта;

КонецФункции	      

&НаСервере
Функция ПолучитьСтруктуруПодразделение(Подразделение)

	СтруктураОбъекта = Новый Структура();
	СтруктураОбъекта.Вставить("Тип", "Справочник.ПодразделенияОрганизаций");
	СтруктураОбъекта.Вставить("Идентификатор", Подразделение.УникальныйИдентификатор());
	СтруктураОбъекта.Вставить("Владелец", ПолучитьСтруктуруОрганизация(Подразделение.Владелец));
	СтруктураОбъекта.Вставить("Код", Подразделение.Код);
	СтруктураОбъекта.Вставить("Наименование", Подразделение.Наименование);
	СтруктураОбъекта.Вставить("ЭтоГруппа", Подразделение.ЭтоГруппа);
	
	Если ЗначениеЗаполнено(Подразделение.Родитель) Тогда
		СтруктураОбъекта.Вставить("Родитель", ПолучитьСтруктуруПодразделение(Подразделение.Родитель));
	КонецЕсли;	 
	
	Если Подразделение.ЭтоГруппа = Ложь Тогда
		СтруктураОбъекта.Вставить("КПП", Подразделение.КПП);
		СтруктураОбъекта.Вставить("КодПоОКАТО", Подразделение.КодПоОКАТО);
	КонецЕсли;	
	
	Возврат СтруктураОбъекта;

КонецФункции

&НаСервере
Функция ВыгрузитьПотреблениеТоплива(ЗапросJSON) Экспорт
	
	ДатаНачалаСтрокой = ЗапросJSON.ПараметрыЗапроса.Получить("StartDate");
	ДатаКонцаСтрокой = ЗапросJSON.ПараметрыЗапроса.Получить("EndDate");  
	Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
	
	ДатаНачала = ?(ДатаНачалаСтрокой=Неопределено, Дата(1,1,1), ПолучитьДатуИзСтроки(ДатаНачалаСтрокой));		
	ДатаКонца  = ?(ДатаКонцаСтрокой=Неопределено, Дата(1,1,1), ПолучитьДатуИзСтроки(ДатаКонцаСтрокой));		

	ДанныеПотреблениеТоплива = Новый Массив;
	
	//В запросе отбрасываются граничные записи, принадлежащие предыдущему периоду и загружаются граничные записи, принадлежащие следующему периоду 
	//Например, п/л 30.04.2023 попадает в период 01.05.2023 из-за произведенной ночной заправки 01.05.2023 (его нужно отбросить)  
	//А п/л 31.05.2023 попадает в период 01.06.2023 из-за произведенной ночной заправки 01.06.2023 (его наоборот нужно включить)
	//Такова специфика работы предприятия
	Запрос = Новый Запрос;  
	Запрос.Текст =    
		"ВЫБРАТЬ
		|	уатМестонахождениеТССрезПоследних.Период КАК Период,
		|	уатМестонахождениеТССрезПоследних.ТС КАК ТС,
		|	уатМестонахождениеТССрезПоследних.Организация КАК Организация,
		|	уатМестонахождениеТССрезПоследних.Подразделение КАК Подразделение,
		|	уатМестонахождениеТССрезПоследних.Колонна КАК Колонна
		|ПОМЕСТИТЬ ВТ_уатМестонахождениеТССрезПоследних
		|ИЗ
		|	РегистрСведений.уатМестонахождениеТС.СрезПоследних(&ДатаОкончания, Организация = &Организация) КАК уатМестонахождениеТССрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	уатРасходГСМнаТСОбороты.Регистратор КАК Регистратор,
		|	уатРасходГСМнаТСОбороты.ТС КАК ТранспортноеСредство,
		|	уатРасходГСМнаТСОбороты.ГСМ КАК Номенклатура,
		|	уатРасходГСМнаТСОбороты.РасходПоНормеОборот КАК РасходПоНорме,
		|	уатРасходГСМнаТСОбороты.РасходПоФактуОборот КАК РасходПоФакту
		|ПОМЕСТИТЬ ВТ_РасходГСМвПериоде
		|ИЗ
		|	РегистрНакопления.уатРасходГСМнаТС.Обороты(, , Регистратор, ) КАК уатРасходГСМнаТСОбороты
		|ГДЕ
		|	уатРасходГСМнаТСОбороты.Организация = &Организация
		|	И уатРасходГСМнаТСОбороты.Регистратор.ДатаВыезда МЕЖДУ &ДатаНачала И &ДатаОкончания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_РасходГСМвПериоде.ТранспортноеСредство КАК ТранспортноеСредство,
		|	ВТ_РасходГСМвПериоде.Номенклатура КАК Номенклатура,
		|	СУММА(ВТ_РасходГСМвПериоде.РасходПоНорме) КАК РасходПоНорме,
		|	СУММА(ВТ_РасходГСМвПериоде.РасходПоФакту) КАК РасходПоФакту,
		|	ВЗ_уатМестонахождениеТССрезПоследних.Подразделение КАК Подразделение
		|ИЗ
		|	ВТ_РасходГСМвПериоде КАК ВТ_РасходГСМвПериоде
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ВТ_уатМестонахождениеТССрезПоследних.ТС КАК ТС,
		|			ВТ_уатМестонахождениеТССрезПоследних.Подразделение КАК Подразделение
		|		ИЗ
		|			ВТ_уатМестонахождениеТССрезПоследних КАК ВТ_уатМестонахождениеТССрезПоследних) КАК ВЗ_уатМестонахождениеТССрезПоследних
		|		ПО ВТ_РасходГСМвПериоде.ТранспортноеСредство = ВЗ_уатМестонахождениеТССрезПоследних.ТС
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_РасходГСМвПериоде.ТранспортноеСредство,
		|	ВТ_РасходГСМвПериоде.Номенклатура,
		|	ВЗ_уатМестонахождениеТССрезПоследних.Подразделение
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТранспортноеСредство,
		|	Номенклатура
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ДатаНачала));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ДатаКонца));
	
	Граница = Новый Граница(КонецДня(ДатаКонца), ВидГраницы.Включая);
    Запрос.УстановитьПараметр("ГраницаДатаОкончания", Граница); 
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СтруктураСтроки = ПолучитьСтруктуруСтрокиПотреблениеГСМ();
		ЗаполнитьЗначенияСвойств(СтруктураСтроки, ВыборкаДетальныеЗаписи);
		
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ТранспортноеСредство) Тогда 
			СтруктураТС = ПолучитьСтруктуруТС(ВыборкаДетальныеЗаписи.ТранспортноеСредство);
			СтруктураСтроки.Вставить("ТранспортноеСредство", СтруктураТС);
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Подразделение) Тогда 
			СтруктураПодразделение = ПолучитьСтруктуруПодразделение(ВыборкаДетальныеЗаписи.Подразделение);
			СтруктураСтроки.Вставить("Подразделение", СтруктураПодразделение);
		КонецЕсли;	

		СтруктураСтроки.Вставить("Номенклатура", ПолучитьСтруктуруНоменклатура(ВыборкаДетальныеЗаписи.Номенклатура));
		
		ДанныеПотреблениеТоплива.Добавить(СтруктураСтроки);  
		
	КонецЦикла;
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("ДанныеПотреблениеТоплива", ДанныеПотреблениеТоплива);

	Возврат СтруктураДанных;
	
КонецФункции

&НаСервере
Функция ВыгрузитьРасходТехническихЖидкостей(ЗапросJSON) Экспорт
	
	ДатаНачалаСтрокой = ЗапросJSON.ПараметрыЗапроса.Получить("StartDate");
	ДатаКонцаСтрокой = ЗапросJSON.ПараметрыЗапроса.Получить("EndDate");  
	Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
	
	ДатаНачала = ?(ДатаНачалаСтрокой=Неопределено, Дата(1,1,1), ПолучитьДатуИзСтроки(ДатаНачалаСтрокой));		
	ДатаКонца  = ?(ДатаКонцаСтрокой=Неопределено, Дата(1,1,1), ПолучитьДатуИзСтроки(ДатаКонцаСтрокой));		

	ДанныеПотреблениеТехническихЖидкостей = Новый Массив;
	
	Запрос = Новый Запрос;  
	Запрос.Текст =   
		"ВЫБРАТЬ
		|	уатМестонахождениеТССрезПоследних.Период КАК Период,
		|	уатМестонахождениеТССрезПоследних.ТС КАК ТС,
		|	уатМестонахождениеТССрезПоследних.Организация КАК Организация,
		|	уатМестонахождениеТССрезПоследних.Подразделение КАК Подразделение,
		|	уатМестонахождениеТССрезПоследних.Колонна КАК Колонна
		|ПОМЕСТИТЬ ВТ_уатМестонахождениеТССрезПоследних
		|ИЗ
		|	РегистрСведений.уатМестонахождениеТС.СрезПоследних(&ГраницаДатаОкончания, Организация = &Организация) КАК уатМестонахождениеТССрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	уатРасходТехническихЖидкостей.Регистратор.Склад КАК Склад,
		|	уатРасходТехническихЖидкостей.ТС КАК ТранспортноеСредство,
		|	уатРасходТехническихЖидкостей.ГСМ КАК Номенклатура,
		|	СУММА(ЕСТЬNULL(уатРасходТехническихЖидкостей.КоличествоПриходОборот, 0)) КАК РасходПоФакту,
		|	ВЗ_уатМестонахождениеТССрезПоследних.Подразделение КАК Подразделение
		|ИЗ
		|	РегистрНакопления.уатОборотыТЖнаТС.Обороты(&ДатаНачала, &ГраницаДатаОкончания, Регистратор, Организация = &Организация) КАК уатРасходТехническихЖидкостей
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ВТ_уатМестонахождениеТССрезПоследних.Подразделение КАК Подразделение,
		|			ВТ_уатМестонахождениеТССрезПоследних.ТС КАК ТС
		|		ИЗ
		|			ВТ_уатМестонахождениеТССрезПоследних КАК ВТ_уатМестонахождениеТССрезПоследних) КАК ВЗ_уатМестонахождениеТССрезПоследних
		|		ПО уатРасходТехническихЖидкостей.ТС = ВЗ_уатМестонахождениеТССрезПоследних.ТС
		|
		|СГРУППИРОВАТЬ ПО
		|	уатРасходТехническихЖидкостей.Регистратор.Склад,
		|	уатРасходТехническихЖидкостей.ТС,
		|	уатРасходТехническихЖидкостей.ГСМ,
		|	ВЗ_уатМестонахождениеТССрезПоследних.Подразделение";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ДатаНачала));
	
	Граница = Новый Граница(КонецДня(ДатаКонца), ВидГраницы.Включая);
    Запрос.УстановитьПараметр("ГраницаДатаОкончания", Граница); 
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СтруктураСтроки = ПолучитьСтруктуруСтрокиПотреблениеГСМ();
		ЗаполнитьЗначенияСвойств(СтруктураСтроки, ВыборкаДетальныеЗаписи);
		
		СтруктураСтроки.Вставить("Склад", ПолучитьСтруктуруСклад(ВыборкаДетальныеЗаписи.Склад));

		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ТранспортноеСредство) Тогда 
			СтруктураТС = ПолучитьСтруктуруТС(ВыборкаДетальныеЗаписи.ТранспортноеСредство);
			СтруктураСтроки.Вставить("ТранспортноеСредство", СтруктураТС);
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Подразделение) Тогда 
			СтруктураПодразделение = ПолучитьСтруктуруПодразделение(ВыборкаДетальныеЗаписи.Подразделение);
			СтруктураСтроки.Вставить("Подразделение", СтруктураПодразделение);
		КонецЕсли;	

		СтруктураСтроки.Вставить("Номенклатура", ПолучитьСтруктуруНоменклатура(ВыборкаДетальныеЗаписи.Номенклатура));
		
		ДанныеПотреблениеТехническихЖидкостей.Добавить(СтруктураСтроки);  
		
	КонецЦикла;
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("ДанныеПотреблениеТехническихЖидкостей", ДанныеПотреблениеТехническихЖидкостей);

	Возврат СтруктураДанных;
	
КонецФункции

&НаСервере
Функция ПолучитьСтруктуруСтрокиПотреблениеГСМ()
	
	СтруктураСтроки = Новый Структура;

	СтруктураСтроки.Вставить("РасходПоНорме", 0); 
	СтруктураСтроки.Вставить("РасходПоФакту", 0); 
	
	Возврат СтруктураСтроки;
	
КонецФункции	

&НаСервере
Функция ПолучитьСтруктуруНоменклатура(Номенклатура)
	
	СтруктураОбъекта = Новый Структура();
	СтруктураОбъекта.Вставить("Тип", "Справочник.Номенклатура");
	СтруктураОбъекта.Вставить("Идентификатор", Номенклатура.УникальныйИдентификатор());
	СтруктураОбъекта.Вставить("ЭтоГруппа", Номенклатура.ЭтоГруппа);
	СтруктураОбъекта.Вставить("Код", Номенклатура.Код);
	СтруктураОбъекта.Вставить("Наименование", Номенклатура.Наименование);
	//СтруктураОбъекта.Вставить("ВидНоменклатуры", ПолучитьСтруктуруВидНоменклатуры(Номенклатура.ВидНоменклатуры));

	Если Номенклатура.ЭтоГруппа = Ложь Тогда
		СтруктураОбъекта.Вставить("НаименованиеПолное", Номенклатура.НаименованиеПолное);
		СтруктураОбъекта.Вставить("Артикул", Номенклатура.Артикул);
		СтруктураОбъекта.Вставить("Комментарий", Номенклатура.Комментарий);
		СтруктураОбъекта.Вставить("ЕдиницаИзмерения", ПолучитьСтруктуруЕдиницаИзмерения(Номенклатура.ЕдиницаИзмерения));
		СтруктураОбъекта.Вставить("Услуга", Номенклатура.Услуга);
		//СтруктураОбъекта.Вставить("КодГруза", Номенклатура.КодГруза);
	КонецЕсли;

	Если ЗначениеЗаполнено(Номенклатура.Родитель) Тогда         
		СтруктураОбъекта.Вставить("Родитель", ПолучитьСтруктуруНоменклатура(Номенклатура.Родитель));
	КонецЕсли;	
	
	Возврат СтруктураОбъекта;

КонецФункции	

&НаСервере
Функция ПолучитьСтруктуруСклад(Склад)
	
	СтруктураОбъекта = Новый Структура();
	СтруктураОбъекта.Вставить("Тип", "Справочник.Склады");
	СтруктураОбъекта.Вставить("Идентификатор", Склад.УникальныйИдентификатор());
	СтруктураОбъекта.Вставить("ЭтоГруппа", Склад.ЭтоГруппа);
	СтруктураОбъекта.Вставить("Код", Склад.Код);
	СтруктураОбъекта.Вставить("Наименование", Склад.Наименование);

	Если Склад.ЭтоГруппа = Ложь Тогда
		СтруктураОбъекта.Вставить("Комментарий", Склад.Комментарий);
		СтруктураОбъекта.Вставить("ВидСклада", Строка(Склад.ВидСклада));
	КонецЕсли;

	Если ЗначениеЗаполнено(Склад.Родитель) Тогда         
		СтруктураОбъекта.Вставить("Родитель", ПолучитьСтруктуруСклад(Склад.Родитель));
	КонецЕсли;	
	
	Возврат СтруктураОбъекта;

КонецФункции	

&НаСервере
Функция ПолучитьСтруктуруЕдиницаИзмерения(ЕдиницаИзмерения)
	
	СтруктураОбъекта = Новый Структура();
	СтруктураОбъекта.Вставить("Тип", "Справочник.КлассификаторЕдиницИзмерения");
	СтруктураОбъекта.Вставить("Идентификатор", ЕдиницаИзмерения.УникальныйИдентификатор());
	СтруктураОбъекта.Вставить("Код", ЕдиницаИзмерения.Код);
	СтруктураОбъекта.Вставить("Наименование", ЕдиницаИзмерения.Наименование);
	СтруктураОбъекта.Вставить("НаименованиеПолное", ЕдиницаИзмерения.НаименованиеПолное);

	Возврат СтруктураОбъекта;

КонецФункции	

&НаСервере
Функция ПолучитьСтруктуруВидНоменклатуры(ВидНоменклатуры)
	
	СтруктураОбъекта = Новый Структура();
	СтруктураОбъекта.Вставить("Тип", "Справочник.ВидыНоменклатуры");
	СтруктураОбъекта.Вставить("Идентификатор", ВидНоменклатуры.УникальныйИдентификатор());
	СтруктураОбъекта.Вставить("Наименование", ВидНоменклатуры.Наименование);
	СтруктураОбъекта.Вставить("Услуга", ВидНоменклатуры.Услуга);
	
	Возврат СтруктураОбъекта;

КонецФункции	

&НаСервере
Функция ВыгрузитьСписаниеМатериалов(ЗапросJSON) Экспорт
	
	ДатаНачалаСтрокой = ЗапросJSON.ПараметрыЗапроса.Получить("StartDate");
	ДатаКонцаСтрокой = ЗапросJSON.ПараметрыЗапроса.Получить("EndDate");  
	Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
	
	ДатаНачала = ?(ДатаНачалаСтрокой=Неопределено, Дата(1,1,1), ПолучитьДатуИзСтроки(ДатаНачалаСтрокой));		
	ДатаКонца  = ?(ДатаКонцаСтрокой=Неопределено, Дата(1,1,1), ПолучитьДатуИзСтроки(ДатаКонцаСтрокой));		

	ДанныеСписаниеМатериалов = Новый Массив;
	
	Запрос = Новый Запрос;  

	Запрос.Текст = 
		"ВЫБРАТЬ
		|	уатМестонахождениеТССрезПоследних.Период КАК Период,
		|	уатМестонахождениеТССрезПоследних.ТС КАК ТС,
		|	уатМестонахождениеТССрезПоследних.Организация КАК Организация,
		|	уатМестонахождениеТССрезПоследних.Подразделение КАК Подразделение,
		|	уатМестонахождениеТССрезПоследних.Колонна КАК Колонна
		|ПОМЕСТИТЬ ВТ_уатМестонахождениеТССрезПоследних
		|ИЗ
		|	РегистрСведений.уатМестонахождениеТС.СрезПоследних(&ГраницаДатаОкончания, Организация = &Организация) КАК уатМестонахождениеТССрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА уатНоменклатураТСОбороты.Регистратор ССЫЛКА Документ.уатРемонтныйЛист
		|				И уатНоменклатураТСОбороты.Регистратор.СпособРемонта = ЗНАЧЕНИЕ(Перечисление.уатСпособыРемонта.РемЗона)
		|			ТОГДА уатНоменклатураТСОбороты.Регистратор.Контрагент
		|		КОГДА уатНоменклатураТСОбороты.Регистратор ССЫЛКА Документ.уатВыдачаРасходныхМатериалов
		|			ТОГДА уатНоменклатураТСОбороты.Регистратор.Склад
		|		ИНАЧЕ NULL
		|	КОНЕЦ КАК Склад,
		|	уатНоменклатураТСОбороты.ТС КАК ТранспортноеСредство,
		|	уатНоменклатураТСОбороты.Номенклатура КАК Номенклатура,
		|	уатНоменклатураТСОбороты.КоличествоОборот КАК Количество,
		|	ВЗ_уатМестонахождениеТССрезПоследних.Подразделение КАК Подразделение
		|ИЗ
		|	РегистрНакопления.уатНоменклатураТС.Обороты(&ДатаНачала, &ГраницаДатаОкончания, Регистратор, ) КАК уатНоменклатураТСОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ВТ_уатМестонахождениеТССрезПоследних.ТС КАК ТС,
		|			ВТ_уатМестонахождениеТССрезПоследних.Подразделение КАК Подразделение
		|		ИЗ
		|			ВТ_уатМестонахождениеТССрезПоследних КАК ВТ_уатМестонахождениеТССрезПоследних) КАК ВЗ_уатМестонахождениеТССрезПоследних
		|		ПО уатНоменклатураТСОбороты.ТС = ВЗ_уатМестонахождениеТССрезПоследних.ТС
		|ГДЕ
		|	уатНоменклатураТСОбороты.Регистратор.Организация = &Организация
		|	И уатНоменклатураТСОбороты.Номенклатура ССЫЛКА Справочник.Номенклатура
		|
		|УПОРЯДОЧИТЬ ПО
		|	Склад,
		|	Подразделение,
		|	уатНоменклатураТСОбороты.ТС,
		|	Номенклатура
		|АВТОУПОРЯДОЧИВАНИЕ";	
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ДатаНачала));
	
	Граница = Новый Граница(КонецДня(ДатаКонца), ВидГраницы.Включая);
    Запрос.УстановитьПараметр("ГраницаДатаОкончания", Граница); 
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СтруктураСтроки = ПолучитьСтруктуруСтрокиСписаниеМатериалов();
		ЗаполнитьЗначенияСвойств(СтруктураСтроки, ВыборкаДетальныеЗаписи);
		
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Склад) Тогда 
			СтруктураСклад = ПолучитьСтруктуруСклад(ВыборкаДетальныеЗаписи.Склад);
			СтруктураСтроки.Вставить("Склад", СтруктураСклад);
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ТранспортноеСредство) Тогда 
			СтруктураТС = ПолучитьСтруктуруТС(ВыборкаДетальныеЗаписи.ТранспортноеСредство);
			СтруктураСтроки.Вставить("ТранспортноеСредство", СтруктураТС);
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Подразделение) Тогда 
			СтруктураПодразделение = ПолучитьСтруктуруПодразделение(ВыборкаДетальныеЗаписи.Подразделение);
			СтруктураСтроки.Вставить("Подразделение", СтруктураПодразделение);
		КонецЕсли;	
		
		СтруктураСтроки.Вставить("Номенклатура", ПолучитьСтруктуруНоменклатура(ВыборкаДетальныеЗаписи.Номенклатура));
		
		ДанныеСписаниеМатериалов.Добавить(СтруктураСтроки);  
		
	КонецЦикла;
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("ДанныеСписаниеМатериалов", ДанныеСписаниеМатериалов);

	Возврат СтруктураДанных;
	
КонецФункции

&НаСервере
Функция ПолучитьСтруктуруСтрокиСписаниеМатериалов()
	
	СтруктураСтроки = Новый Структура;

	СтруктураСтроки.Вставить("Количество", 0); 
	
	Возврат СтруктураСтроки;
	
КонецФункции	

&НаСервере
Функция ПолучитьСотрудника(СтруктураОбъекта)
	
	УИДСсылки = Новый УникальныйИдентификатор(СтруктураОбъекта.Идентификатор);
	СсылкаВИБ = Справочники.Сотрудники.ПолучитьСсылку(УИДСсылки);
	
	Если СтрНайти(СсылкаВИБ, "Объект не найден") > 0 Тогда //Объекта нет в БД				
		
		ОбъектКакОбъект = Справочники.Сотрудники.СоздатьЭлемент();
		ОбъектКакОбъект.Код = СтруктураОбъекта.Код;  
		ОбъектКакОбъект.Наименование = СтруктураОбъекта.Наименование;    
		
		ОбъектКакОбъект.ФизическоеЛицо = ПолучитьФизическоеЛицо(СтруктураОбъекта.ФизическоеЛицо); 
		
		ОбъектКакОбъект.ВАрхиве = СтруктураОбъекта.ВАрхиве;
		//ОбъектКакОбъект.ДатаПриема = СтруктураОбъекта.ДатаПриема;                                                
		//ОбъектКакОбъект.ДатаУвольнения = СтруктураОбъекта.ДатаУвольнения;
		
		//ОбъектКакОбъект.Организация = ПолучитьОрганизацию(СтруктураОбъекта.Организация);
		ОбъектКакОбъект.ГоловнаяОрганизация = ПолучитьОрганизацию(СтруктураОбъекта.Организация);
		//ОбъектКакОбъект.Подразделение = ПолучитьПодразделение(СтруктураОбъекта.Подразделение);
		//ОбъектКакОбъект.Должность = ПолучитьДолжность(СтруктураОбъекта.Должность);
		
		ОбъектКакОбъект.ОбменДанными.Загрузка = Истина;
		ОбъектКакОбъект.ДополнительныеСвойства.Вставить("ПропуститьЗаписьВерсииОбъекта", Истина);
		УстановитьПривилегированныйРежим(Истина);

		ОбъектКакОбъект.УстановитьСсылкуНового(СсылкаВИБ);					
		ОбъектКакОбъект.Записать();	             

		УстановитьПривилегированныйРежим(Ложь);
		
		Возврат ОбъектКакОбъект.Ссылка;
		
	Иначе  
		Возврат СсылкаВИБ; 
	КонецЕсли;
	
КонецФункции		

Процедура ЗаписатьСНИЛСJSON(СтрокаJSON)Экспорт
	
	
	ЧтениеJSON = Новый ЧтениеJSON();
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
	 
	МассивПолейДат = Новый Массив;
	МассивПолейДат.Добавить("ДатаРождения");                    
	 
	СотрудникиМассив = ПрочитатьJSON(ЧтениеJSON,,МассивПолейДат,ФорматДатыJSON.ISO);
	Для Каждого СтрокаМассива Из СотрудникиМассив Цикл
		
		ФизическоеЛицо = ПолучитьФизическоеЛицо(СтрокаМассива); 
		
		ФизическоеЛицоОбъект = ФизическоеЛицо.ПолучитьОбъект();
		Если ЗначениеЗаполнено(ФизическоеЛицоОбъект.СтраховойНомерПФР) Тогда
			Продолжить;
		КонецЕсли;
		
		ФизическоеЛицоОбъект.СтраховойНомерПФР = СтрокаМассива.СтраховойНомерПФР;
		ФизическоеЛицоОбъект.Записать();
		
	КонецЦикла;

КонецПроцедуры

//Парсим JSON-строку
Процедура ЗагрузитьСотрудниковJSON(СтрокаJSON)Экспорт
	
	ЧтениеJSON = Новый ЧтениеJSON();
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
	 
	МассивПолейДат = Новый Массив;
	МассивПолейДат.Добавить("ДатаРождения");                    
	МассивПолейДат.Добавить("ДатаПриема"); 
	МассивПолейДат.Добавить("ДатаУвольнения");
	МассивПолейДат.Добавить("ДатаВыдачи");
	МассивПолейДат.Добавить("СрокДействия");
	 
	СотрудникиМассив = ПрочитатьJSON(ЧтениеJSON,,МассивПолейДат,ФорматДатыJSON.ISO);
	Для Каждого СтрокаМассива Из СотрудникиМассив Цикл
		
		Сотрудник = ПолучитьСотрудника(СтрокаМассива);
		
		Организация = ПолучитьОрганизацию(СтрокаМассива.Организация);
		Подразделение = ПолучитьПодразделение(СтрокаМассива.Подразделение);
		Должность = ПолучитьДолжность(СтрокаМассива.Должность);
		
		//Отражение приема сотрудника в уатКадроваяИсторияСотрудников
		//НаборЗаписей = РегистрыСведений.уатКадроваяИсторияСотрудников.СоздатьНаборЗаписей(); 
		
		//НаборЗаписей.Отбор.Период.Установить(СтрокаМассива.ДатаПриема); 
		//НаборЗаписей.Отбор.Организация.Установить(Организация); 
		//НаборЗаписей.Отбор.Сотрудник.Установить(Сотрудник); 

		//НоваяЗапись = НаборЗаписей.Добавить(); 
		//НоваяЗапись.Период = СтрокаМассива.ДатаПриема; 
		//НоваяЗапись.Организация = Организация; 
		//НоваяЗапись.Сотрудник = Сотрудник; 
		//
		//НоваяЗапись.Подразделение = Подразделение; 
		//НоваяЗапись.Должность = Должность; 

		//НаборЗаписей.Записать(); 

		
		НаборЗаписей = РегистрыСведений.ТекущиеКадровыеДанныеСотрудников.СоздатьНаборЗаписей(); 
		НаборЗаписей.Отбор.ТекущаяОрганизация.Установить(Организация); 
		НаборЗаписей.Отбор.Сотрудник.Установить(Сотрудник); 
		
		НоваяЗапись = НаборЗаписей.Добавить(); 
		НоваяЗапись.ТекущаяОрганизация = Организация; 
		НоваяЗапись.ГоловнаяОрганизация = Организация; 
		НоваяЗапись.Сотрудник = Сотрудник; 
		НоваяЗапись.ФизическоеЛицо = Сотрудник.ФизическоеЛицо; 
		
		НоваяЗапись.ТекущееПодразделение = Подразделение; 
		НоваяЗапись.ТекущаяДолжность = Должность; 
		НоваяЗапись.ДатаПриема = СтрокаМассива.ДатаПриема; 
		НоваяЗапись.ОсновноеРабочееМестоВОрганизации = Истина;
		
		НаборЗаписей.Записать(); 
		
		//Сведения о сотрудниках
		НаборЗаписей = РегистрыСведений.уатСведенияОСотрудниках.СоздатьНаборЗаписей(); 
		
		НаборЗаписей.Отбор.Период.Установить(СтрокаМассива.ДатаПриема); 
		НаборЗаписей.Отбор.Организация.Установить(Организация); 
		НаборЗаписей.Отбор.Сотрудник.Установить(Сотрудник); 

		НоваяЗапись = НаборЗаписей.Добавить(); 
		НоваяЗапись.Период = СтрокаМассива.ДатаПриема; 
		НоваяЗапись.Организация = Организация; 
		НоваяЗапись.Сотрудник = Сотрудник; 

		НаборЗаписей.Записать(); 
		
		//Регистрационные документы   
		Если СтрокаМассива.Свойство("РегистрационныйДокумент") Тогда
		//	ВодительскоеУдостоверение = ПолучитьРегистрационныйДокумент(Сотрудник, СтрокаМассива.РегистрационныйДокумент);
		КонецЕсли;	
		
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ПолучитьФизическоеЛицоПоФИОиИНН(ФИО, ИНН)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФизическиеЛица.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ФизическиеЛица КАК ФизическиеЛица
		|ГДЕ
		|	ФизическиеЛица.Наименование = &Наименование
		|	И ФизическиеЛица.ИНН = &ИНН";
	
	Запрос.УстановитьПараметр("ИНН", ИНН);
	Запрос.УстановитьПараметр("Наименование", ФИО);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат Неопределено;

КонецФункции	

&НаСервере
Функция ПолучитьФизическоеЛицо(СтруктураОбъекта)
	
	УИДСсылки = Новый УникальныйИдентификатор(СтруктураОбъекта.Идентификатор);
	СсылкаВИБ = Справочники.ФизическиеЛица.ПолучитьСсылку(УИДСсылки);
	
	Если СтрНайти(СсылкаВИБ, "Объект не найден") > 0 Тогда //Объекта нет в БД по ссылке
		
		ФизическоеЛицо = ПолучитьФизическоеЛицоПоФИОиИНН(СтруктураОбъекта.ФИО, СтруктураОбъекта.ИНН);
		Если ФизическоеЛицо <> Неопределено Тогда
			Возврат ФизическоеЛицо;
		КонецЕсли;	
		
		ОбъектКакОбъект = Справочники.ФизическиеЛица.СоздатьЭлемент();
		ОбъектКакОбъект.Код = СтруктураОбъекта.Код;  
		ОбъектКакОбъект.Наименование = СтруктураОбъекта.Наименование;    
		ОбъектКакОбъект.ДатаРождения = СтруктураОбъекта.ДатаРождения; 
		
		Если СтруктураОбъекта.Пол = "Мужской" Тогда
			ОбъектКакОбъект.Пол = Перечисления.ПолФизическогоЛица.Мужской;
		ИначеЕсли СтруктураОбъекта.Пол = "Женский" Тогда
			ОбъектКакОбъект.Пол = Перечисления.ПолФизическогоЛица.Женский; 
		КонецЕсли;	
	
		ОбъектКакОбъект.ФИО = СтруктураОбъекта.ФИО;                                                
		ОбъектКакОбъект.ИНН = СтруктураОбъекта.ИНН;
		ОбъектКакОбъект.СтраховойНомерПФР = СтруктураОбъекта.СтраховойНомерПФР;                                                

		ОбъектКакОбъект.УстановитьСсылкуНового(СсылкаВИБ);					
		ОбъектКакОбъект.Записать();	

		Если СтруктураОбъекта.Свойство("КонтактнаяИнформация") Тогда

			//Обработка табличной части "КонтактнаяИнформация"
			Для Каждого СтрокаМассиваКИ Из СтруктураОбъекта.КонтактнаяИнформация Цикл
				СтруктураКИ = ПолучитьСтруктуруКонтактнойИнформации(СтрокаМассиваКИ);
				НоваяСтрока = ОбъектКакОбъект.КонтактнаяИнформация.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураКИ);
			КонецЦикла;	

			ОбъектКакОбъект.Записать();	
			
		КонецЕсли;	
		
		//Документы физического лица
		УстановитьДокументыФизическогоЛица(ОбъектКакОбъект.Ссылка, СтруктураОбъекта.ДокументыФизлица);
		//ФИО Физлица
		УстановитьФИОФизлица(ОбъектКакОбъект.Ссылка, СтруктураОбъекта);
		
		Возврат ОбъектКакОбъект.Ссылка;

	Иначе  

		Возврат СсылкаВИБ; 

	КонецЕсли;
	
КонецФункции		

&НаСервере
Функция ПолучитьДолжность(СтруктураОбъекта)
	
	УИДСсылки = Новый УникальныйИдентификатор(СтруктураОбъекта.Идентификатор);
	СсылкаВИБ = Справочники.Должности.ПолучитьСсылку(УИДСсылки);
	
	Если СтрНайти(СсылкаВИБ, "Объект не найден") > 0 Тогда //Объекта нет в БД				
		
		ОбъектКакОбъект = Справочники.Должности.СоздатьЭлемент();

		ОбъектКакОбъект.Код = СтруктураОбъекта.Код;  
		ОбъектКакОбъект.Наименование = СтруктураОбъекта.Наименование;    

		ОбъектКакОбъект.УстановитьСсылкуНового(СсылкаВИБ);					
		ОбъектКакОбъект.Записать();	
		
		Возврат ОбъектКакОбъект.Ссылка;
		
	Иначе
		Возврат СсылкаВИБ; 
	КонецЕсли;
	
КонецФункции		

&НаСервере
Функция ПолучитьПодразделение(СтруктураОбъекта)

	Возврат ПолучитьОбъектПоИдентификатору(СтруктураОбъекта.Идентификатор);	
	
	//УИДСсылки = Новый УникальныйИдентификатор(СтруктураОбъекта.Идентификатор);
	//СсылкаВИБ = Справочники.ПодразделенияОрганизаций.ПолучитьСсылку(УИДСсылки);
	//
	//Если СтрНайти(СсылкаВИБ, "Объект не найден") > 0 Тогда //Объекта нет в БД				
	//	
	//	ОбъектКакОбъект = Справочники.ПодразделенияОрганизаций.СоздатьЭлемент();

	//	ОбъектКакОбъект.Владелец = ПолучитьОрганизацию(СтруктураОбъекта.Владелец);  
	//	ОбъектКакОбъект.Код = СтруктураОбъекта.Код;  
	//	ОбъектКакОбъект.Наименование = СтруктураОбъекта.Наименование;    
	//	ОбъектКакОбъект.КПП = СтруктураОбъекта.КПП;
	//	ОбъектКакОбъект.КодПоОКАТО = СтруктураОбъекта.КодПоОКАТО; 

	//	Если СтруктураОбъекта.Свойство("Родитель") Тогда 
	//		ОбъектКакОбъект.Родитель = ПолучитьПодразделение(СтруктураОбъекта.Родитель);
	//	КонецЕсли;
	//	
	//	ОбъектКакОбъект.УстановитьСсылкуНового(СсылкаВИБ);		
	//	ОбъектКакОбъект.ОбменДанными.Загрузка = Истина;
	//	ОбъектКакОбъект.Записать();	
	//	
	//	Возврат ОбъектКакОбъект.Ссылка;
	//	
	//Иначе
	//	Возврат СсылкаВИБ; 
	//КонецЕсли;
	
КонецФункции		

&НаСервере
Функция ПолучитьОрганизацию(СтруктураОбъекта)
	
 	//Организацию определяем по соответствию в регистре "ПубличныеИдентификаторыСинхронизируемыхОбъектов"
	Организация = ПолучитьОбъектПоИдентификатору(СтруктураОбъекта.Идентификатор);
	Если Организация = Неопределено Тогда   //Создаем новое соответствие по ИНН и КПП

		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Организации.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.Организации КАК Организации
			|ГДЕ
			|	Организации.ИНН = &ИНН
			|	И Организации.КПП = &КПП";
		
		Запрос.УстановитьПараметр("ИНН", СтруктураОбъекта.ИНН);
		Запрос.УстановитьПараметр("КПП", СтруктураОбъекта.КПП);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Организация = ВыборкаДетальныеЗаписи.Ссылка;
		КонецЦикла;

		Если Организация = Неопределено Тогда
			Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
		КонецЕсли;	
		
		НаборЗаписей = РегистрыСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов.СоздатьНаборЗаписей(); 

		НаборЗаписей.Отбор.Идентификатор.Установить(СтруктураОбъекта.Идентификатор); 
		НаборЗаписей.Отбор.УзелИнформационнойБазы.Установить(Неопределено); 

		НоваяЗапись = НаборЗаписей.Добавить(); 
		НоваяЗапись.Идентификатор = СтруктураОбъекта.Идентификатор; 
		НоваяЗапись.УзелИнформационнойБазы = Неопределено; 
		НоваяЗапись.Ссылка = Организация; 

		НаборЗаписей.Записать(); 
	
	КонецЕсли;

	Возврат Организация;	
	
КонецФункции	

Функция ПолучитьРегистрационныйДокумент(Сотрудник, РегистрационныйДокумент)

	//Поиск вод. удостоверения в регистрационных документах
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	уатРегистрационныеДокументы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.уатРегистрационныеДокументы КАК уатРегистрационныеДокументы
		|ГДЕ
		|	уатРегистрационныеДокументы.Организация = &Организация
		|	И уатРегистрационныеДокументы.ВладелецДокументов = &ВладелецДокументов
		|	И уатРегистрационныеДокументы.Подразделение = &Подразделение
		|	И уатРегистрационныеДокументы.ПринадлежностьДокументов = ЗНАЧЕНИЕ(Перечисление.уатПринадлежностьДокументов.ДокументыВодителя)
		|	И уатРегистрационныеДокументы.ВидДокумента = ЗНАЧЕНИЕ(Справочник.уатВидыДокументов.УдостоверениеВодителя)";
	
	Запрос.УстановитьПараметр("ВладелецДокументов", Сотрудник);
	Запрос.УстановитьПараметр("Организация", Сотрудник.Организация);
	Запрос.УстановитьПараметр("Подразделение", Сотрудник.Подразделение);
	                                                        
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка; 
	КонецЦикла;
	
	СпрОбъект = Справочники.уатРегистрационныеДокументы.СоздатьЭлемент();  
	ЗаполнитьЗначенияСвойств(СпрОбъект, РегистрационныйДокумент); 
	СпрОбъект.Организация = Сотрудник.Организация;
	СпрОбъект.Подразделение = Сотрудник.Подразделение;
	СпрОбъект.ПринадлежностьДокументов = Перечисления.уатПринадлежностьДокументов.ДокументыВодителя;
	СпрОбъект.ВидДокумента = Справочники.уатВидыДокументов.УдостоверениеВодителя;
	СпрОбъект.ВладелецДокументов = Сотрудник;
	СпрОбъект.Статус = Перечисления.уатСтатусыДействия.Действует;

	СпрОбъект.Записать();
		
	Возврат СпрОбъект.Ссылка;
	 
КонецФункции	 

&НаСервере
Функция ПолучитьВидКонтактнойИнформации(ВидКИ) 
	Возврат Справочники.ВидыКонтактнойИнформации.НайтиПоНаименованию(ВидКИ, Истина);
КонецФункции

&НаСервере
Функция ПолучитьТипКонтактнойИнформации(ТипКИ) 
	
	ТипКадровойИнформации = Неопределено;
	Если ТипКИ = "Адрес" Тогда 
		ТипКадровойИнформации = Перечисления.ТипыКонтактнойИнформации.Адрес;
	ИначеЕсли ТипКИ = "Телефон" Тогда 
		ТипКадровойИнформации = Перечисления.ТипыКонтактнойИнформации.Телефон;
	ИначеЕсли ТипКИ = "Адрес электронной почты" Тогда 
		ТипКадровойИнформации = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
	ИначеЕсли ТипКИ = "Skype" Тогда 
		ТипКадровойИнформации = Перечисления.ТипыКонтактнойИнформации.Skype;
	ИначеЕсли ТипКИ = "Веб страница" Тогда 
		ТипКадровойИнформации = Перечисления.ТипыКонтактнойИнформации.ВебСтраница;
	ИначеЕсли ТипКИ = "Факс" Тогда 
		ТипКадровойИнформации = Перечисления.ТипыКонтактнойИнформации.Факс;
	ИначеЕсли ТипКИ = "Другое" Тогда 
		ТипКадровойИнформации = Перечисления.ТипыКонтактнойИнформации.Другое;
	КонецЕсли;	

	Возврат ТипКадровойИнформации;
	
КонецФункции

&НаСервере
Функция ПолучитьСтруктуруКонтактнойИнформации(СтруктураОбъекта)
	
	СтруктураКИ = Новый Структура; 
	СтруктураКИ.Вставить("АдресЭП", СтруктураОбъекта.АдресЭП);
	СтруктураКИ.Вставить("Вид", ПолучитьВидКонтактнойИнформации(СтруктураОбъекта.Вид));
	СтруктураКИ.Вставить("ВидДляСписка", ПолучитьВидКонтактнойИнформации(СтруктураОбъекта.ВидДляСписка));
	СтруктураКИ.Вставить("Город", СтруктураОбъекта.Город);
	СтруктураКИ.Вставить("ДоменноеИмяСервера", СтруктураОбъекта.ДоменноеИмяСервера);
	СтруктураКИ.Вставить("Значение", СтруктураОбъекта.Значение);
	
	СтруктураКИ.Вставить("ЗначенияПолей", СтруктураОбъекта.ЗначенияПолей);
	СтруктураКИ.Вставить("НомерТелефона", СтруктураОбъекта.НомерТелефона);
	СтруктураКИ.Вставить("НомерТелефонаБезКодов", СтруктураОбъекта.НомерТелефонаБезКодов);
	СтруктураКИ.Вставить("Представление", СтруктураОбъекта.Представление);
	СтруктураКИ.Вставить("Регион", СтруктураОбъекта.Регион);
	СтруктураКИ.Вставить("Страна", СтруктураОбъекта.Страна);
	СтруктураКИ.Вставить("Тип", ПолучитьТипКонтактнойИнформации(СтруктураОбъекта.Тип));
	
	Возврат СтруктураКИ;
	 
КонецФункции

&НаСервере
Процедура УстановитьДокументыФизическогоЛица(ФизическоеЛицо, МассивДокументыФизлица)

	Для Каждого СтрокаМассива Из МассивДокументыФизлица Цикл
		
		ВидДокумента = ПолучитьВидДокумента(СтрокаМассива.ВидДокумента);
				
		//Запись в регистр
		НаборЗаписей = РегистрыСведений.ДокументыФизическихЛиц.СоздатьНаборЗаписей(); 

		НаборЗаписей.Отбор.Период.Установить(СтрокаМассива.ДатаВыдачи); 
		НаборЗаписей.Отбор.Физлицо.Установить(ФизическоеЛицо); 
		НаборЗаписей.Отбор.ВидДокумента.Установить(ВидДокумента); 

		НоваяЗапись = НаборЗаписей.Добавить(); 
		ЗаполнитьЗначенияСвойств(НоваяЗапись, СтрокаМассива); 
		
		НоваяЗапись.Период = СтрокаМассива.ДатаВыдачи; 
		НоваяЗапись.Физлицо = ФизическоеЛицо; 
		НоваяЗапись.ВидДокумента = ВидДокумента; 
		
		НаборЗаписей.Записать(); 
		
	КонецЦикла;	
	
КонецПроцедуры 

&НаСервере
Процедура УстановитьФИОФизлица(ФизЛицоОбъект, СтруктураОбъекта)
	
	МенеджерЗаписи = РегистрыСведений.ФИОФизическихЛиц.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период         = '18991231';
	МенеджерЗаписи.ФизическоеЛицо = ФизЛицоОбъект.Ссылка;
	МенеджерЗаписи.Фамилия        = СтруктураОбъекта.Фамилия;
	МенеджерЗаписи.Имя            = СтруктураОбъекта.Имя;
	МенеджерЗаписи.Отчество       = СтруктураОбъекта.Отчество;
	МенеджерЗаписи.Записать(Истина);
	
КонецПроцедуры	

&НаСервере
Функция ПолучитьОбъектПоИдентификатору(ИдентификаторОбъекта, НаименованиеОбъекта="", ТипОбъекта="", ДополнительныйРеквизит=Неопределено, СоздаватьОбъекты=Ложь)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПубличныеИдентификаторыСинхронизируемыхОбъектов.Ссылка КАК Ссылка
		|ИЗ
		|	РегистрСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов КАК ПубличныеИдентификаторыСинхронизируемыхОбъектов
		|ГДЕ
		|	ПубличныеИдентификаторыСинхронизируемыхОбъектов.Идентификатор = &Идентификатор
		|	И ПубличныеИдентификаторыСинхронизируемыхОбъектов.УзелИнформационнойБазы = НЕОПРЕДЕЛЕНО";
	
	Запрос.УстановитьПараметр("Идентификатор", ИдентификаторОбъекта);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	//Если СоздаватьОбъекты Тогда     
	//	
	//	ОбъектСсылка = ПолучитьСсылкуОбъекта(НаименованиеОбъекта, ДополнительныйРеквизит, ТипОбъекта); 
	//	Если ОбъектСсылка <> Неопределено Тогда
	//	
	//		НаборЗаписей = РегистрыСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов.СоздатьНаборЗаписей(); 

	//		НаборЗаписей.Отбор.Идентификатор.Установить(ИдентификаторОбъекта); 
	//		НаборЗаписей.Отбор.УзелИнформационнойБазы.Установить(Неопределено); 

	//		НоваяЗапись = НаборЗаписей.Добавить(); 
	//		НоваяЗапись.Идентификатор = ИдентификаторОбъекта; 
	//		НоваяЗапись.УзелИнформационнойБазы = Неопределено; 
	//		НоваяЗапись.Ссылка = ОбъектСсылка; 

	//		НаборЗаписей.Записать(); 
	//		
	//	КонецЕсли;			
	//	
	//	Возврат ОбъектСсылка;
	//	
	//Иначе	
	//	Сообщить("Не удалось определить объект с типом: " + ТипОбъекта + " для УИН: " + ИдентификаторОбъекта + " с наименованием: " + НаименованиеОбъекта);
		Возврат Неопределено;
	//КонецЕсли;	
	
КонецФункции	

&НаСервере
Функция ПолучитьВидДокумента(ВидДокумента)
	Возврат Справочники.ВидыДокументовФизическихЛиц.НайтиПоНаименованию(ВидДокумента);
КонецФункции		

Функция ПолучитьСписокСотрудников(ЗапросJSON) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТекущиеКадровыеДанныеСотрудников.Сотрудник КАК Сотрудник,
		|	ТекущиеКадровыеДанныеСотрудников.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ТекущиеКадровыеДанныеСотрудников.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|	ТекущиеКадровыеДанныеСотрудников.ДатаПриема КАК ДатаПриема,
		|	ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения КАК ДатаУвольнения
		|ПОМЕСТИТЬ ВТ_ТекущиеКадровыеДанныеСотрудников
		|ИЗ
		|	РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК ТекущиеКадровыеДанныеСотрудников
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Сотрудники.Ссылка КАК Сотрудник,
		|	Сотрудники.Наименование КАК СотрудникНаименование,
		|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Сотрудники.ФизическоеЛицо.ИНН КАК ФизическоеЛицоИНН,
		|	Сотрудники.ФизическоеЛицо.СтраховойНомерПФР КАК ФизическоеЛицоСтраховойНомерПФР,
		|	Сотрудники.ФизическоеЛицо.Наименование КАК ФизическоеЛицоНаименование,
		|	ВЗ_ТекущиеКадровыеДанныеСотрудников.ДатаПриема КАК ДатаПриема,
		|	ВЗ_ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения КАК ДатаУвольнения
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ВТ_ТекущиеКадровыеДанныеСотрудников.Сотрудник КАК Сотрудник,
		|			ВТ_ТекущиеКадровыеДанныеСотрудников.ФизическоеЛицо КАК ФизическоеЛицо,
		|			ВТ_ТекущиеКадровыеДанныеСотрудников.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|			ВТ_ТекущиеКадровыеДанныеСотрудников.ДатаПриема КАК ДатаПриема,
		|			ВТ_ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения КАК ДатаУвольнения
		|		ИЗ
		|			ВТ_ТекущиеКадровыеДанныеСотрудников КАК ВТ_ТекущиеКадровыеДанныеСотрудников) КАК ВЗ_ТекущиеКадровыеДанныеСотрудников
		|		ПО Сотрудники.Ссылка = ВЗ_ТекущиеКадровыеДанныеСотрудников.Сотрудник
		|			И Сотрудники.ФизическоеЛицо = ВЗ_ТекущиеКадровыеДанныеСотрудников.ФизическоеЛицо
		|			И Сотрудники.ГоловнаяОрганизация = ВЗ_ТекущиеКадровыеДанныеСотрудников.ГоловнаяОрганизация
		|ГДЕ
		|	Сотрудники.ЭтоГруппа = ЛОЖЬ
		|	И Сотрудники.ФизическоеЛицо.ЭтоГруппа = ЛОЖЬ
		|	И Сотрудники.ФизическоеЛицо <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
		|	И Сотрудники.ВАрхиве = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	МассивСотрудников = Новый Массив;

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СтруктураСотрудника = Новый Структура; 
		СтруктураСотрудника.Вставить("СотрудникУИД", ВыборкаДетальныеЗаписи.Сотрудник.УникальныйИдентификатор());   
		СтруктураСотрудника.Вставить("СотрудникНаименование", ВыборкаДетальныеЗаписи.СотрудникНаименование);   
		СтруктураСотрудника.Вставить("ДатаПриема", ВыборкаДетальныеЗаписи.ДатаПриема);   
		СтруктураСотрудника.Вставить("ДатаУвольнения", ВыборкаДетальныеЗаписи.ДатаУвольнения);   
		СтруктураСотрудника.Вставить("ФизическоеЛицоУИД", ВыборкаДетальныеЗаписи.ФизическоеЛицо.УникальныйИдентификатор());
		СтруктураСотрудника.Вставить("ФизическоеЛицоНаименование", ВыборкаДетальныеЗаписи.ФизическоеЛицоНаименование);   
		СтруктураСотрудника.Вставить("ФизическоеЛицоИНН", ВыборкаДетальныеЗаписи.ФизическоеЛицоИНН);         
		СтруктураСотрудника.Вставить("ФизическоеЛицоСтраховойНомерПФР", ВыборкаДетальныеЗаписи.ФизическоеЛицоСтраховойНомерПФР);         
		
		МассивСотрудников.Добавить(СтруктураСотрудника);
		
	КонецЦикла;
	
	ЗаписьJSON = Новый ЗаписьJSON;
	НастройкиСериализацииJSON = Новый НастройкиСериализацииJSON;
	НастройкиСериализацииJSON.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.ЛокальнаяДата;	
	НастройкиСериализацииJSON.ФорматСериализацииДаты = ФорматДатыJSON.ISO; 
	
	ЗаписьJSON.УстановитьСтроку();
	
	ЗаписатьJSON(ЗаписьJSON, МассивСотрудников, НастройкиСериализацииJSON, "ФункцияПреобразованияЗаписи", ЮЦАУ_ВнешнийПрограммныйИнтерфейс);    
	Результат = ЗаписьJSON.Закрыть();

	Возврат Результат;
	
КонецФункции	

//&НаСервере
//Функция ПолучитьПодразделение(СтруктураОбъекта)
//	
//	УИДСсылки = Новый УникальныйИдентификатор(СтруктураОбъекта.Идентификатор);
//	СсылкаВИБ = Справочники.ПодразделенияОрганизаций.ПолучитьСсылку(УИДСсылки);
//	
//	Если СтрНайти(СсылкаВИБ, "Объект не найден") > 0 Тогда //Объекта нет в БД				
//		
//		ОбъектКакОбъект = Справочники.ПодразделенияОрганизаций.СоздатьЭлемент();

//		ОбъектКакОбъект.Владелец = ПолучитьОрганизацию(СтруктураОбъекта.Владелец);  
//		ОбъектКакОбъект.Код = СтруктураОбъекта.Код;  
//		ОбъектКакОбъект.Наименование = СтруктураОбъекта.Наименование;    
//		
//		Если Не СтруктураОбъекта.ЭтоГруппа Тогда
//			ОбъектКакОбъект.КПП = СтруктураОбъекта.КПП;
//			ОбъектКакОбъект.КодПоОКАТО = СтруктураОбъекта.КодПоОКАТО; 
//		КонецЕсли;	

//		Если СтруктураОбъекта.Свойство("Родитель") Тогда 
//			ОбъектКакОбъект.Родитель = ПолучитьПодразделение(СтруктураОбъекта.Родитель);
//		КонецЕсли;
//		
//		ОбъектКакОбъект.УстановитьСсылкуНового(СсылкаВИБ);					

//		ОбъектКакОбъект.ОбменДанными.Загрузка = Истина;
//		ОбъектКакОбъект.Записать();	
//		
//		Возврат ОбъектКакОбъект.Ссылка;
//		
//	Иначе 
//		
//		Возврат СсылкаВИБ; 
//		
//	КонецЕсли;
//	
//КонецФункции		

&НаСервере
Функция ПолучитьВидСклада(ТипСклада)
	
	Если ТипСклада = "Оптовый склад" Тогда
		Возврат Перечисления.ВидыСкладов.Оптовый;
	ИначеЕсли ТипСклада = "Розничный магазин" Тогда
		Возврат Перечисления.ВидыСкладов.Розничный;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции	

&НаСервере
Функция ПолучитьСклад(СтруктураОбъекта)
	
	Возврат ПолучитьОбъектПоИдентификатору(СтруктураОбъекта.Идентификатор);
	
	//УИДСсылки = Новый УникальныйИдентификатор(СтруктураОбъекта.Идентификатор);
	//СсылкаВИБ = Справочники.Склады.ПолучитьСсылку(УИДСсылки);
	//
	//Если СтрНайти(СсылкаВИБ, "Объект не найден") > 0 Тогда //Объекта нет в БД				
	//	
	//	Если СтруктураОбъекта.ЭтоГруппа Тогда 
	//		ОбъектКакОбъект = Справочники.Склады.СоздатьГруппу();
	//	Иначе
	//		ОбъектКакОбъект = Справочники.Склады.СоздатьЭлемент();	
	//		ОбъектКакОбъект.Комментарий = СтруктураОбъекта.Комментарий;
	//		ОбъектКакОбъект.ВидСклада = ПолучитьВидСклада(СтруктураОбъекта.ТипСклада); 
	//	КонецЕсли;	

	//	ОбъектКакОбъект.Код = СтруктураОбъекта.Код;  
	//	ОбъектКакОбъект.Наименование = СтруктураОбъекта.Наименование;    

	//	Если СтруктураОбъекта.Свойство("Родитель") Тогда 
	//		ОбъектКакОбъект.Родитель = ПолучитьСклад(СтруктураОбъекта.Родитель);
	//	КонецЕсли;
	//	
	//	ОбъектКакОбъект.УстановитьСсылкуНового(СсылкаВИБ);					

	//	ОбъектКакОбъект.ОбменДанными.Загрузка = Истина;
	//	ОбъектКакОбъект.Записать();	
	//	
	//	Возврат ОбъектКакОбъект.Ссылка;
	//	
	//Иначе 
	//	
	//	Возврат СсылкаВИБ; 
	//	
	//КонецЕсли;
	
КонецФункции		

&НаСервере
Функция ПолучитьЕдиницуИзмерения(Номенклатура, ЕдиницаПоКлассификатору)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕдиницыИзмерения.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
		|ГДЕ
		|	ЕдиницыИзмерения.Владелец = &Номенклатура
		|	И ЕдиницыИзмерения.ЕдиницаПоКлассификатору = &ЕдиницаПоКлассификатору";
	
	Запрос.УстановитьПараметр("ЕдиницаПоКлассификатору", ЕдиницаПоКлассификатору);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка; 
	КонецЦикла;
	
	ОбъектКакОбъект = Справочники.ЕдиницыИзмерения.СоздатьЭлемент();	
	ОбъектКакОбъект.УстановитьНовыйКод();
	ОбъектКакОбъект.Владелец = Номенклатура;
	ОбъектКакОбъект.Наименование = ЕдиницаПоКлассификатору.Наименование;
	ОбъектКакОбъект.ЕдиницаПоКлассификатору = ЕдиницаПоКлассификатору;
	ОбъектКакОбъект.Коэффициент = 1;
	
	ОбъектКакОбъект.ОбменДанными.Загрузка = Истина;
	ОбъектКакОбъект.Записать();
	
	Возврат ОбъектКакОбъект.Ссылка;

КонецФункции

&НаСервере
Функция ПолучитьНоменклатуру(СтруктураОбъекта)
	
	УИДСсылки = Новый УникальныйИдентификатор(СтруктураОбъекта.Идентификатор);
	СсылкаВИБ = Справочники.Номенклатура.ПолучитьСсылку(УИДСсылки);
	
	Если СтрНайти(СсылкаВИБ, "Объект не найден") > 0 Тогда //Объекта нет в БД				
		
		Если СтруктураОбъекта.ЭтоГруппа Тогда 

			ОбъектКакОбъект = Справочники.Номенклатура.СоздатьГруппу();

		Иначе

			ОбъектКакОбъект = Справочники.Номенклатура.СоздатьЭлемент();	
			ОбъектКакОбъект.Артикул = СтруктураОбъекта.Артикул; 
		//	ОбъектКакОбъект.ВидНоменклатуры = ПолучитьВидНоменклатуры(СтруктураОбъекта.ВидНоменклатуры);     //Реквизит появляется в версии 2.2
			ОбъектКакОбъект.ЕдиницаИзмерения = ПолучитьЕдиницуИзмеренияПоКлассификатору(СтруктураОбъекта.ЕдиницаИзмерения);
			ОбъектКакОбъект.Комментарий = СтруктураОбъекта.Комментарий;
			ОбъектКакОбъект.НаименованиеПолное = СтруктураОбъекта.НаименованиеПолное;
			ОбъектКакОбъект.НоменклатурнаяГруппа = ПолучитьНоменклатурнуюГруппу(СтруктураОбъекта.НоменклатурнаяГруппа);
			ОбъектКакОбъект.НомерГТД = ПолучитьНомерГТД(СтруктураОбъекта.НомерГТД);
			//ОбъектКакОбъект.СтавкаНДС = ПолучитьСтавкуНДС(СтруктураОбъекта.СтавкаНДС);
			ОбъектКакОбъект.СтранаПроисхождения = ПолучитьСтрануМира(СтруктураОбъекта.СтранаПроисхождения); 
			ОбъектКакОбъект.Услуга = СтруктураОбъекта.Услуга;
			
		КонецЕсли;	

		ОбъектКакОбъект.Код = СтруктураОбъекта.Код;  
		ОбъектКакОбъект.Наименование = СтруктураОбъекта.Наименование;    

		Если СтруктураОбъекта.Свойство("Родитель") Тогда 
			ОбъектКакОбъект.Родитель = ПолучитьНоменклатуру(СтруктураОбъекта.Родитель);
		КонецЕсли;
		
		ОбъектКакОбъект.УстановитьСсылкуНового(СсылкаВИБ);					

		ОбъектКакОбъект.ОбменДанными.Загрузка = Истина;
		ОбъектКакОбъект.Записать();	

		//Заполнение зависимых реквизитов  
		Если Не ОбъектКакОбъект.ЭтоГруппа Тогда
			ОбъектКакОбъект.ЕдиницаХраненияОстатков = ПолучитьЕдиницуИзмерения(ОбъектКакОбъект.Ссылка, ОбъектКакОбъект.ЕдиницаИзмерения);
			ОбъектКакОбъект.Записать();	
		КонецЕсли;
		
		Возврат ОбъектКакОбъект.Ссылка;
		
	Иначе 
		
		Возврат СсылкаВИБ; 
		
	КонецЕсли;
	
КонецФункции		

&НаСервере
Функция ПолучитьЕдиницуИзмеренияПоКоду(Код)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КлассификаторЕдиницИзмерения.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения
		|ГДЕ
		|	КлассификаторЕдиницИзмерения.Код = &Код";
	
	Запрос.УстановитьПараметр("Код", Код);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Функция ПолучитьЕдиницуИзмеренияПоКлассификатору(СтруктураОбъекта)
	
	УИДСсылки = Новый УникальныйИдентификатор(СтруктураОбъекта.Идентификатор);
	СсылкаВИБ = Справочники.КлассификаторЕдиницИзмерения.ПолучитьСсылку(УИДСсылки);
	
	Если СтрНайти(СсылкаВИБ, "Объект не найден") > 0 Тогда //Объекта нет в БД				

		ОбъектКакСсылка = ПолучитьЕдиницуИзмеренияПоКоду(СтруктураОбъекта.Код); //Поиск по коду
		Если ОбъектКакСсылка = Неопределено Тогда
		
			Если СтруктураОбъекта.ЭтоГруппа Тогда 
				ОбъектКакОбъект = Справочники.КлассификаторЕдиницИзмерения.СоздатьГруппу();
			Иначе
				ОбъектКакОбъект = Справочники.КлассификаторЕдиницИзмерения.СоздатьЭлемент();
				ОбъектКакОбъект.НаименованиеПолное = СтруктураОбъекта.НаименованиеПолное;
			КонецЕсли;	

			ОбъектКакОбъект.Код = СтруктураОбъекта.Код;  
			ОбъектКакОбъект.Наименование = СтруктураОбъекта.Наименование;    

			Если СтруктураОбъекта.Свойство("Родитель") Тогда 
				ОбъектКакОбъект.Родитель = ПолучитьЕдиницуИзмеренияПоКлассификатору(СтруктураОбъекта.Родитель);
			КонецЕсли;
			
			ОбъектКакОбъект.УстановитьСсылкуНового(СсылкаВИБ);					

			ОбъектКакОбъект.ОбменДанными.Загрузка = Истина;
			ОбъектКакОбъект.Записать();	
			
			Возврат ОбъектКакОбъект.Ссылка;
			
		Иначе
			
			Возврат ОбъектКакСсылка;
			
		КонецЕсли;	
			
	Иначе 
		
		Возврат СсылкаВИБ; 
		
	КонецЕсли;
	
КонецФункции		

&НаСервере 
Функция ПолучитьСтавкуНДС(СтавкаНДС) 
	
	Если СтавкаНДС = "18%" Тогда
		Возврат Перечисления.СтавкиНДС.НДС18;
	ИначеЕсли СтавкаНДС = "18/118" Тогда
		Возврат Перечисления.СтавкиНДС.НДС18_118;
	ИначеЕсли СтавкаНДС = "10%" Тогда
		Возврат Перечисления.СтавкиНДС.НДС10;
	ИначеЕсли СтавкаНДС = "10/110" Тогда
		Возврат Перечисления.СтавкиНДС.НДС10_110;
	ИначеЕсли СтавкаНДС = "0%" Тогда
		Возврат Перечисления.СтавкиНДС.НДС0;
	ИначеЕсли СтавкаНДС = "Без НДС" Тогда
		Возврат Перечисления.СтавкиНДС.БезНДС;
	ИначеЕсли СтавкаНДС = "20%" Тогда
		Возврат Перечисления.СтавкиНДС.НДС20;
	ИначеЕсли СтавкаНДС = "20/120" Тогда
		Возврат Перечисления.СтавкиНДС.НДС20_120;
	Иначе
		Возврат Неопределено;
	КонецЕсли;	
	
КонецФункции	

&НаСервере
Функция ПолучитьСпособУстановкиКурсаВалюты(СпособУстановкиКурса)
	Если СпособУстановкиКурса = "Загрузка из интернета" Тогда
		Возврат Перечисления.СпособыУстановкиКурсаВалюты.ЗагрузкаИзИнтернета;
	ИначеЕсли СпособУстановкиКурса = "Ручной ввод" Тогда
		Возврат Перечисления.СпособыУстановкиКурсаВалюты.РучнойВвод;
	ИначеЕсли СпособУстановкиКурса = "Наценка на курс другой валюты" Тогда
		Возврат Перечисления.СпособыУстановкиКурсаВалюты.НаценкаНаКурсДругойВалюты;
	ИначеЕсли СпособУстановкиКурса = "Расчет по формуле" Тогда
		Возврат Перечисления.СпособыУстановкиКурсаВалюты.РасчетПоФормуле;
	Иначе
		Возврат Неопределено;
	КонецЕсли;	
	
КонецФункции	

&НаСервере
Функция ПолучитьВалютуПоКоду(Код)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Валюты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Валюты КАК Валюты
		|ГДЕ
		|	Валюты.Код = &Код";
	
	Запрос.УстановитьПараметр("Код", Код);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции	

&НаСервере
Функция ПолучитьВалюту(СтруктураОбъекта)

	УИДСсылки = Новый УникальныйИдентификатор(СтруктураОбъекта.Идентификатор);
	СсылкаВИБ = Справочники.Валюты.ПолучитьСсылку(УИДСсылки);
	
	Если СтрНайти(СсылкаВИБ, "Объект не найден") > 0 Тогда //Объекта нет в БД				

		ОбъектКакСсылка = ПолучитьВалютуПоКоду(СтруктураОбъекта.Код); //Поиск по коду

		Если ОбъектКакСсылка = Неопределено Тогда
		
			ОбъектКакОбъект = Справочники.Валюты.СоздатьЭлемент();

			ОбъектКакОбъект.Код = СтруктураОбъекта.Код;  
			ОбъектКакОбъект.Наименование = СтруктураОбъекта.Наименование;    
			ОбъектКакОбъект.НаименованиеПолное = СтруктураОбъекта.НаименованиеПолное;    
			ОбъектКакОбъект.ЗагружаетсяИзИнтернета = СтруктураОбъекта.ЗагружаетсяИзИнтернета; 
			ОбъектКакОбъект.Наценка = СтруктураОбъекта.Наценка;
			ОбъектКакОбъект.ОсновнаяВалюта = ПолучитьВалюту(СтруктураОбъекта.ОсновнаяВалюта);
			ОбъектКакОбъект.ПараметрыПрописи = СтруктураОбъекта.ПараметрыПрописи;    
			ОбъектКакОбъект.ФормулаРасчетаКурса = СтруктураОбъекта.ФормулаРасчетаКурса;    
			ОбъектКакОбъект.СпособУстановкиКурса = ПолучитьСпособУстановкиКурсаВалюты(СтруктураОбъекта.СпособУстановкиКурса);    
			
			ОбъектКакОбъект.УстановитьСсылкуНового(СсылкаВИБ);					

			ОбъектКакОбъект.ОбменДанными.Загрузка = Истина;
			ОбъектКакОбъект.Записать();	
		
			Возврат ОбъектКакОбъект.Ссылка;

		Иначе
			
			Возврат ОбъектКакСсылка; 
			
		Конецесли;	
		
	Иначе
		
		Возврат СсылкаВИБ; 	
		
	КонецЕсли;
	
КонецФункции		

&НаСервере
Функция ПолучитьЮридическоеФизическоеЛицо(ЮридическоеФизическоеЛицо)
	
	Если ЮридическоеФизическоеЛицо = "Юридическое лицо" Тогда
		Возврат Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо;
	ИначеЕсли ЮридическоеФизическоеЛицо = "Физическое лицо" Тогда		               
		Возврат Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо; 
	Иначе
		Возврат Неопределено;
	КонецЕсли;	
	
КонецФункции

&НаСервере
Функция ПолучитьСтрануМира(СтруктураОбъекта)
	
	Если ВРЕГ(СтруктураОбъекта.Наименование) = "РОССИЯ" Тогда
		Возврат Справочники.СтраныМира.Россия;
	КонецЕсли;	
	
	УИДСсылки = Новый УникальныйИдентификатор(СтруктураОбъекта.Идентификатор);
	СсылкаВИБ = Справочники.СтраныМира.ПолучитьСсылку(УИДСсылки);
	
	Если СтрНайти(СсылкаВИБ, "Объект не найден") > 0 Тогда //Объекта нет в БД				
		
		ОбъектКакОбъект = Справочники.СтраныМира.СоздатьЭлемент();	
		ОбъектКакОбъект.Код = СтруктураОбъекта.Код;  
		ОбъектКакОбъект.Наименование = СтруктураОбъекта.Наименование;    
		ОбъектКакОбъект.НаименованиеПолное = СтруктураОбъекта.НаименованиеПолное;    
		ОбъектКакОбъект.КодАльфа2 = СтруктураОбъекта.КодАльфа2;
		ОбъектКакОбъект.КодАльфа3 = СтруктураОбъекта.КодАльфа3;
		ОбъектКакОбъект.УчастникЕАЭС = СтруктураОбъекта.УчастникЕАЭС;
		ОбъектКакОбъект.МеждународноеНаименование = СтруктураОбъекта.МеждународноеНаименование; 

		ОбъектКакОбъект.УстановитьСсылкуНового(СсылкаВИБ);					

		ОбъектКакОбъект.ОбменДанными.Загрузка = Истина;
		ОбъектКакОбъект.Записать();	
		
		Возврат ОбъектКакОбъект.Ссылка;
		
	Иначе 
		
		Возврат СсылкаВИБ; 
		
	КонецЕсли;
	
КонецФункции		

&НаСервере
Функция ПолучитьКонтрагента(СтруктураОбъекта)
	
	УИДСсылки = Новый УникальныйИдентификатор(СтруктураОбъекта.Идентификатор);
	СсылкаВИБ = Справочники.Контрагенты.ПолучитьСсылку(УИДСсылки);
	
	Если СтрНайти(СсылкаВИБ, "Объект не найден") > 0 Тогда //Объекта нет в БД				
		
		Если СтруктураОбъекта.ЭтоГруппа Тогда 
			
			ОбъектКакОбъект = Справочники.Контрагенты.СоздатьГруппу();
			
		Иначе
			
			ОбъектКакОбъект = Справочники.Контрагенты.СоздатьЭлемент();	
			ОбъектКакОбъект.НаименованиеПолное = СтруктураОбъекта.НаименованиеПолное;
			ОбъектКакОбъект.Комментарий = СтруктураОбъекта.Комментарий;
			ОбъектКакОбъект.ИНН = СтруктураОбъекта.ИНН;
			ОбъектКакОбъект.КПП = СтруктураОбъекта.КПП;
			ОбъектКакОбъект.КодПоОКПО = СтруктураОбъекта.КодПоОКПО;
			ОбъектКакОбъект.ДополнительноеОписание = СтруктураОбъекта.ДополнительноеОписание;
			ОбъектКакОбъект.ЮридическоеФизическоеЛицо = ПолучитьЮридическоеФизическоеЛицо(СтруктураОбъекта.ЮридическоеФизическоеЛицо);
			//ОбъектКакОбъект.СтранаРегистрации = ПолучитьСтрануМира(СтруктураОбъекта.СтранаРегистрации);  //Отсутствуют в версии 2.1.3
			//ОбъектКакОбъект.НалоговыйНомер = СтруктураОбъекта.НалоговыйНомер;
			
		КонецЕсли;	

		ОбъектКакОбъект.Код = СтруктураОбъекта.Код;  
		ОбъектКакОбъект.Наименование = СтруктураОбъекта.Наименование;    

		Если СтруктураОбъекта.Свойство("Родитель") Тогда 
			ОбъектКакОбъект.Родитель = ПолучитьКонтрагента(СтруктураОбъекта.Родитель);
		КонецЕсли;
		
		ОбъектКакОбъект.УстановитьСсылкуНового(СсылкаВИБ);					

		ОбъектКакОбъект.ОбменДанными.Загрузка = Истина;
		ОбъектКакОбъект.Записать();	
		
		Если СтруктураОбъекта.Свойство("ГоловнойКонтрагент") Тогда
			ОбъектКакОбъект.ГоловнойКонтрагент = ПолучитьКонтрагента(СтруктураОбъекта.ГоловнойКонтрагент);
			ОбъектКакОбъект.Записать();	
		КонецЕсли;	
		
		Возврат ОбъектКакОбъект.Ссылка;
		
	Иначе 
		
		Возврат СсылкаВИБ; 
		
	КонецЕсли;
	
КонецФункции		

&НаСервере
Функция ПолучитьВидДоговора(ВидДоговора)

	Если ВидДоговора = "С покупателем" Тогда
		Возврат Перечисления.ВидыДоговоровКонтрагентов.СПокупателем;
	ИначеЕсли ВидДоговора = "С поставщиком" Тогда
		Возврат Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком;
	ИначеЕсли ВидДоговора = "С комитентом (принципалом) на продажу" Тогда
		Возврат Перечисления.ВидыДоговоровКонтрагентов.СКомитентом;
	ИначеЕсли ВидДоговора = "С комиссионером (агентом) на продажу" Тогда
		Возврат Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером;
	ИначеЕсли ВидДоговора = "С комитентом (принципалом) на закупку" Тогда
		Возврат Перечисления.ВидыДоговоровКонтрагентов.СКомитентомНаЗакупку;
	ИначеЕсли ВидДоговора = "С комиссионером (агентом) на закупку" Тогда
		Возврат Перечисления.ВидыДоговоровКонтрагентов.СКомиссионеромНаЗакупку;
	ИначеЕсли ВидДоговора = "С факторинговой компанией" Тогда
		Возврат Перечисления.ВидыДоговоровКонтрагентов.Прочее;
	ИначеЕсли ВидДоговора = "С транспортной компанией (доставка и оплата)" Тогда
		Возврат Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком;
	ИначеЕсли ВидДоговора = "Прочее" Тогда
		Возврат Перечисления.ВидыДоговоровКонтрагентов.Прочее;
	Иначе
		Возврат Неопределено;
	КонецЕсли;	
	
КонецФункции			

&НаСервере
Функция ПолучитьДоговорКонтрагента(СтруктураОбъекта)
	
	УИДСсылки = Новый УникальныйИдентификатор(СтруктураОбъекта.Идентификатор);
	СсылкаВИБ = Справочники.ДоговорыКонтрагентов.ПолучитьСсылку(УИДСсылки);
	
	Если СтрНайти(СсылкаВИБ, "Объект не найден") > 0 Тогда //Объекта нет в БД				
		
		Если СтруктураОбъекта.ЭтоГруппа Тогда

			ОбъектКакОбъект = Справочники.ДоговорыКонтрагентов.СоздатьГруппу();

		Иначе	
			
			ОбъектКакОбъект = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();
			ОбъектКакОбъект.ВалютаВзаиморасчетов = ПолучитьВалюту(СтруктураОбъекта.ВалютаВзаиморасчетов);
			ОбъектКакОбъект.ВидВзаиморасчетов = ПолучитьВидВзаиморасчетов(СтруктураОбъекта.ВидВзаиморасчетов);
			ОбъектКакОбъект.ВидДоговора = ПолучитьВидДоговора(СтруктураОбъекта.ВидДоговора);
			ОбъектКакОбъект.Комментарий = СтруктураОбъекта.Комментарий;    
			ОбъектКакОбъект.Дата = СтруктураОбъекта.Дата;    
			ОбъектКакОбъект.Номер = СтруктураОбъекта.Номер;    
			ОбъектКакОбъект.Организация = ПолучитьОрганизацию(СтруктураОбъекта.Организация);    
			ОбъектКакОбъект.РасчетыВУсловныхЕдиницах = СтруктураОбъекта.РасчетыВУсловныхЕдиницах;
			ОбъектКакОбъект.ТипЦен = ПолучитьТипЦенНоменклатуры(СтруктураОбъекта.ТипЦен);  
			ОбъектКакОбъект.Контрагент = ПолучитьКонтрагента(СтруктураОбъекта.Контрагент);
			
		КонецЕсли;	
		
		ОбъектКакОбъект.Владелец = ПолучитьКонтрагента(СтруктураОбъекта.Владелец);  
		ОбъектКакОбъект.Код = СтруктураОбъекта.Код;  
		ОбъектКакОбъект.Наименование = СтруктураОбъекта.Наименование;    
		
		Если СтруктураОбъекта.Свойство("Родитель") Тогда 
			ОбъектКакОбъект.Родитель = ПолучитьДоговорКонтрагента(СтруктураОбъекта.Родитель);
		КонецЕсли;
		
		ОбъектКакОбъект.УстановитьСсылкуНового(СсылкаВИБ);					

		ОбъектКакОбъект.ОбменДанными.Загрузка = Истина;
		ОбъектКакОбъект.Записать();	
		
		Возврат ОбъектКакОбъект.Ссылка;
		
	Иначе 
		
		Возврат СсылкаВИБ; 
		
	КонецЕсли;
	
КонецФункции		
 
&НаСервере
Функция ПолучитьВидНоменклатуры(СтруктураОбъекта)
	
	УИДСсылки = Новый УникальныйИдентификатор(СтруктураОбъекта.Идентификатор);
	СсылкаВИБ = Справочники.ВидыНоменклатуры.ПолучитьСсылку(УИДСсылки);
	
	Если СтрНайти(СсылкаВИБ, "Объект не найден") > 0 Тогда //Объекта нет в БД				
		
		Если СтруктураОбъекта.ЭтоГруппа Тогда 
			ОбъектКакОбъект = Справочники.ВидыНоменклатуры.СоздатьГруппу();
		Иначе
			ОбъектКакОбъект = Справочники.ВидыНоменклатуры.СоздатьЭлемент();	
			ОбъектКакОбъект.Услуга = СтруктураОбъекта.Услуга; 
		КонецЕсли;	

		ОбъектКакОбъект.Код = СтруктураОбъекта.Код;  
		ОбъектКакОбъект.Наименование = СтруктураОбъекта.Наименование;    

		Если СтруктураОбъекта.Свойство("Родитель") Тогда 
			ОбъектКакОбъект.Родитель = ПолучитьВидНоменклатуры(СтруктураОбъекта.Родитель);
		КонецЕсли;
		
		ОбъектКакОбъект.УстановитьСсылкуНового(СсылкаВИБ);					

		ОбъектКакОбъект.ОбменДанными.Загрузка = Истина;
		ОбъектКакОбъект.Записать();	
		
		Возврат ОбъектКакОбъект.Ссылка;
		
	Иначе 
		
		Возврат СсылкаВИБ; 
		
	КонецЕсли;
	
КонецФункции		

&НаСервере
Функция ПолучитьНомерГТД(СтруктураОбъекта)
	
	УИДСсылки = Новый УникальныйИдентификатор(СтруктураОбъекта.Идентификатор);
	СсылкаВИБ = Справочники.НомераГТД.ПолучитьСсылку(УИДСсылки);
	
	Если СтрНайти(СсылкаВИБ, "Объект не найден") > 0 Тогда //Объекта нет в БД				
		
		Если СтруктураОбъекта.ЭтоГруппа Тогда 
			ОбъектКакОбъект = Справочники.НомераГТД.СоздатьГруппу();
		Иначе
			ОбъектКакОбъект = Справочники.НомераГТД.СоздатьЭлемент();	
			ОбъектКакОбъект.Комментарий = СтруктураОбъекта.Комментарий;
		КонецЕсли;	

		ОбъектКакОбъект.Код = СтруктураОбъекта.Код;  
		ОбъектКакОбъект.Наименование = СтруктураОбъекта.Наименование;    

		Если СтруктураОбъекта.Свойство("Родитель") Тогда 
			ОбъектКакОбъект.Родитель = ПолучитьНомерГТД(СтруктураОбъекта.Родитель);
		КонецЕсли;
		
		ОбъектКакОбъект.УстановитьСсылкуНового(СсылкаВИБ);					

		ОбъектКакОбъект.ОбменДанными.Загрузка = Истина;
		ОбъектКакОбъект.Записать();	
		
		Возврат ОбъектКакОбъект.Ссылка;
		
	Иначе 
		
		Возврат СсылкаВИБ; 
		
	КонецЕсли;
	
КонецФункции		

&НаСервере
Функция ПолучитьНоменклатурнуюГруппу(СтруктураОбъекта)
	
	УИДСсылки = Новый УникальныйИдентификатор(СтруктураОбъекта.Идентификатор);
	СсылкаВИБ = Справочники.НоменклатурныеГруппы.ПолучитьСсылку(УИДСсылки);
	
	Если СтрНайти(СсылкаВИБ, "Объект не найден") > 0 Тогда //Объекта нет в БД				
		
		Если СтруктураОбъекта.ЭтоГруппа Тогда 
			ОбъектКакОбъект = Справочники.НоменклатурныеГруппы.СоздатьГруппу();
		Иначе
			ОбъектКакОбъект = Справочники.НоменклатурныеГруппы.СоздатьЭлемент();	
		КонецЕсли;	

		ОбъектКакОбъект.Код = СтруктураОбъекта.Код;  
		ОбъектКакОбъект.Наименование = СтруктураОбъекта.Наименование;    

		Если СтруктураОбъекта.Свойство("Родитель") Тогда 
			ОбъектКакОбъект.Родитель = ПолучитьНоменклатурнуюГруппу(СтруктураОбъекта.Родитель);
		КонецЕсли;
		
		ОбъектКакОбъект.УстановитьСсылкуНового(СсылкаВИБ);					

		ОбъектКакОбъект.ОбменДанными.Загрузка = Истина;
		ОбъектКакОбъект.Записать();	
		
		Возврат ОбъектКакОбъект.Ссылка;
		
	Иначе 
		
		Возврат СсылкаВИБ; 
		
	КонецЕсли;
	
КонецФункции		

&НаСервере
Функция ПолучитьПорядокОкругления(ПорядокОкругления)
	
	Если ПорядокОкругления = "0.01" Тогда
		Возврат Перечисления.ПорядкиОкругления.Окр0_01;
	ИначеЕсли ПорядокОкругления = "0.05" Тогда
		Возврат Перечисления.ПорядкиОкругления.Окр0_05;
	ИначеЕсли ПорядокОкругления = "0.1" Тогда
		Возврат Перечисления.ПорядкиОкругления.Окр0_1;
	ИначеЕсли ПорядокОкругления = "0.5" Тогда
		Возврат Перечисления.ПорядкиОкругления.Окр0_5;
	ИначеЕсли ПорядокОкругления = "1" Тогда
		Возврат Перечисления.ПорядкиОкругления.Окр1;
	ИначеЕсли ПорядокОкругления = "5" Тогда
		Возврат Перечисления.ПорядкиОкругления.Окр5;
	ИначеЕсли ПорядокОкругления = "10" Тогда
		Возврат Перечисления.ПорядкиОкругления.Окр10
	ИначеЕсли ПорядокОкругления = "50" Тогда
		Возврат Перечисления.ПорядкиОкругления.Окр50;
	ИначеЕсли ПорядокОкругления = "100" Тогда
		Возврат Перечисления.ПорядкиОкругления.Окр100;
	Иначе
		Возврат Неопределено;
	КонецЕсли;	
	
КонецФункции			

&НаСервере
Функция ПолучитьТипЦенНоменклатуры(СтруктураОбъекта)
	
	УИДСсылки = Новый УникальныйИдентификатор(СтруктураОбъекта.Идентификатор);
	СсылкаВИБ = Справочники.ТипыЦенНоменклатуры.ПолучитьСсылку(УИДСсылки);
	
	Если СтрНайти(СсылкаВИБ, "Объект не найден") > 0 Тогда //Объекта нет в БД				
		
		ОбъектКакОбъект = Справочники.ТипыЦенНоменклатуры.СоздатьЭлемент();	
		ОбъектКакОбъект.Код = СтруктураОбъекта.Код;  
		ОбъектКакОбъект.Наименование = СтруктураОбъекта.Наименование;    
		ОбъектКакОбъект.ВалютаЦены = ПолучитьВалюту(СтруктураОбъекта.ВалютаЦены);
		ОбъектКакОбъект.ЦенаВключаетНДС = СтруктураОбъекта.ЦенаВключаетНДС;
		ОбъектКакОбъект.ПорядокОкругления = ПолучитьПорядокОкругления(СтруктураОбъекта.ПорядокОкругления);
		ОбъектКакОбъект.ОкруглятьВБольшуюСторону = СтруктураОбъекта.ОкруглятьВБольшуюСторону;
		ОбъектКакОбъект.Комментарий = СтруктураОбъекта.Комментарий;
		
		ОбъектКакОбъект.УстановитьСсылкуНового(СсылкаВИБ);					

		ОбъектКакОбъект.ОбменДанными.Загрузка = Истина;
		ОбъектКакОбъект.Записать();	
		
		Возврат ОбъектКакОбъект.Ссылка;
		
	Иначе 
		
		Возврат СсылкаВИБ; 
		
	КонецЕсли;
	
КонецФункции	

&НаСервере
Функция ПолучитьВидВзаиморасчетов(СтруктураОбъекта)
	
	УИДСсылки = Новый УникальныйИдентификатор(СтруктураОбъекта.Идентификатор);
	СсылкаВИБ = Справочники.ВидыВзаиморасчетов.ПолучитьСсылку(УИДСсылки);
	
	Если СтрНайти(СсылкаВИБ, "Объект не найден") > 0 Тогда //Объекта нет в БД				
		
		ОбъектКакОбъект = Справочники.ВидыВзаиморасчетов.СоздатьЭлемент();	
		ОбъектКакОбъект.Код = СтруктураОбъекта.Код;  
		ОбъектКакОбъект.Наименование = СтруктураОбъекта.Наименование;    

		ОбъектКакОбъект.УстановитьСсылкуНового(СсылкаВИБ);					

		ОбъектКакОбъект.ОбменДанными.Загрузка = Истина;
		ОбъектКакОбъект.Записать();	
		
		Возврат ОбъектКакОбъект.Ссылка;
		
	Иначе 
		
		Возврат СсылкаВИБ; 
		
	КонецЕсли;
	
КонецФункции		

&НаСервере
Функция ВыгрузитьСписокСкладскихДокументов(ЗапросJSON) Экспорт
	
	ДатаНачалаСтрокой = ЗапросJSON.ПараметрыЗапроса.Получить("StartDate");
	ДатаКонцаСтрокой = ЗапросJSON.ПараметрыЗапроса.Получить("EndDate");  
	
	СтруктураОбъекта = Новый Структура;
	СтруктураОбъекта.Вставить("Идентификатор", ЗапросJSON.ПараметрыЗапроса.Получить("GUID"));  
	СтруктураОбъекта.Вставить("ИНН", ЗапросJSON.ПараметрыЗапроса.Получить("INN"));
	СтруктураОбъекта.Вставить("КПП", ЗапросJSON.ПараметрыЗапроса.Получить("KPP"));
	Организация = ПолучитьОрганизацию(СтруктураОбъекта);
	
	ДатаНачала = ?(ДатаНачалаСтрокой=Неопределено, Дата(1,1,1), ПолучитьДатуИзСтроки(ДатаНачалаСтрокой));		
	ДатаКонца  = ?(ДатаКонцаСтрокой=Неопределено, Дата(1,1,1), ПолучитьДатуИзСтроки(ДатаКонцаСтрокой));		

	ДанныеТаблицаДокументовУАТ = Новый Массив;
	
	Запрос = Новый Запрос;  
	Запрос.Текст =   
	"ВЫБРАТЬ
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ПоступлениеТоваровУслуг.Ссылка) КАК ГУИД,
	|	ПРЕДСТАВЛЕНИЕ(ПоступлениеТоваровУслуг.Ссылка) КАК ДокументУАТ,
	|	ПоступлениеТоваровУслуг.Проведен КАК ДокументУАТПроведен
	|ИЗ
	|	Документ.уатПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	|ГДЕ
	|	ПоступлениеТоваровУслуг.Организация = &Организация
	|	И ПоступлениеТоваровУслуг.Дата МЕЖДУ &ДатаНачала И &ДатаКонца
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ОприходованиеТоваров.Ссылка),
	|	ПРЕДСТАВЛЕНИЕ(ОприходованиеТоваров.Ссылка),
	|	ОприходованиеТоваров.Проведен
	|ИЗ
	|	Документ.уатОприходованиеТоваров КАК ОприходованиеТоваров
	|ГДЕ
	|	ОприходованиеТоваров.Организация = &Организация
	|	И ОприходованиеТоваров.Дата МЕЖДУ &ДатаНачала И &ДатаКонца
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ПеремещениеТоваров.Ссылка),
	|	ПРЕДСТАВЛЕНИЕ(ПеремещениеТоваров.Ссылка),
	|	ПеремещениеТоваров.Проведен
	|ИЗ
	|	Документ.уатПеремещениеТоваров КАК ПеремещениеТоваров
	|ГДЕ
	|	ПеремещениеТоваров.Организация = &Организация
	|	И ПеремещениеТоваров.Дата МЕЖДУ &ДатаНачала И &ДатаКонца
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ИнвентаризацияТоваров.Ссылка),
	|	ПРЕДСТАВЛЕНИЕ(ИнвентаризацияТоваров.Ссылка),
	|	ИнвентаризацияТоваров.Проведен
	|ИЗ
	|	Документ.уатИнвентаризацияТоваров КАК ИнвентаризацияТоваров
	|ГДЕ
	|	ИнвентаризацияТоваров.Организация = &Организация
	|	И ИнвентаризацияТоваров.Дата МЕЖДУ &ДатаНачала И &ДатаКонца";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ДатаНачала));
	Запрос.УстановитьПараметр("ДатаКонца", КонецДня(ДатаКонца));
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СтруктураСтроки = Новый Структура();
		СтруктураСтроки.Вставить("ГУИД", ВыборкаДетальныеЗаписи.ГУИД);
		СтруктураСтроки.Вставить("ДокументУАТ", ВыборкаДетальныеЗаписи.ДокументУАТ);
		СтруктураСтроки.Вставить("ДокументУАТПроведен", ВыборкаДетальныеЗаписи.ДокументУАТПроведен);
		
		ДанныеТаблицаДокументовУАТ.Добавить(СтруктураСтроки);  
		
	КонецЦикла;
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("ДанныеТаблицаДокументовУАТ", ДанныеТаблицаДокументовУАТ);

	Возврат СтруктураДанных;
	
КонецФункции	    

//Парсим JSON-строку
Процедура ЗагрузитьСкладскиеДокументыJSON(СтрокаJSON) Экспорт
	
	ЧтениеJSON = Новый ЧтениеJSON();
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
	 
	МассивПолейДат = Новый Массив;
	МассивПолейДат.Добавить("Дата");                    
	МассивПолейДат.Добавить("ДатаПриема"); 
	МассивПолейДат.Добавить("ДатаУвольнения");
	МассивПолейДат.Добавить("ДатаВыдачи");
	МассивПолейДат.Добавить("СрокДействия");
	
	СписокЗагруженныхДокументов = Новый СписокЗначений;
	
	МассивСкладскиеДокументы = ПрочитатьJSON(ЧтениеJSON,,МассивПолейДат,ФорматДатыJSON.ISO);
	Для Каждого СтруктураСтроки Из МассивСкладскиеДокументы Цикл
		
		Если СтруктураСтроки.Свойство("ТипДокумента") Тогда
			Если СтруктураСтроки.ТипДокумента = "ПоступлениеТоваровУслуг" Тогда

				ДокументСсылка = ЗагрузитьДокументПоступлениеТоваровУслуг(СтруктураСтроки);
				СписокЗагруженныхДокументов.Добавить(ДокументСсылка);

			ИначеЕсли СтруктураСтроки.ТипДокумента = "ИнвентаризацияТоваровНаСкладе" Тогда

				ДокументСсылка = ЗагрузитьДокументИнвентаризацияТоваровНаСкладе(СтруктураСтроки);
				СписокЗагруженныхДокументов.Добавить(ДокументСсылка);

			ИначеЕсли СтруктураСтроки.ТипДокумента = "ПеремещениеТоваров" Тогда

				ДокументСсылка = ЗагрузитьДокументПеремещениеТоваров(СтруктураСтроки);
				СписокЗагруженныхДокументов.Добавить(ДокументСсылка);

			ИначеЕсли СтруктураСтроки.ТипДокумента = "АвансовыйОтчет" Тогда

				ДокументСсылка = ЗагрузитьДокументОприходованиеТоваров(СтруктураСтроки);
				СписокЗагруженныхДокументов.Добавить(ДокументСсылка);

			ИначеЕсли СтруктураСтроки.ТипДокумента = "ОприходованиеТоваров" Тогда

				ДокументСсылка = ЗагрузитьДокументОприходованиеТоваров(СтруктураСтроки);
				СписокЗагруженныхДокументов.Добавить(ДокументСсылка);

			КонецЕсли;	
		КонецЕсли;
		
	КонецЦикла;

	//Проведение документов
	Для Каждого ЭлементСписка Из СписокЗагруженныхДокументов Цикл
		
		ДокументОбъект = ЭлементСписка.Значение.ПолучитьОбъект();
		Попытка
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
		КонецПопытки;	
		
	КонецЦикла;	
	
КонецПроцедуры   

&НаСервере 
Функция ЗагрузитьДокументОприходованиеТоваров(СтруктураОбъекта)
	
	УИДСсылки = Новый УникальныйИдентификатор(СтруктураОбъекта.Идентификатор);
	СсылкаВИБ = Документы.уатОприходованиеТоваров.ПолучитьСсылку(УИДСсылки);
	
	Если СтрНайти(СсылкаВИБ, "Объект не найден") > 0 Тогда //Объекта нет в БД				
		
		ОбъектКакОбъект = Документы.уатОприходованиеТоваров.СоздатьДокумент();
		ОбъектКакОбъект.Номер = СтруктураОбъекта.Номер;  
		ОбъектКакОбъект.Дата = СтруктураОбъекта.Дата;    
		ОбъектКакОбъект.Организация = ПолучитьОрганизацию(СтруктураОбъекта.Организация);
		
		ОбъектКакОбъект.ОбменДанными.Загрузка = Истина;
		ОбъектКакОбъект.ДополнительныеСвойства.Вставить("ПропуститьЗаписьВерсииОбъекта", Истина);
		УстановитьПривилегированныйРежим(Истина);

		ОбъектКакОбъект.УстановитьСсылкуНового(СсылкаВИБ);					
		ОбъектКакОбъект.Записать();	             

		УстановитьПривилегированныйРежим(Ложь);

	Иначе
		
		ОбъектКакОбъект	= СсылкаВИБ.ПолучитьОбъект();
		
	КонецЕсли;

	//Перезаписываем часть реквизитов
	ОбъектКакОбъект.Номер = СтруктураОбъекта.Номер;  
	ОбъектКакОбъект.Дата = СтруктураОбъекта.Дата;    
	ОбъектКакОбъект.Организация = ПолучитьОрганизацию(СтруктураОбъекта.Организация);
	ОбъектКакОбъект.Подразделение = ПолучитьПодразделение(СтруктураОбъекта.Подразделение);
	ОбъектКакОбъект.Склад = ПолучитьСклад(СтруктураОбъекта.Склад);
	ОбъектКакОбъект.Комментарий = СтруктураОбъекта.Комментарий;
	ОбъектКакОбъект.СуммаДокумента = СтруктураОбъекта.СуммаДокумента;
	Если СтруктураОбъекта.Свойство("Основание") Тогда
		ОбъектКакОбъект.Основание = СтруктураОбъекта.Основание;
	КонецЕсли;	
	
	ОбъектКакОбъект.Товары.Очистить();
	
	//Табличная часть "Товары"
	Для Каждого СтруктураСтроки Из СтруктураОбъекта.МассивТовары Цикл
		
		НоваяСтрока = ОбъектКакОбъект.Товары.Добавить();
		НоваяСтрока.Номенклатура = ПолучитьНоменклатуру(СтруктураСтроки.Номенклатура);
		НоваяСтрока.ЕдиницаИзмерения = НоваяСтрока.Номенклатура.ЕдиницаХраненияОстатков;
		НоваяСтрока.Количество = СтруктураСтроки.Количество;
		НоваяСтрока.Сумма = СтруктураСтроки.Сумма;
		НоваяСтрока.Цена = СтруктураСтроки.Цена;

	КонецЦикла;	

	ОбъектКакОбъект.ОбменДанными.Загрузка = Истина;
	ОбъектКакОбъект.Записать(РежимЗаписиДокумента.Запись);
	
	Возврат ОбъектКакОбъект.Ссылка;
	
КонецФункции

&НаСервере 
Функция ЗагрузитьДокументИнвентаризацияТоваровНаСкладе(СтруктураОбъекта)
	
	УИДСсылки = Новый УникальныйИдентификатор(СтруктураОбъекта.Идентификатор);
	СсылкаВИБ = Документы.уатИнвентаризацияТоваров.ПолучитьСсылку(УИДСсылки);
	
	Если СтрНайти(СсылкаВИБ, "Объект не найден") > 0 Тогда //Объекта нет в БД				
		
		ОбъектКакОбъект = Документы.уатИнвентаризацияТоваров.СоздатьДокумент();
		ОбъектКакОбъект.Номер = СтруктураОбъекта.Номер;  
		ОбъектКакОбъект.Дата = СтруктураОбъекта.Дата;    
		ОбъектКакОбъект.Организация = ПолучитьОрганизацию(СтруктураОбъекта.Организация);
		
		ОбъектКакОбъект.ОбменДанными.Загрузка = Истина;
		ОбъектКакОбъект.ДополнительныеСвойства.Вставить("ПропуститьЗаписьВерсииОбъекта", Истина);
		УстановитьПривилегированныйРежим(Истина);

		ОбъектКакОбъект.УстановитьСсылкуНового(СсылкаВИБ);					
		ОбъектКакОбъект.Записать();	             

		УстановитьПривилегированныйРежим(Ложь);

	Иначе
		
		ОбъектКакОбъект	= СсылкаВИБ.ПолучитьОбъект();
		
	КонецЕсли;

	//Перезаписываем часть реквизитов
	ОбъектКакОбъект.Номер = СтруктураОбъекта.Номер;  
	ОбъектКакОбъект.Дата = СтруктураОбъекта.Дата;    
	ОбъектКакОбъект.Организация = ПолучитьОрганизацию(СтруктураОбъекта.Организация);
	Если СтруктураОбъекта.Свойство("Подразделение") Тогда //Для совместимости с версией бух. проф.
		ОбъектКакОбъект.Подразделение = ПолучитьПодразделение(СтруктураОбъекта.Подразделение);
	КонецЕсли;	
	ОбъектКакОбъект.Склад = ПолучитьСклад(СтруктураОбъекта.Склад);
	ОбъектКакОбъект.Комментарий = СтруктураОбъекта.Комментарий;
	
	ОбъектКакОбъект.Товары.Очистить();
	
	//Табличная часть "Товары"
	Для Каждого СтруктураСтроки Из СтруктураОбъекта.МассивТовары Цикл
		
		НоваяСтрока = ОбъектКакОбъект.Товары.Добавить();
		НоваяСтрока.Номенклатура = ПолучитьНоменклатуру(СтруктураСтроки.Номенклатура);
		НоваяСтрока.ЕдиницаИзмерения = НоваяСтрока.Номенклатура.ЕдиницаХраненияОстатков;
		НоваяСтрока.Количество = СтруктураСтроки.Количество;
		НоваяСтрока.КоличествоУчет = СтруктураСтроки.КоличествоУчет;
		НоваяСтрока.Сумма = СтруктураСтроки.Сумма;
		НоваяСтрока.СуммаУчет = СтруктураСтроки.СуммаУчет;
		НоваяСтрока.Цена = СтруктураСтроки.Цена;

	КонецЦикла;	

	ОбъектКакОбъект.ОбменДанными.Загрузка = Истина;
	ОбъектКакОбъект.Записать(РежимЗаписиДокумента.Запись);
	
	Возврат ОбъектКакОбъект.Ссылка;
	
КонецФункции

&НаСервере 
Функция ЗагрузитьДокументПеремещениеТоваров(СтруктураОбъекта)
	
	УИДСсылки = Новый УникальныйИдентификатор(СтруктураОбъекта.Идентификатор);
	СсылкаВИБ = Документы.уатПеремещениеТоваров.ПолучитьСсылку(УИДСсылки);
	
	Если СтрНайти(СсылкаВИБ, "Объект не найден") > 0 Тогда //Объекта нет в БД				
		
		ОбъектКакОбъект = Документы.уатПеремещениеТоваров.СоздатьДокумент();
		ОбъектКакОбъект.Номер = СтруктураОбъекта.Номер;  
		ОбъектКакОбъект.Дата = СтруктураОбъекта.Дата;    
		ОбъектКакОбъект.Организация = ПолучитьОрганизацию(СтруктураОбъекта.Организация);
		
		ОбъектКакОбъект.ОбменДанными.Загрузка = Истина;
		ОбъектКакОбъект.ДополнительныеСвойства.Вставить("ПропуститьЗаписьВерсииОбъекта", Истина);
		УстановитьПривилегированныйРежим(Истина);

		ОбъектКакОбъект.УстановитьСсылкуНового(СсылкаВИБ);					
		ОбъектКакОбъект.Записать();	             

		УстановитьПривилегированныйРежим(Ложь);

	Иначе
		
		ОбъектКакОбъект	= СсылкаВИБ.ПолучитьОбъект();
		
	КонецЕсли;

	//Перезаписываем часть реквизитов
	ОбъектКакОбъект.Номер = СтруктураОбъекта.Номер;  
	ОбъектКакОбъект.Дата = СтруктураОбъекта.Дата;    
	ОбъектКакОбъект.Организация = ПолучитьОрганизацию(СтруктураОбъекта.Организация);
	
	ОбъектКакОбъект.Подразделение = ПолучитьПодразделение(СтруктураОбъекта.ПодразделениеОтправитель);
	ОбъектКакОбъект.СкладОтправитель = ПолучитьСклад(СтруктураОбъекта.СкладОтправитель);
	ОбъектКакОбъект.СкладПолучатель = ПолучитьСклад(СтруктураОбъекта.СкладПолучатель);
	ОбъектКакОбъект.Комментарий = СтруктураОбъекта.Комментарий;
	
	ОбъектКакОбъект.Товары.Очистить();
	
	//Табличная часть "Товары"
	Для Каждого СтруктураСтроки Из СтруктураОбъекта.МассивТовары Цикл
		
		НоваяСтрока = ОбъектКакОбъект.Товары.Добавить();
		НоваяСтрока.Номенклатура = ПолучитьНоменклатуру(СтруктураСтроки.Номенклатура);
		НоваяСтрока.Количество = СтруктураСтроки.Количество;
		
		ЕдиницаИзмеренияПоКлассификатору = ПолучитьЕдиницуИзмеренияПоКлассификатору(СтруктураСтроки.ЕдиницаИзмерения);
		НоваяСтрока.ЕдиницаИзмерения = ПолучитьЕдиницуИзмерения(НоваяСтрока.Номенклатура, ЕдиницаИзмеренияПоКлассификатору);

	КонецЦикла;	

	ОбъектКакОбъект.ОбменДанными.Загрузка = Истина;
	ОбъектКакОбъект.Записать(РежимЗаписиДокумента.Запись);
	
	Возврат ОбъектКакОбъект.Ссылка;	
	
КонецФункции

&НаСервере 
Функция ЗагрузитьДокументПоступлениеТоваровУслуг(СтруктураОбъекта)
	
	УИДСсылки = Новый УникальныйИдентификатор(СтруктураОбъекта.Идентификатор);
	СсылкаВИБ = Документы.уатПоступлениеТоваровУслуг.ПолучитьСсылку(УИДСсылки);
	
	Если СтрНайти(СсылкаВИБ, "Объект не найден") > 0 Тогда //Объекта нет в БД				
		
		ОбъектКакОбъект = Документы.уатПоступлениеТоваровУслуг.СоздатьДокумент();
		ОбъектКакОбъект.Номер = СтруктураОбъекта.Номер;  
		ОбъектКакОбъект.Дата = СтруктураОбъекта.Дата;    
		ОбъектКакОбъект.Организация = ПолучитьОрганизацию(СтруктураОбъекта.Организация);
		
		ОбъектКакОбъект.ОбменДанными.Загрузка = Истина;
		ОбъектКакОбъект.ДополнительныеСвойства.Вставить("ПропуститьЗаписьВерсииОбъекта", Истина);
		УстановитьПривилегированныйРежим(Истина);

		ОбъектКакОбъект.УстановитьСсылкуНового(СсылкаВИБ);					
		ОбъектКакОбъект.Записать();	             

		УстановитьПривилегированныйРежим(Ложь);

	Иначе
		
		ОбъектКакОбъект	= СсылкаВИБ.ПолучитьОбъект();
		
	КонецЕсли;

	//Перезаписываем часть реквизитов
	ОбъектКакОбъект.Номер = СтруктураОбъекта.Номер;  
	ОбъектКакОбъект.Дата = СтруктураОбъекта.Дата;    
	ОбъектКакОбъект.Организация = ПолучитьОрганизацию(СтруктураОбъекта.Организация);
	ОбъектКакОбъект.ВалютаДокумента = ПолучитьВалюту(СтруктураОбъекта.ВалютаДокумента);
	ОбъектКакОбъект.ДатаВходящегоДокумента = СтруктураОбъекта.ДатаВходящегоДокумента;
	ОбъектКакОбъект.НомерВходящегоДокумента = СтруктураОбъекта.НомерВходящегоДокумента;
	
	ОбъектКакОбъект.Подразделение = ПолучитьПодразделение(СтруктураОбъекта.Подразделение);

	ОбъектКакОбъект.Контрагент = ПолучитьКонтрагента(СтруктураОбъекта.Контрагент);
	ОбъектКакОбъект.ДоговорКонтрагента = ПолучитьДоговорКонтрагента(СтруктураОбъекта.ДоговорКонтрагента);
	ОбъектКакОбъект.Комментарий = СтруктураОбъекта.Комментарий;
	ОбъектКакОбъект.КратностьВзаиморасчетов = СтруктураОбъекта.КратностьВзаиморасчетов;
	ОбъектКакОбъект.КурсВзаиморасчетов = СтруктураОбъекта.КурсВзаиморасчетов;
	ОбъектКакОбъект.Склад = ПолучитьСклад(СтруктураОбъекта.Склад);
	ОбъектКакОбъект.СуммаВключаетНДС = СтруктураОбъекта.СуммаВключаетНДС;
	ОбъектКакОбъект.СуммаДокумента = СтруктураОбъекта.СуммаДокумента;
	
	ОбъектКакОбъект.Товары.Очистить();
	
	//Табличная часть "Товары"
	Для Каждого СтруктураСтроки Из СтруктураОбъекта.МассивТовары Цикл
		
		НоваяСтрока = ОбъектКакОбъект.Товары.Добавить();
		НоваяСтрока.Номенклатура = ПолучитьНоменклатуру(СтруктураСтроки.Номенклатура);
		
		ЕдиницаИзмеренияПоКлассификатору = ПолучитьЕдиницуИзмеренияПоКлассификатору(СтруктураСтроки.ЕдиницаИзмерения);
		НоваяСтрока.ЕдиницаИзмерения = ПолучитьЕдиницуИзмерения(НоваяСтрока.Номенклатура, ЕдиницаИзмеренияПоКлассификатору);
		НоваяСтрока.Количество = СтруктураСтроки.Количество;
		НоваяСтрока.СтавкаНДС = ПолучитьСтавкуНДС(СтруктураСтроки.СтавкаНДС);
		НоваяСтрока.Сумма = СтруктураСтроки.Сумма;
		НоваяСтрока.СуммаНДС = СтруктураСтроки.СуммаНДС;
		НоваяСтрока.Цена = СтруктураСтроки.Цена;
		
	КонецЦикла;	

	ОбъектКакОбъект.Услуги.Очистить();
	
	//Табличная часть "Услуги"
	Для Каждого СтруктураСтроки Из СтруктураОбъекта.МассивУслуги Цикл
		
		НоваяСтрока = ОбъектКакОбъект.Услуги.Добавить();  
		НоваяСтрока.Номенклатура = ПолучитьНоменклатуру(СтруктураСтроки.Номенклатура);
		НоваяСтрока.Содержание = СтруктураСтроки.Содержание;
		НоваяСтрока.Количество = СтруктураСтроки.Количество;
		НоваяСтрока.СтавкаНДС = ПолучитьСтавкуНДС(СтруктураСтроки.СтавкаНДС);
		НоваяСтрока.Сумма = СтруктураСтроки.Сумма;
		НоваяСтрока.СуммаНДС = СтруктураСтроки.СуммаНДС;
		НоваяСтрока.Цена = СтруктураСтроки.Цена;
		
	КонецЦикла;	
	
	ОбъектКакОбъект.ОбменДанными.Загрузка = Истина;
	ОбъектКакОбъект.Записать(РежимЗаписиДокумента.Запись);
	
	Возврат ОбъектКакОбъект.Ссылка;
	
КонецФункции


