////Метки изменения  //processor, //ЮЦАУ

// //Сервисные процедуры
Функция ПолучитьЗначениеПоИдентификатору(Идентификатор,Организация = Неопределено,ДатаСреза = '00010101000000') Экспорт
	
	Если Организация = Неопределено Тогда
		Организация = Справочники.Организации.ПустаяСсылка();
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗначенияПоУмолчанию_ЮЦАУСрезПоследних.Период,
	|	ЗначенияПоУмолчанию_ЮЦАУСрезПоследних.Идентификатор,
	|	ЗначенияПоУмолчанию_ЮЦАУСрезПоследних.Значение,
	|	ЗначенияПоУмолчанию_ЮЦАУСрезПоследних.Организация
	|ИЗ
	|	РегистрСведений.ЗначенияПоУмолчанию_ЮЦАУ.СрезПоследних(
	|			&ДатаСреза,
	|			Идентификатор = &Идентификатор
	|				И Организация = &Организация) КАК ЗначенияПоУмолчанию_ЮЦАУСрезПоследних";
	
	Запрос.УстановитьПараметр("Идентификатор",Идентификатор);
	Запрос.УстановитьПараметр("ДатаСреза",ДатаСреза);
	
	Если Организация <> Справочники.Организации.ПустаяСсылка() Тогда
		Запрос.УстановитьПараметр("Организация",Организация);
	Иначе	
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И Организация = &Организация","");
	КонецЕсли;
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат(Результат.Значение);
	КонецЕсли;
	
КонецФункции	

Процедура ОбработатьТребованиеНакладная(Документ)
	
	ПроводкиДокумента = Документ.Движения.Хозрасчетный.Выгрузить();
	
	Записывать = Ложь;
	
	Для Каждого Стр Из ПроводкиДокумента Цикл
		
		Если Стр.СчетКт.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.Материалы) Тогда
			
			Проводка = Документ.Движения.Хозрасчетный.Добавить();
			Проводка.Организация = Документ.Организация;
			Проводка.Содержание  = "Оприходованно ТМЦ (ДЭП)";
			Проводка.Период = Документ.Дата;
			
			Проводка.СчетДт = ПланыСчетов.Хозрасчетный.НайтиПоКоду("013");
			Проводка.СубконтоДт.Номенклатура = Стр.СубконтоКт2;
			Проводка.СубконтоДт.Склады = Стр.СубконтоКт3;
			Проводка.КоличествоДт = Стр.КоличествоКт;
			Проводка.Сумма = Стр.СУмма;
			
			
			Записывать = Истина;
			
		КонецЕсли;	
		
	КонецЦикла;	
	
	Если Записывать Тогда
		Попытка
			Документ.Движения.Хозрасчетный.Записать();
		Исключение
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры	

Функция ВремяВходитВИнтервал(пДатаВыезда,пДатаВозвращения,пНачалоОбеда,пКонецОбеда)
	
	пВремяОбеда = 0;
	
	Если  КонецДня(пДатаВыезда) < КонецДня(пДатаВозвращения) Тогда //Несколько  дней
		
		Пока пДатаВыезда < пДатаВозвращения Цикл
			
			КонецДня = Мин(КонецДня(пДатаВыезда),пДатаВозвращения);
			
			Если пДатаВыезда < Дата(Год(пДатаВыезда),Месяц(пДатаВыезда),День(пДатаВыезда),Час(пНачалоОбеда),Минута(пНачалоОбеда),Секунда(пНачалоОбеда)) И 
				КонецДня > Дата(Год(КонецДня),Месяц(КонецДня),День(КонецДня),Час(пКонецОбеда),Минута(пКонецОбеда),Секунда(пКонецОбеда)) Тогда 
				пВремяОбеда = пВремяОбеда + (пКонецОбеда-пНачалоОбеда);
			КонецЕсли;
			
			пДатаВыезда = КонецДня + 1;
			
		КонецЦикла;
		
		Возврат(пВремяОбеда);
		
	Иначе
		
		КонецДня = Мин(КонецДня(пДатаВыезда),пДатаВозвращения);
		
		Если пДатаВыезда < Дата(Год(пДатаВыезда),Месяц(пДатаВыезда),День(пДатаВыезда),Час(пНачалоОбеда),Минута(пНачалоОбеда),Секунда(пНачалоОбеда)) И 
			КонецДня > Дата(Год(КонецДня),Месяц(КонецДня),День(КонецДня),Час(пКонецОбеда),Минута(пКонецОбеда),Секунда(пКонецОбеда)) Тогда 
			пВремяОбеда = пВремяОбеда + (пКонецОбеда-пНачалоОбеда);
		КонецЕсли;
		
		Возврат(пВремяОбеда);
		
	КонецЕсли;	
	
	Возврат(0);
	
КонецФункции	

// Функция рассчитывает ночное время однодневного ПЛ
// Возвращает значение в секундах
Функция ВремяНочьОдинДень(ДокументСсылка,ДатаВыезда,ДатаВозвращения) Экспорт
	сВремяНочь = 0;
	Если ДатаВыезда - НачалоДня(ДатаВыезда) <= 21600 Тогда
		сВремяНочь = ?(ДатаВозвращения - НачалоДня(ДатаВозвращения) > 21600,
		уатОбщегоНазначения.уатВремяВСекунды(6) - (ДатаВыезда - НачалоДня(ДатаВыезда)),
		ДатаВозвращения - ДатаВыезда);
	КонецЕсли;	
	Если Час(ДатаВозвращения) >= 22 Тогда
		сВремяНочь = сВремяНочь + ?(Час(ДатаВыезда) < 22,
		(ДатаВозвращения - НачалоДня(ДатаВозвращения))- уатОбщегоНазначения.уатВремяВСекунды(22),
		ДатаВозвращения - ДатаВыезда) + ?(ДатаВозвращения = КонецДня(ДатаВыезда),1,0);
	КонецЕсли; 
	
	Возврат сВремяНочь;
КонецФункции	

// Функция рассчитывает ночное время первого дня многодневного ПЛ
// Возвращает значение в секундах
Функция ВремяНочьПервыйДень(ДокументСсылка,ДатаВыезда,ДатаВозвращения) Экспорт
	Если Час(ДатаВыезда) <= 6 Тогда
		// Время выезда раньше 6.00 -> Рассчитывается время работы до 6.00 + время работы с 22.00 до 24.00 = 2 часа
		сВремяНочь = уатОбщегоНазначения.уатВремяВСекунды(6) - (ДатаВыезда
		- НачалоДня(ДатаВыезда)) + уатОбщегоНазначения.уатВремяВСекунды(2);
	ИначеЕсли Час(ДатаВыезда) >= 22 Тогда
		// Время выезда позже 22.00 -> Рассчитывается время работы
		сВремяНочь = уатОбщегоНазначения.уатВремяВСекунды(24) - (ДатаВыезда - НачалоДня(ДатаВыезда));
	Иначе
		// Время выезда позже 6.00, но раньше 22.00 -> Рассчитывается время работы с 22.00 до 24.00 = 2 часа
		сВремяНочь = уатОбщегоНазначения.уатВремяВСекунды(2);
	КонецЕсли;
	
	Возврат сВремяНочь;
КонецФункции

// Функция рассчитывает ночное время последнего дня многодневного ПЛ
// Возвращает значение в секундах
Функция ВремяНочьПоследнийДень(ДокументСсылка,ДатаВыезда,ДатаВозвращения) Экспорт
	Если Час(ДатаВозвращения) >= 22 Тогда
		// Время возвращения позже 22.00 ->
		//Рассчитывается время работы с 22.00 до возвращения + время работы с 0.00 до 6.00 = 6 часам
		сВремяНочь = уатОбщегоНазначения.уатВремяВСекунды(6) + (ДатаВозвращения
		- НачалоДня(ДатаВозвращения)) - уатОбщегоНазначения.уатВремяВСекунды(22);
	ИначеЕсли ДатаВозвращения - НачалоДня(ДатаВозвращения) <= 21600 Тогда
		// Время возвращения раньше 6.00 -> Рассчитывается время работы
		сВремяНочь = ДатаВозвращения - НачалоДня(ДатаВозвращения);
	Иначе	
		// Время возвращения позже 6.00, но раньше 22.00 -> Рассчитывается время работы с 0.00 до 6.00 = 6 часам
		сВремяНочь = уатОбщегоНазначения.уатВремяВСекунды(6);
	КонецЕсли;
	
	Возврат сВремяНочь;
КонецФункции	

Процедура уатПутевойЛист(Источник)
	
	нзВыработка = РегистрыНакопления.уатВыработкаСотрудников.СоздатьНаборЗаписей();
	нзВыработка.Отбор.Регистратор.Установить(Источник.Ссылка);
	нзВыработка.Прочитать();
	
	нзПростои = РегистрыНакопления.уатПростои.СоздатьНаборЗаписей();
	нзПростои.Отбор.Регистратор.Установить(Источник.Ссылка);
	нзПростои.Прочитать();
	тзПростои = нзПростои.Выгрузить();
	
	нзРВС = РегистрыНакопления.уатРабочееВремяСотрудников.СоздатьНаборЗаписей();
	нзРВС.Отбор.Регистратор.Установить(Источник.Ссылка);
	нзРВС.Прочитать();
	тзРВС = нзРВС.Выгрузить();
	нзРВС.Очистить();
	
	Записывать = Ложь;
	
	Для а = (тзРВС.Количество()-1)* (-1) По 0 Цикл
		СтрРВС = тзРВС[а*(-1)];
		Если СтрРВС.ВидИспользованияРабочегоВремени = Справочники.уатВидыИспользованияРабочегоВремени.Работа  или 
			СтрРВС.ВидИспользованияРабочегоВремени = Справочники.уатВидыИспользованияРабочегоВремени.Ночные  или
			СтрРВС.ВидИспользованияРабочегоВремени = Справочники.уатВидыИспользованияРабочегоВремени.ПростойПочасовой Тогда
			
			тзРВС.Удалить(СтрРВС);
		КонецЕсли;
	КонецЦикла;
	
	
	ПростойВНочноеВремя = 0;
	
	Для Каждого СтрПростои Из тзПростои Цикл
		
		нСтр = тзРВС.Добавить();
		ЗаполнитьЗначенияСвойств(нСтр,СтрПростои);
		
		стрТЧПростои = Источник.Простои [СтрПростои.НомерСтроки - 1];
		
		Если стрТЧПростои.ВключенДвигатель Тогда
			нСтр.ВидИспользованияРабочегоВремени = Справочники.уатВидыИспользованияРабочегоВремени.Работа;
		Иначе
			нСтр.ВидИспользованияРабочегоВремени = Справочники.уатВидыИспользованияРабочегоВремени.ПростойПочасовой;
			ПростойВНочноеВремя = ПростойВНочноеВремя + ВремяНочьОдинДень(Источник.Ссылка,стрТЧПростои.НачалоПростоя,?(Час(стрТЧПростои.КонецПростоя)= 0,КонецДня(стрТЧПростои.КонецПростоя),стрТЧПростои.КонецПростоя));
		КонецЕсли;
		
		нСтр.Сотрудник = СтрПростои.Водитель;
		нСтр.Организация = Источник.Организация;
		
		ВремяПростоя = СтрПростои.Время;
		
		Если НЕ Источник.РежимРаботыТС.Пустая() Тогда
			Если Источник.РежимРаботыТС.Обед <> Дата(0001,01,01) Тогда
				КонПростоя = СтрПростои.Период+ВремяПростоя;
				Если КонПростоя = НачалоДня(СтрПростои.период +(60*60*24)) Тогда
					КонПростоя = КонПростоя - 1;
				КонецЕсли;	
				ВремяПростоя = ВремяПростоя - (ВремяВходитВИнтервал(СтрПростои.период,КонПростоя ,Источник.РежимРаботыТС.НачалоОбеда,Источник.РежимРаботыТС.КонецОбеда));
			КонецЕсли;
		КонецЕсли;
		
		нСтр.Время = ВремяПростоя;
		
		нСтр.ДатаРаботы = Источник.ДатаВыезда;
		нСтр.Период   = Источник.ДатаВыезда;
		нСтр.Дней = 1;
		
		Записывать = Истина;
		
	КонецЦикла;	
	
	Для Каждого СтрВВР Из нзВыработка Цикл
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	уатПутевойЛист.ДатаВыезда,
		|	уатПутевойЛист.ДатаВозвращения
		|ИЗ
		|	Документ.уатПутевойЛист КАК уатПутевойЛист
		|ГДЕ
		|	уатПутевойЛист.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		ВыборкаДетальныеЗаписи.Следующий();
		
		ДатаВыезда = ВыборкаДетальныеЗаписи.ДатаВыезда;
		ДатаВозвращения = ВыборкаДетальныеЗаписи.ДатаВозвращения;
		
		Если СтрВВР.ПараметрВыработки = Справочники.уатПараметрыВыработки.ВремяВРаботе  Тогда 
			нСтр = тзРВС.Добавить();
			ЗаполнитьЗначенияСвойств(нСтр,СтрВВР);
			Если Источник.ВидПЛ = Перечисления.уатВидыПЛ._4М Тогда
				нСтр.ВидИспользованияРабочегоВремени = Справочники.уатВидыИспользованияРабочегоВремени.КомандировкаПочасовая;
			Иначе	
				нСтр.ВидИспользованияРабочегоВремени = Справочники.уатВидыИспользованияРабочегоВремени.Работа;
			КонецЕсли;
			нСтр.Время = СтрВВР.Количество;
			нСтр.ДатаРаботы = Источник.ДатаВыезда;
			нСтр.Дней = 1;
			
			Записывать = Истина;
			Продолжить;
		КонецЕсли;	
		
		Если СтрВВР.ПараметрВыработки = Справочники.уатПараметрыВыработки.ВремяНочное Тогда
			
			Если НЕ Источник.РежимРаботыТС.Пустая() Тогда
				Если Источник.РежимРаботыТС.Обед <> Дата(0001,01,01) Тогда
					НочноеВремя = СтрВВР.Количество - ВремяВходитВИнтервал(ДатаВыезда,ДатаВозвращения,Источник.РежимРаботыТС.НачалоОбеда,Источник.РежимРаботыТС.КонецОбеда);
				Иначе
					НочноеВремя = СтрВВР.Количество;
				КонецЕсли;
			Иначе
				НочноеВремя = СтрВВР.Количество;
			КонецЕсли;
			
			Если НочноеВремя = ПростойВНочноеВремя Тогда
				НочноеВремя = 0;
				ПростойВНочноеВремя = 0;
			ИначеЕсли НочноеВремя < ПростойВНочноеВремя Тогда
				НочноеВремя = 0; 
				ПростойВНочноеВремя = ПростойВНочноеВремя - НочноеВремя; 
			ИначеЕсли НочноеВремя > ПростойВНочноеВремя Тогда
				НочноеВремя = НочноеВремя - ПростойВНочноеВремя;
				ПростойВНочноеВремя = 0;
			КонецЕсли;	
			
			Если НочноеВремя > 0 Тогда
				
				нСтр = тзРВС.Добавить();
				ЗаполнитьЗначенияСвойств(нСтр,СтрВВР);
				нСтр.ВидИспользованияРабочегоВремени = Справочники.уатВидыИспользованияРабочегоВремени.Ночные;
				нСтр.Время = НочноеВремя;
				нСтр.ДатаРаботы = Источник.ДатаВыезда;
				нСтр.Период   = Источник.ДатаВыезда;
				нСтр.Дней = 1;
				
				Записывать = Истина;
			КонецЕсли;
			
			Продолжить;
		КонецЕсли;	
		
		//Спец.работы 
		Если СтрВВР.ПараметрВыработки = Справочники.уатПараметрыВыработки.ВремяСпециальнойРаботы  Тогда 
			нСтр = тзРВС.Добавить();
			ЗаполнитьЗначенияСвойств(нСтр,СтрВВР);
			нСтр.ВидИспользованияРабочегоВремени = ПолучитьЗначениеПоИдентификатору ("ВремяСпециальнойРаботы",Источник.Организация,Источник.ДатаВыезда);
			нСтр.Время = СтрВВР.Количество;
			нСтр.ДатаРаботы = Источник.ДатаВыезда;
			нСтр.Дней = 1;
			Записывать = Истина;
			Продолжить;
		КонецЕсли;	
		
	КонецЦикла;	
	
	
	Если Записывать Тогда
		нзРВС.Загрузить(тзРВС);
		нзРВС.Записать();
	КонецЕсли;	
	
	нзВода = РегистрыНакопления.ЮЦАУ_РасходВодыПоВидамРабот.СоздатьНаборЗаписей();
	нзВода.Отбор.Регистратор.Установить(Источник.Ссылка);
	нзВода.Прочитать();
	нзВода.Очистить();
	
	Для Каждого СтрЗадание Из Источник.Задание Цикл
		
		нСтр = нзВода.Добавить();
		
		нСтр.Организация = Источник.Организация;
		нСтр.Период = Источник.Дата;
		нСтр.Участок = СтрЗадание.Подразделение;
		нСтр.КАУ = СтрЗадание.КАУ;
		нСтр.КАУ = СтрЗадание.ОбъемВоды;
		
	КонецЦикла;
	
	нзВода.Записать();
	//Автобусные перевозки
	Если Источник.ВидПЛ = Перечисления.уатВидыПЛ._6 Тогда
		нзРВС.Очистить();
		тзРВС.Очистить();
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	уатПутевойЛистЗадание.КоличествоЧасов,
		|	уатПутевойЛистЗадание.Смена,
		|	уатПутевойЛистЗадание.Маршрут
		|ИЗ
		|	Документ.уатПутевойЛист.Задание КАК уатПутевойЛистЗадание
		|ГДЕ
		|	уатПутевойЛистЗадание.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НочныеЧасы = 0;
			Если ВыборкаДетальныеЗаписи.Смена = Перечисления.ЮЦАУ_Смены.ПерваяСмена ИЛИ ВыборкаДетальныеЗаписи.Смена = Перечисления.ЮЦАУ_Смены.ПолнаяСмена Тогда
				Если ЗначениеЗаполнено(Источник.Водитель1) Тогда
					//Если НЕ ЗначениеЗаполнено(Источник.Сотрудник1) Тогда
					//	Если НЕ ВыборкаДетальныеЗаписи.Маршрут = ЮЦАУ.ПолучитьЗначениеПоИдентификатору("Дежурный", Источник.Организация, Источник.Дата) Тогда
					//		
					//		зВыработка = тзРВС.Добавить();
					//		зВыработка.Время = ЮЦАУ.ПолучитьЗначениеПоИдентификатору("СдачаВыручкиВремя", Источник.Организация, Источник.Дата);
					//		зВыработка.Сотрудник = Источник.Водитель1;
					//		зВыработка.Организация = Источник.Организация;
					//		зВыработка.ВидИспользованияРабочегоВремени = ЮЦАУ.ПолучитьЗначениеПоИдентификатору("СдачаВыручки", Источник.Организация, Источник.Дата);
					//		зВыработка.ДатаРаботы = Источник.ДатаВыезда;
					//		зВыработка.Регистратор = Источник.Ссылка;
					//		зВыработка.Маршрут = ВыборкаДетальныеЗаписи.Маршрут;
					//		зВыработка.Период = Источник.Дата;
					//		зВыработка.Дней = 1;
					//		зВыработка.Активность = Истина;
					//		зВыработка.ВидПутевогоЛиста = Источник.ВидПЛ;
					//		Выручка = Истина;
					//	КонецЕсли;						
					//КонецЕсли;
					
					//зВыработка = тзРВС.Добавить();
					//МассивСтрок = тзРВС.НайтиСтроки(Новый Структура("Организация, Период, Сотрудник, ВидИспользованияРабочегоВремени", Источник.Организация, НачалоДня(Источник.Дата), Источник.Водитель1, ЮЦАУ.ПолучитьЗначениеПоИдентификатору("ПЗР", Источник.Организация, Источник.Дата)));
					//зВыработка.Время = ЮЦАУ.ПолучитьЗначениеПоИдентификатору("ПЗРВремяАвтобусы", Источник.Организация, Источник.Дата);
					//зВыработка.Сотрудник = Источник.Водитель1;
					//зВыработка.Организация = Источник.Организация;
					//зВыработка.ВидИспользованияРабочегоВремени = ЮЦАУ.ПолучитьЗначениеПоИдентификатору("ПЗР", Источник.Организация, Источник.Дата);
					//зВыработка.ДатаРаботы = Источник.ДатаВыезда;
					//зВыработка.Регистратор = Источник.Ссылка;
					////зВыработка.Маршрут = ВыборкаДетальныеЗаписи.Маршрут;
					//зВыработка.Период = Источник.Дата;
					//зВыработка.Дней = 1;
					//зВыработка.Активность = Истина;
					////зВыработка.ВидПутевогоЛиста = Источник.ВидПЛ;
					////
					////зВыработка = тзРВС.Добавить();
					//зВыработка.Время = ЮЦАУ.ПолучитьЗначениеПоИдентификатору("МедикВремя", Источник.Организация, Источник.Дата);
					//зВыработка.Сотрудник = Источник.Водитель1;
					//зВыработка.Организация = Источник.Организация;
					//зВыработка.ВидИспользованияРабочегоВремени = ЮЦАУ.ПолучитьЗначениеПоИдентификатору("Медик", Источник.Организация, Источник.Дата);
					//зВыработка.ДатаРаботы = Источник.ДатаВыезда;
					//зВыработка.Регистратор = Источник.Ссылка;
					//зВыработка.Маршрут = ВыборкаДетальныеЗаписи.Маршрут;
					//зВыработка.Период = Источник.Дата;
					//зВыработка.Дней = 1;
					//зВыработка.Активность = Истина;
					//зВыработка.ВидПутевогоЛиста = Источник.ВидПЛ;
					
					//ночные
					Если ВыборкаДетальныеЗаписи.Смена = Перечисления.ЮЦАУ_Смены.ПолнаяСмена Тогда
						НочныеЧасы = ПолучитьНочныеДляПолнойСмены(Источник);
						Если НочныеЧасы > 0 Тогда
							зВыработка = тзРВС.Добавить();
							зВыработка.Время = НочныеЧасы - ПростойВНочноеВремя;
							зВыработка.Сотрудник = Источник.Водитель1;
							зВыработка.Организация = Источник.Организация;
							зВыработка.ВидИспользованияРабочегоВремени = Справочники.уатВидыИспользованияРабочегоВремени.Ночные;
							зВыработка.ДатаРаботы = Источник.ДатаВыезда;
							зВыработка.Регистратор = Источник.Ссылка;
							//зВыработка.Маршрут = ВыборкаДетальныеЗаписи.Маршрут;
							зВыработка.Период = Источник.Дата;
							зВыработка.Дней = 1;
							зВыработка.Активность = Истина;
							//зВыработка.ВидПутевогоЛиста = Источник.ВидПЛ;
						КонецЕсли;
						НочныеЧасы = 0;
						
					Иначе
						
						НочныеЧасы = ПолучитьНочныеДляПервойСмены(Источник);
						Если НочныеЧасы > 0 Тогда
							зВыработка = тзРВС.Добавить();
							зВыработка.Время = НочныеЧасы - ПростойВНочноеВремя;
							зВыработка.Сотрудник = Источник.Водитель1;
							зВыработка.Организация = Источник.Организация;
							зВыработка.ВидИспользованияРабочегоВремени = Справочники.уатВидыИспользованияРабочегоВремени.Ночные;
							зВыработка.ДатаРаботы = Источник.ДатаВыезда;
							зВыработка.Регистратор = Источник.Ссылка;
							//зВыработка.Маршрут = ВыборкаДетальныеЗаписи.Маршрут;
							зВыработка.Период = Источник.Дата;
							зВыработка.Дней = 1;
							зВыработка.Активность = Истина;
							//зВыработка.ВидПутевогоЛиста = Источник.ВидПЛ;
						КонецЕсли;
						//НочныеЧасы = 0;
						
					КонецЕсли;
					
					зВыработка = тзРВС.Добавить();
					зВыработка.Время = 60*(Цел(ВыборкаДетальныеЗаписи.КоличествоЧасов)*60 + (ВыборкаДетальныеЗаписи.КоличествоЧасов- Цел(ВыборкаДетальныеЗаписи.КоличествоЧасов))*100);// - ВремяПростоя1;// - НочныеЧасы;
					зВыработка.Сотрудник = Источник.Водитель1;
					зВыработка.Организация = Источник.Организация;
					зВыработка.ВидИспользованияРабочегоВремени = Справочники.уатВидыИспользованияРабочегоВремени.Работа;
					зВыработка.ДатаРаботы = Источник.ДатаВыезда;
					зВыработка.Регистратор = Источник.Ссылка;
					//зВыработка.Маршрут = ВыборкаДетальныеЗаписи.Маршрут;
					зВыработка.Период = Источник.Дата;
					зВыработка.Дней = 1;
					зВыработка.Активность = Истина;
					//зВыработка.ВидПутевогоЛиста = Источник.ВидПЛ;
					Выручка = Ложь;
					НочныеЧасы = 0;
					
				КонецЕсли;
				//Если ЗначениеЗаполнено(Источник.Сотрудник1) Тогда
				//	Если НЕ ВыборкаДетальныеЗаписи.Маршрут = ЮЦАУ.ПолучитьЗначениеПоИдентификатору("Дежурный", Источник.Организация, Источник.Дата) Тогда
				//		зВыработка = тзРВС.Добавить();
				//		зВыработка.Время = ЮЦАУ.ПолучитьЗначениеПоИдентификатору("СдачаВыручкиВремя", Источник.Организация, Источник.Дата);
				//		зВыработка.Сотрудник = Источник.Сотрудник1;
				//		зВыработка.Организация = Источник.Организация;
				//		зВыработка.ВидИспользованияРабочегоВремени = ЮЦАУ.ПолучитьЗначениеПоИдентификатору("СдачаВыручки", Источник.Организация, Источник.Дата);
				//		зВыработка.ДатаРаботы = Источник.ДатаВыезда;
				//		зВыработка.Регистратор = Источник.Ссылка;
				//		зВыработка.Маршрут = ВыборкаДетальныеЗаписи.Маршрут;
				//		зВыработка.Период = Источник.Дата;
				//		зВыработка.Дней = 1;
				//		зВыработка.Активность = Истина;
				//		зВыработка.ВидПутевогоЛиста = Источник.ВидПЛ;
				//	КонецЕсли;
				//	
					//зВыработка = тзРВС.Добавить();
					//зВыработка.Время = ЮЦАУ.ПолучитьЗначениеПоИдентификатору("ПЗРВремяАвтобусы", Источник.Организация, Источник.Дата);
					//зВыработка.Сотрудник = Источник.Сотрудник1;
					//зВыработка.Организация = Источник.Организация;
					//зВыработка.ВидИспользованияРабочегоВремени = ЮЦАУ.ПолучитьЗначениеПоИдентификатору("ПЗР", Источник.Организация, Источник.Дата);
					//зВыработка.ДатаРаботы = Источник.ДатаВыезда;
					//зВыработка.Регистратор = Источник.Ссылка;
					////зВыработка.Маршрут = ВыборкаДетальныеЗаписи.Маршрут;
					//зВыработка.Период = Источник.Дата;
					//зВыработка.Дней = 1;
					//зВыработка.Активность = Истина;
					////зВыработка.ВидПутевогоЛиста = Источник.ВидПЛ;
				//	
				//	//ночные
				//	Если ВыборкаДетальныеЗаписи.Смена = Перечисления.ЮЦАУ_Смены.ПолнаяСмена Тогда
				//		НочныеЧасы = ПолучитьНочныеДляПолнойСмены(Источник);
				//		Если НочныеЧасы > 0 Тогда
				//			зВыработка = тзРВС.Добавить();
				//			зВыработка.Время = НочныеЧасы - ПростойВНочноеВремя;
				//			зВыработка.Сотрудник = Источник.Сотрудник1;
				//			зВыработка.Организация = Источник.Организация;
				//			зВыработка.ВидИспользованияРабочегоВремени = Справочники.уатВидыИспользованияРабочегоВремени.Ночные;
				//			зВыработка.ДатаРаботы = Источник.ДатаВыезда;
				//			зВыработка.Регистратор = Источник.Ссылка;
				//			зВыработка.Маршрут = ВыборкаДетальныеЗаписи.Маршрут;
				//			зВыработка.Период = Источник.Дата;
				//			зВыработка.Дней = 1;
				//			зВыработка.Активность = Истина;
				//			зВыработка.ВидПутевогоЛиста = Источник.ВидПЛ;
				//		КонецЕсли;
				//		НочныеЧасы = 0;
				//		
				//	Иначе
				//		
				//		НочныеЧасы = ПолучитьНочныеДляПервойСмены(Источник);
				//		Если НочныеЧасы > 0 Тогда
				//			зВыработка = тзРВС.Добавить();
				//			зВыработка.Время = НочныеЧасы - ПростойВНочноеВремя;
				//			зВыработка.Сотрудник = Источник.Сотрудник1;
				//			зВыработка.Организация = Источник.Организация;
				//			зВыработка.ВидИспользованияРабочегоВремени = Справочники.уатВидыИспользованияРабочегоВремени.Ночные;
				//			зВыработка.ДатаРаботы = Источник.ДатаВыезда;
				//			зВыработка.Регистратор = Источник.Ссылка;
				//			зВыработка.Маршрут = ВыборкаДетальныеЗаписи.Маршрут;
				//			зВыработка.Период = Источник.Дата;
				//			зВыработка.Дней = 1;
				//			зВыработка.Активность = Истина;
				//			зВыработка.ВидПутевогоЛиста = Источник.ВидПЛ;
				//		КонецЕсли;
				//		//НочныеЧасы = 0;
				//		
				//	КонецЕсли;
				//	
				//	зВыработка = тзРВС.Добавить();
				//	зВыработка.Время = 60*(Цел(ВыборкаДетальныеЗаписи.КоличествоЧасов)*60 + (ВыборкаДетальныеЗаписи.КоличествоЧасов- Цел(ВыборкаДетальныеЗаписи.КоличествоЧасов))*100);// - ВремяПростоя3;// - НочныеЧасы;
				//	зВыработка.Сотрудник = Источник.Сотрудник1;
				//	зВыработка.Организация = Источник.Организация;
				//	зВыработка.ВидИспользованияРабочегоВремени = Справочники.уатВидыИспользованияРабочегоВремени.Работа;
				//	зВыработка.ДатаРаботы = Источник.Дата;
				//	зВыработка.Регистратор = Источник.Ссылка;
				//	зВыработка.Маршрут = ВыборкаДетальныеЗаписи.Маршрут;
				//	зВыработка.Период = Источник.Дата;
				//	зВыработка.Дней = 1;
				//	зВыработка.Активность = Истина;
				//	зВыработка.ВидПутевогоЛиста = Источник.ВидПЛ;
				//		НочныеЧасы = 0;
				//КонецЕсли;
				
			Иначе
				Если ЗначениеЗаполнено(Источник.Водитель1) И Не ЗначениеЗаполнено(Источник.Водитель2) Тогда
					//зВыработка = тзРВС.Добавить();
					//МассивСтрок = тзРВС.НайтиСтроки(Новый Структура("Организация, Период, Сотрудник, ВидИспользованияРабочегоВремени", Источник.Организация, НачалоДня(Источник.Дата), Источник.Водитель1, ЮЦАУ.ПолучитьЗначениеПоИдентификатору("ПЗР", Источник.Организация, Источник.Дата)));
					//зВыработка.Время = ЮЦАУ.ПолучитьЗначениеПоИдентификатору("ПЗРВремяАвтобусы", Источник.Организация, Источник.Дата);
					//зВыработка.Сотрудник = Источник.Водитель1;
					//зВыработка.Организация = Источник.Организация;
					//зВыработка.ВидИспользованияРабочегоВремени = ЮЦАУ.ПолучитьЗначениеПоИдентификатору("ПЗР", Источник.Организация, Источник.Дата);
					//зВыработка.ДатаРаботы = Источник.ДатаВыезда;
					//зВыработка.Регистратор = Источник.Ссылка;
					////зВыработка.Маршрут = ВыборкаДетальныеЗаписи.Маршрут;
					//зВыработка.Период = Источник.Дата;
					//зВыработка.Дней = 1;
					//зВыработка.Активность = Истина;
					////зВыработка.ВидПутевогоЛиста = Источник.ВидПЛ;

					Если ВыборкаДетальныеЗаписи.Смена = Перечисления.ЮЦАУ_Смены.ВтораяСмена Тогда
						НочныеЧасы = ПолучитьНочныеДляВторойСмены(Источник);
						//Если ВыборкаДетальныеЗаписи.Маршрут = ЮЦАУ.ПолучитьЗначениеПоИдентификатору("Дежурный", Источник.Организация, Источник.Дата) Тогда
						//	НочныеЧасы = НочныеЧасы - 3600;
						//КонецЕсли;
						Если НочныеЧасы > 0 Тогда
							зВыработка = тзРВС.Добавить();
							зВыработка.Время = НочныеЧасы - ПростойВНочноеВремя;
							зВыработка.Сотрудник = Источник.Водитель1;
							зВыработка.Организация = Источник.Организация;
							зВыработка.ВидИспользованияРабочегоВремени = Справочники.уатВидыИспользованияРабочегоВремени.Ночные;
							зВыработка.ДатаРаботы = Источник.ДатаВыезда;
							зВыработка.Регистратор = Источник.Ссылка;
							//зВыработка.Маршрут = ВыборкаДетальныеЗаписи.Маршрут;
							зВыработка.Период = Источник.Дата;
							зВыработка.Дней = 1;
							зВыработка.Активность = Истина;
							//зВыработка.ВидПутевогоЛиста = Источник.ВидПЛ;
						КонецЕсли;
						//НочныеЧасы = 0;
					КонецЕсли;
					
					зВыработка = тзРВС.Добавить();
					зВыработка.Время = 60*(Цел(ВыборкаДетальныеЗаписи.КоличествоЧасов)*60 + (ВыборкаДетальныеЗаписи.КоличествоЧасов- Цел(ВыборкаДетальныеЗаписи.КоличествоЧасов))*100);// - ВремяПростоя2;// - НочныеЧасы;
					зВыработка.Сотрудник = Источник.Водитель1;
					зВыработка.Организация = Источник.Организация;
					зВыработка.ВидИспользованияРабочегоВремени = Справочники.уатВидыИспользованияРабочегоВремени.Работа;
					зВыработка.ДатаРаботы = Источник.Дата;
					зВыработка.Регистратор = Источник.Ссылка;
					//зВыработка.Маршрут = ВыборкаДетальныеЗаписи.Маршрут;
					зВыработка.Период = Источник.Дата;
					зВыработка.Дней = 1;
					зВыработка.Активность = Истина;
					//зВыработка.ВидПутевогоЛиста = Источник.ВидПЛ;
					Выручка = Ложь;
					НочныеЧасы = 0;
					
				КонецЕсли;
				
				Если ЗначениеЗаполнено(Источник.Водитель2) Тогда
					
					Если НЕ ЗначениеЗаполнено(Источник.Сотрудник2) Тогда
						//МассивСтрок = тзРВС.НайтиСтроки(Новый Структура("Организация, ДатаРаботы, Сотрудник, ВидИспользованияРабочегоВремени", Источник.Организация, НачалоДня(Источник.Дата), Источник.Водитель2, ЮЦАУ.ПолучитьЗначениеПоИдентификатору("СдачаВыручки", Источник.Организация, Источник.Дата)));
						//Если МассивСтрок.Количество() = 0 Тогда 
						//	Если НЕ ВыборкаДетальныеЗаписи.Маршрут = ЮЦАУ.ПолучитьЗначениеПоИдентификатору("Дежурный", Источник.Организация, Источник.Дата) Тогда
						//		
						//		зВыработка = тзРВС.Добавить();
						//		зВыработка.Время = ЮЦАУ.ПолучитьЗначениеПоИдентификатору("СдачаВыручкиВремя", Источник.Организация, Источник.Дата);
						//		зВыработка.Сотрудник = Источник.Водитель2;
						//		зВыработка.Организация = Источник.Организация;
						//		зВыработка.ВидИспользованияРабочегоВремени = ЮЦАУ.ПолучитьЗначениеПоИдентификатору("СдачаВыручки", Источник.Организация, Источник.Дата);
						//		зВыработка.ДатаРаботы = Источник.ДатаВыезда;
						//		зВыработка.Регистратор = Источник.Ссылка;
						//		зВыработка.Маршрут = ВыборкаДетальныеЗаписи.Маршрут;
						//		зВыработка.Период = Источник.Дата;
						//		зВыработка.Дней = 1;
						//		зВыработка.Активность = Истина;
						//		зВыработка.ВидПутевогоЛиста = Источник.ВидПЛ;
						//		Выручка = Истина;
						//	КонецЕсли;
						//КонецЕсли;
						//
						//КонецЕсли;
						
						//МассивСтрок = тзРВС.НайтиСтроки(Новый Структура("Организация, ДатаРаботы, Сотрудник, ВидИспользованияРабочегоВремени", Источник.Организация, НачалоДня(Источник.Дата), Источник.Водитель2, ЮЦАУ.ПолучитьЗначениеПоИдентификатору("ПЗР", Источник.Организация, Источник.Дата)));
						//Если МассивСтрок.Количество() = 0 Тогда 
						//	зВыработка = тзРВС.Добавить();
						//	зВыработка.Время = ЮЦАУ.ПолучитьЗначениеПоИдентификатору("ПЗРВремяАвтобусы", Источник.Организация, Источник.Дата);
						//	зВыработка.Сотрудник = Источник.Водитель2;
						//	зВыработка.Организация = Источник.Организация;
						//	зВыработка.ВидИспользованияРабочегоВремени = ЮЦАУ.ПолучитьЗначениеПоИдентификатору("ПЗР", Источник.Организация, Источник.Дата);
						//	зВыработка.ДатаРаботы = Источник.ДатаВыезда;
						//	зВыработка.Регистратор = Источник.Ссылка;
						//	//зВыработка.Маршрут = ВыборкаДетальныеЗаписи.Маршрут;
						//	зВыработка.Период = Источник.Дата;
						//	зВыработка.Дней = 1;
						//	зВыработка.Активность = Истина;
						//	//зВыработка.ВидПутевогоЛиста = Источник.ВидПЛ;
						//КонецЕсли;
						//МассивСтрок = тзРВС.НайтиСтроки(Новый Структура("Организация, ДатаРаботы, Сотрудник, ВидИспользованияРабочегоВремени", Источник.Организация, НачалоДня(Источник.Дата), Источник.Водитель2, ЮЦАУ.ПолучитьЗначениеПоИдентификатору("Медик", Источник.Организация, Источник.Дата)));
						//Если МассивСтрок.Количество() = 0 Тогда 
						//	зВыработка = тзРВС.Добавить();
						//	зВыработка.Время = ЮЦАУ.ПолучитьЗначениеПоИдентификатору("МедикВремя", Источник.Организация, Источник.Дата);
						//	зВыработка.Сотрудник = Источник.Водитель2;
						//	зВыработка.Организация = Источник.Организация;
						//	зВыработка.ВидИспользованияРабочегоВремени = ЮЦАУ.ПолучитьЗначениеПоИдентификатору("Медик", Источник.Организация, Источник.Дата);
						//	зВыработка.ДатаРаботы = Источник.ДатаВыезда;
						//	зВыработка.Регистратор = Источник.Ссылка;
						//	зВыработка.Маршрут = ВыборкаДетальныеЗаписи.Маршрут;
						//	зВыработка.Период = Источник.Дата;
						//	зВыработка.Дней = 1;
						//	зВыработка.Активность = Истина;
						//	зВыработка.ВидПутевогоЛиста = Источник.ВидПЛ;
						//КонецЕсли;
						
						Если ВыборкаДетальныеЗаписи.Смена = Перечисления.ЮЦАУ_Смены.ВтораяСмена Тогда
							НочныеЧасы = ПолучитьНочныеДляВторойСмены(Источник);
							//Если ВыборкаДетальныеЗаписи.Маршрут = ЮЦАУ.ПолучитьЗначениеПоИдентификатору("Дежурный", Источник.Организация, Источник.Дата) Тогда
							//	НочныеЧасы = НочныеЧасы - 3600;
							//КонецЕсли;
							Если НочныеЧасы > 0 Тогда
								зВыработка = тзРВС.Добавить();
								зВыработка.Время = НочныеЧасы - ПростойВНочноеВремя;
								зВыработка.Сотрудник = Источник.Водитель2;
								зВыработка.Организация = Источник.Организация;
								зВыработка.ВидИспользованияРабочегоВремени = Справочники.уатВидыИспользованияРабочегоВремени.Ночные;
								зВыработка.ДатаРаботы = Источник.ДатаВыезда;
								зВыработка.Регистратор = Источник.Ссылка;
								//зВыработка.Маршрут = ВыборкаДетальныеЗаписи.Маршрут;
								зВыработка.Период = Источник.Дата;
								зВыработка.Дней = 1;
								зВыработка.Активность = Истина;
								//зВыработка.ВидПутевогоЛиста = Источник.ВидПЛ;
							КонецЕсли;
							//НочныеЧасы = 0;
						КонецЕсли;
						
						зВыработка = тзРВС.Добавить();
						зВыработка.Время = 60*(Цел(ВыборкаДетальныеЗаписи.КоличествоЧасов)*60 + (ВыборкаДетальныеЗаписи.КоличествоЧасов- Цел(ВыборкаДетальныеЗаписи.КоличествоЧасов))*100);// - ВремяПростоя2;// - НочныеЧасы;
						зВыработка.Сотрудник = Источник.Водитель2;
						зВыработка.Организация = Источник.Организация;
						зВыработка.ВидИспользованияРабочегоВремени = Справочники.уатВидыИспользованияРабочегоВремени.Работа;
						зВыработка.ДатаРаботы = Источник.Дата;
						зВыработка.Регистратор = Источник.Ссылка;
						//зВыработка.Маршрут = ВыборкаДетальныеЗаписи.Маршрут;
						зВыработка.Период = Источник.Дата;
						зВыработка.Дней = 1;
						зВыработка.Активность = Истина;
						//зВыработка.ВидПутевогоЛиста = Источник.ВидПЛ;
						Выручка = Ложь;
						НочныеЧасы = 0;
						
					КонецЕсли;	
					//Если ЗначениеЗаполнено(Источник.Сотрудник2) Тогда
					//	МассивСтрок = тзРВС.НайтиСтроки(Новый Структура("Организация, ДатаРаботы, Сотрудник, ВидИспользованияРабочегоВремени", Источник.Организация, НачалоДня(Источник.Дата), Источник.Сотрудник2, ЮЦАУ.ПолучитьЗначениеПоИдентификатору("СдачаВыручки", Источник.Организация, Источник.Дата)));
					//	Если МассивСтрок.Количество() = 0 Тогда
					//		Если НЕ ВыборкаДетальныеЗаписи.Маршрут = ЮЦАУ.ПолучитьЗначениеПоИдентификатору("Дежурный", Источник.Организация, Источник.Дата) Тогда
					//			
					//			зВыработка = тзРВС.Добавить();
					//			зВыработка.Время = ЮЦАУ.ПолучитьЗначениеПоИдентификатору("СдачаВыручкиВремя", Источник.Организация, Источник.Дата);
					//			зВыработка.Сотрудник = Источник.Сотрудник2;
					//			зВыработка.Организация = Источник.Организация;
					//			зВыработка.ВидИспользованияРабочегоВремени = ЮЦАУ.ПолучитьЗначениеПоИдентификатору("СдачаВыручки", Источник.Организация, Источник.Дата);
					//			зВыработка.ДатаРаботы = Источник.ДатаВыезда;
					//			зВыработка.Регистратор = Источник.Ссылка;
					//			зВыработка.Маршрут = ВыборкаДетальныеЗаписи.Маршрут;
					//			зВыработка.Период = Источник.Дата;
					//			зВыработка.Дней = 1;
					//			зВыработка.Активность = Истина;
					//			зВыработка.ВидПутевогоЛиста = Источник.ВидПЛ;
					//		КонецЕсли;
					//	КонецЕсли;					
						//МассивСтрок = тзРВС.НайтиСтроки(Новый Структура("Организация, ДатаРаботы, Сотрудник, ВидИспользованияРабочегоВремени", Источник.Организация, НачалоДня(Источник.Дата), Источник.Сотрудник2, ЮЦАУ.ПолучитьЗначениеПоИдентификатору("ПЗР", Источник.Организация, Источник.Дата)));
						//Если МассивСтрок.Количество() = 0 Тогда 
						//	зВыработка = тзРВС.Добавить();
						//	зВыработка.Время = ЮЦАУ.ПолучитьЗначениеПоИдентификатору("ПЗРВремяАвтобусы", Источник.Организация, Источник.Дата);
						//	зВыработка.Сотрудник = Источник.Сотрудник2;
						//	зВыработка.Организация = Источник.Организация;
						//	зВыработка.ВидИспользованияРабочегоВремени = ЮЦАУ.ПолучитьЗначениеПоИдентификатору("ПЗР", Источник.Организация, Источник.Дата);
						//	зВыработка.ДатаРаботы = Источник.ДатаВыезда;
						//	зВыработка.Регистратор = Источник.Ссылка;
						//	//зВыработка.Маршрут = ВыборкаДетальныеЗаписи.Маршрут;
						//	зВыработка.Период = Источник.Дата;
						//	зВыработка.Дней = 1;
						//	зВыработка.Активность = Истина;
						//	//зВыработка.ВидПутевогоЛиста = Источник.ВидПЛ;
						//КонецЕсли;
					//	
					//	Если ВыборкаДетальныеЗаписи.Смена = Перечисления.ЮЦАУ_Смены.ВтораяСмена Тогда
					//		НочныеЧасы = ПолучитьНочныеДляВторойСмены(Источник);
					//		Если ВыборкаДетальныеЗаписи.Маршрут = ЮЦАУ.ПолучитьЗначениеПоИдентификатору("Дежурный", Источник.Организация, Источник.Дата) Тогда
					//			НочныеЧасы = НочныеЧасы - 3600;
					//		КонецЕсли;
					//		Если НочныеЧасы > 0 Тогда
					//			зВыработка = тзРВС.Добавить();
					//			зВыработка.Время = НочныеЧасы - ПростойВНочноеВремя;
					//			зВыработка.Сотрудник = Источник.Сотрудник2;
					//			зВыработка.Организация = Источник.Организация;
					//			зВыработка.ВидИспользованияРабочегоВремени = Справочники.уатВидыИспользованияРабочегоВремени.Ночные;
					//			зВыработка.ДатаРаботы = Источник.ДатаВыезда;
					//			зВыработка.Регистратор = Источник.Ссылка;
					//			зВыработка.Маршрут = ВыборкаДетальныеЗаписи.Маршрут;
					//			зВыработка.Период = Источник.Дата;
					//			зВыработка.Дней = 1;
					//			зВыработка.Активность = Истина;
					//			зВыработка.ВидПутевогоЛиста = Источник.ВидПЛ;
					//		КонецЕсли;
					//		//НочныеЧасы = 0;
					//	КонецЕсли;
					//	
					//	зВыработка = тзРВС.Добавить();
					//	зВыработка.Время = 60*(Цел(ВыборкаДетальныеЗаписи.КоличествоЧасов)*60 + (ВыборкаДетальныеЗаписи.КоличествоЧасов- Цел(ВыборкаДетальныеЗаписи.КоличествоЧасов))*100);// - ВремяПростоя4;// - НочныеЧасы;
					//	зВыработка.Сотрудник = Источник.Сотрудник2;
					//	зВыработка.Организация = Источник.Организация;
					//	зВыработка.ВидИспользованияРабочегоВремени = Справочники.уатВидыИспользованияРабочегоВремени.Работа;
					//	зВыработка.ДатаРаботы = Источник.Дата;
					//	зВыработка.Регистратор = Источник.Ссылка;
					//	зВыработка.Маршрут = ВыборкаДетальныеЗаписи.Маршрут;
					//	зВыработка.Период = Источник.Дата;
					//	зВыработка.Дней = 1;
					//	зВыработка.Активность = Истина;
					//	зВыработка.ВидПутевогоЛиста = Источник.ВидПЛ;
					//							НочныеЧасы = 0;
					
					//КонецЕсли;
					
				КонецЕсли;
				//ИначеЕсли Источник.ВидПЛ = Перечисления.уатВидыПЛ._4М Тогда
				
			КонецЕсли;
			
		КонецЦикла;
			//МассивСтрок = тзРВС.НайтиСтроки(Новый Структура("Организация, ДатаРаботы, Сотрудник, ВидИспользованияРабочегоВремени", Источник.Организация, НачалоДня(Источник.Дата), Источник.Водитель2, ЮЦАУ.ПолучитьЗначениеПоИдентификатору("ПЗР", Источник.Организация, Источник.Дата)));
						Если ЗначениеЗаполнено(Источник.Водитель1) Тогда 
							зВыработка = тзРВС.Добавить();
							зВыработка.Время = ЮЦАУ.ПолучитьЗначениеПоИдентификатору("ПЗРВремяАвтобусы", Источник.Организация, Источник.Дата);
							зВыработка.Сотрудник = Источник.Водитель1;
							зВыработка.Организация = Источник.Организация;
							зВыработка.ВидИспользованияРабочегоВремени = ЮЦАУ.ПолучитьЗначениеПоИдентификатору("ПЗР", Источник.Организация, Источник.Дата);
							зВыработка.ДатаРаботы = Источник.ДатаВыезда;
							зВыработка.Регистратор = Источник.Ссылка;
							//зВыработка.Маршрут = ВыборкаДетальныеЗаписи.Маршрут;
							зВыработка.Период = Источник.Дата;
							зВыработка.Дней = 1;
							зВыработка.Активность = Истина;
							//зВыработка.ВидПутевогоЛиста = Источник.ВидПЛ;
						КонецЕсли;
						Если ЗначениеЗаполнено(Источник.Водитель2) Тогда 
							зВыработка = тзРВС.Добавить();
							зВыработка.Время = ЮЦАУ.ПолучитьЗначениеПоИдентификатору("ПЗРВремяАвтобусы", Источник.Организация, Источник.Дата);
							зВыработка.Сотрудник = Источник.Водитель2;
							зВыработка.Организация = Источник.Организация;
							зВыработка.ВидИспользованияРабочегоВремени = ЮЦАУ.ПолучитьЗначениеПоИдентификатору("ПЗР", Источник.Организация, Источник.Дата);
							зВыработка.ДатаРаботы = Источник.ДатаВыезда;
							зВыработка.Регистратор = Источник.Ссылка;
							//зВыработка.Маршрут = ВыборкаДетальныеЗаписи.Маршрут;
							зВыработка.Период = Источник.Дата;
							зВыработка.Дней = 1;
							зВыработка.Активность = Истина;
							//зВыработка.ВидПутевогоЛиста = Источник.ВидПЛ;
						КонецЕсли;

		тзРВС.Свернуть("Сотрудник, Организация, ВидИспользованияРабочегоВремени, ДатаРаботы, Регистратор, Дней, Период", "Время");
		нзРВС.Загрузить(тзРВС);
		нзРВС.Записать();
		
	КонецЕсли;
	//Автобусные перевозки
КонецПроцедуры	

//КАА
Процедура ОбработатьПроведениеДокумента_уатПутевойЛист(Источник)
	
	нзВыработка = РегистрыНакопления.уатВыработкаСотрудников.СоздатьНаборЗаписей();
	нзВыработка.Отбор.Регистратор.Установить(Источник.Ссылка);
	нзВыработка.Прочитать();
	
	нзРВС = РегистрыНакопления.уатРабочееВремяСотрудников.СоздатьНаборЗаписей();
	нзРВС.Отбор.Регистратор.Установить(Источник.Ссылка);
	нзРВС.Прочитать();
	тзРВС = нзРВС.Выгрузить();
	нзРВС.Очистить();
	
	Записывать = Ложь;
	
	//Зачистка таблицы движений рабочего времени сотрудников: удаление видов времени работа, ночные, простой почасовой 
	СтаршийИндекс = тзРВС.Количество() - 1;
	Для й = -СтаршийИндекс По 0 Цикл
		СтрокаРВС = тзРВС[-й];
		Если СтрокаРВС.ВидИспользованияРабочегоВремени = Справочники.уатВидыИспользованияРабочегоВремени.Работа или 
			СтрокаРВС.ВидИспользованияРабочегоВремени = Справочники.уатВидыИспользованияРабочегоВремени.Ночные или
			СтрокаРВС.ВидИспользованияРабочегоВремени = Справочники.уатВидыИспользованияРабочегоВремени.ПростойПочасовой Тогда
			
			тзРВС.Удалить(СтрокаРВС);   
			
		КонецЕсли;
	КонецЦикла;

	
	//Обработка простоя
	
	ПростойВНочноеВремя = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	уатПутевойЛистПростои.Ссылка КАК Ссылка,
		|	уатПутевойЛистПростои.ВидПростоя КАК ВидПростоя,
		|	уатПутевойЛистПростои.ВключенДвигатель КАК ВключенДвигатель,
		|	уатПутевойЛистПростои.НачалоПростоя КАК НачалоПростоя,
		|	уатПутевойЛистПростои.КонецПростоя КАК КонецПростоя,
		|	уатПутевойЛистПростои.ВремяПростоя КАК ВремяПростоя
		|ИЗ
		|	Документ.уатПутевойЛист.Простои КАК уатПутевойЛистПростои
		|ГДЕ
		|	уатПутевойЛистПростои.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ВыборкаДетальныеЗаписи.ВключенДвигатель Тогда
			ВидИспользованияРабочегоВремени = Справочники.уатВидыИспользованияРабочегоВремени.Работа;
		Иначе
			ВидИспользованияРабочегоВремени = Справочники.уатВидыИспользованияРабочегоВремени.ПростойПочасовой;
			ПростойВНочноеВремя = ПростойВНочноеВремя + ВремяНочьОдинДень(Источник.Ссылка,ВыборкаДетальныеЗаписи.НачалоПростоя,?(Час(ВыборкаДетальныеЗаписи.КонецПростоя)= 0,КонецДня(ВыборкаДетальныеЗаписи.КонецПростоя),ВыборкаДетальныеЗаписи.КонецПростоя));
		КонецЕсли;
		
		ВремяПростоя = ВыборкаДетальныеЗаписи.ВремяПростоя - НачалоДня(ВыборкаДетальныеЗаписи.ВремяПростоя);

		Если ЗначениеЗаполнено(Источник.РежимРаботыТС) Тогда
			Если Источник.РежимРаботыТС.Обед <> Дата(0001,01,01) Тогда
				КонецПростоя = ВыборкаДетальныеЗаписи.НачалоПростоя + ВремяПростоя;
				Если КонецПростоя = НачалоДня(ВыборкаДетальныеЗаписи.НачалоПростоя + 60*60*24) Тогда
					КонецПростоя = КонецПростоя - 1;
				КонецЕсли;	
				ВремяПростоя = ВремяПростоя - (ВремяВходитВИнтервал(ВыборкаДетальныеЗаписи.НачалоПростоя, КонецПростоя, Источник.РежимРаботыТС.НачалоОбеда, Источник.РежимРаботыТС.КонецОбеда));
			КонецЕсли;
		КонецЕсли;
		
		СтрокаРВС = тзРВС.Добавить();                                                                                                                           
		ЗаполнитьСтрокуРабочегоВремениСотрудника(СтрокаРВС, Источник, Источник.Водитель1, ВидИспользованияРабочегоВремени, ВремяПростоя);

		Записывать = Истина;
		
	КонецЦикла;

	//Рабочее время
	Если Источник.ВидПЛ <> Перечисления.уатВидыПЛ._6 Тогда //Все п/л кроме автобусов
		
		Для Каждого СтрокаВВР Из нзВыработка Цикл
			
			Если СтрокаВВР.ПараметрВыработки = Справочники.уатПараметрыВыработки.ВремяВРаботе  Тогда 
				
				Если Источник.ВидПЛ = Перечисления.уатВидыПЛ._4М Тогда
					ВидИспользованияРабочегоВремени = Справочники.уатВидыИспользованияРабочегоВремени.КомандировкаПочасовая;
				Иначе	
					ВидИспользованияРабочегоВремени = Справочники.уатВидыИспользованияРабочегоВремени.Работа;
				КонецЕсли;

				СтрокаРВС = тзРВС.Добавить();                                                                                                                           
				ЗаполнитьСтрокуРабочегоВремениСотрудника(СтрокаРВС, Источник, СтрокаВВР.Сотрудник, ВидИспользованияРабочегоВремени, СтрокаВВР.Количество);
				
				Записывать = Истина;
				
			КонецЕсли;	
			
			Если СтрокаВВР.ПараметрВыработки = Справочники.уатПараметрыВыработки.ВремяНочное Тогда
				
				Если ЗначениеЗаполнено(Источник.РежимРаботыТС) Тогда
					Если Источник.РежимРаботыТС.Обед <> Дата(0001,01,01) Тогда
						НочноеВремя = СтрокаВВР.Количество - ВремяВходитВИнтервал(Источник.ДатаВыезда,Источник.ДатаВозвращения,Источник.РежимРаботыТС.НачалоОбеда,Источник.РежимРаботыТС.КонецОбеда);
					Иначе
						НочноеВремя = СтрокаВВР.Количество;
					КонецЕсли;
				Иначе
					НочноеВремя = СтрокаВВР.Количество;
				КонецЕсли;
				
				Если НочноеВремя = ПростойВНочноеВремя Тогда
					НочноеВремя = 0;
					ПростойВНочноеВремя = 0;
				ИначеЕсли НочноеВремя < ПростойВНочноеВремя Тогда
					НочноеВремя = 0; 
					ПростойВНочноеВремя = ПростойВНочноеВремя - НочноеВремя; 
				ИначеЕсли НочноеВремя > ПростойВНочноеВремя Тогда
					НочноеВремя = НочноеВремя - ПростойВНочноеВремя;
					ПростойВНочноеВремя = 0;
				КонецЕсли;	
				
				Если НочноеВремя > 0 Тогда
					
					СтрокаРВС = тзРВС.Добавить();                                                                                                                           
					ВидИспользованияРабочегоВремени = Справочники.уатВидыИспользованияРабочегоВремени.Ночные;
					ЗаполнитьСтрокуРабочегоВремениСотрудника(СтрокаРВС, Источник, СтрокаВВР.Сотрудник, ВидИспользованияРабочегоВремени, НочноеВремя);
					Записывать = Истина; 
					
				КонецЕсли;
				
				Продолжить;
			КонецЕсли;	
			
			//Спец.работы 
			Если СтрокаВВР.ПараметрВыработки = Справочники.уатПараметрыВыработки.ВремяСпециальнойРаботы  Тогда 
				
				СтрокаРВС = тзРВС.Добавить();                                                                                                                           
				ВидИспользованияРабочегоВремени = ПолучитьЗначениеПоИдентификатору("ВремяСпециальнойРаботы",Источник.Организация,Источник.ДатаВыезда);
				ЗаполнитьСтрокуРабочегоВремениСотрудника(СтрокаРВС, Источник, СтрокаВВР.Сотрудник, ВидИспользованияРабочегоВремени, СтрокаВВР.Количество);
				Записывать = Истина; 
				
			КонецЕсли;	
			
		КонецЦикла;	
		
	ИначеЕсли Источник.ВидПЛ = Перечисления.уатВидыПЛ._6 Тогда //Автобусные перевозки

		Записывать = Истина; 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
	//	|	уатПутевойЛистЗадание.КоличествоЧасов,
		|	уатПутевойЛистЗадание.Смена,
		|	уатПутевойЛистЗадание.Маршрут,    
		|	ЦЕЛ(уатПутевойЛистЗадание.КоличествоЧасов) * 3600 + (уатПутевойЛистЗадание.КоличествоЧасов - ЦЕЛ(уатПутевойЛистЗадание.КоличествоЧасов)) * 100 * 60 КАК РабочееВремя
		|ИЗ
		|	Документ.уатПутевойЛист.Задание КАК уатПутевойЛистЗадание
		|ГДЕ
		|	уатПутевойЛистЗадание.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			НочныеЧасы = ПолучитьНочныеЧасы(Источник, ВыборкаДетальныеЗаписи.Смена);
			//Если ВыборкаДетальныеЗаписи.Маршрут = ЮЦАУ.ПолучитьЗначениеПоИдентификатору("Дежурный", Источник.Организация, Источник.Дата) Тогда
			//	НочныеЧасы = НочныеЧасы - 3600;
			//КонецЕсли;
			Если ЗначениеЗаполнено(Источник.Водитель1) Тогда
					
				//Ночные часы
				Если НочныеЧасы > 0 Тогда
					СтрокаРВС = тзРВС.Добавить();                                                                                                                           
					Время = НочныеЧасы - ПростойВНочноеВремя;
					ЗаполнитьСтрокуРабочегоВремениСотрудника(СтрокаРВС, Источник, Источник.Водитель1, Справочники.уатВидыИспользованияРабочегоВремени.Ночные, Время);
				КонецЕсли;
				
				//Рабочее время
				СтрокаРВС = тзРВС.Добавить();      
				//Время = 60*(Цел(ВыборкаДетальныеЗаписи.КоличествоЧасов)*60 + (ВыборкаДетальныеЗаписи.КоличествоЧасов- Цел(ВыборкаДетальныеЗаписи.КоличествоЧасов))*100);// - ВремяПростоя1;// - НочныеЧасы;
				ЗаполнитьСтрокуРабочегоВремениСотрудника(СтрокаРВС, Источник, Источник.Водитель1, Справочники.уатВидыИспользованияРабочегоВремени.Работа, ВыборкаДетальныеЗаписи.РабочееВремя);
				
			КонецЕсли;
				
			Если ЗначениеЗаполнено(Источник.Водитель2) Тогда
				
				//Ночные часы
				Если НочныеЧасы > 0 Тогда

					СтрокаРВС = тзРВС.Добавить();                                                                                                                           
					Время = НочныеЧасы - ПростойВНочноеВремя;
					ЗаполнитьСтрокуРабочегоВремениСотрудника(СтрокаРВС, Источник, Источник.Водитель2, Справочники.уатВидыИспользованияРабочегоВремени.Ночные, Время);

				КонецЕсли;

				//Рабочее время
				СтрокаРВС = тзРВС.Добавить();      
				//Время = 60*(Цел(ВыборкаДетальныеЗаписи.КоличествоЧасов)*60 + (ВыборкаДетальныеЗаписи.КоличествоЧасов- Цел(ВыборкаДетальныеЗаписи.КоличествоЧасов))*100);// - ВремяПростоя1;// - НочныеЧасы;
				ЗаполнитьСтрокуРабочегоВремениСотрудника(СтрокаРВС, Источник, Источник.Водитель2, Справочники.уатВидыИспользованияРабочегоВремени.Работа, ВыборкаДетальныеЗаписи.РабочееВремя);

			КонецЕсли;
				
		КонецЦикла;
		
		//ОтразитьВыработкуСотрудниковПоМаршрутам(Источник);
		
	КонецЕсли; //Автобусные перевозки 
	
	
	//Подготовительно - заключительные работы      
	ДобавлятьПЗР = Истина;
	ВидИспользованияРабочегоВремени = ЮЦАУ.ПолучитьЗначениеПоИдентификатору("ПЗР", Источник.Организация, Источник.Дата);
	Если Источник.ВидПЛ = Перечисления.уатВидыПЛ._6 Тогда	//Автобусные перевозки 
		ВремяПЗР = ЮЦАУ.ПолучитьЗначениеПоИдентификатору("ПЗРВремяАвтобусы", Источник.Организация, Источник.Дата);	
	Иначе
		
		ВремяПЗР = ЮЦАУ.ПолучитьЗначениеПоИдентификатору("ПЗРВремя", Источник.Организация, Источник.Дата);	
		Если Источник.Дата >= '20231001' Тогда //С 01.10.2023 ПЗР добавляется только для водителей автобусов. Остальным - нет
			ДобавлятьПЗР = Ложь;
		КонецЕсли;	
		
	КонецЕсли;	
	
	Если ДобавлятьПЗР Тогда
	
		Если ЗначениеЗаполнено(Источник.Водитель1) Тогда 
			
			СтрокаРВС = тзРВС.Добавить();      
			ЗаполнитьСтрокуРабочегоВремениСотрудника(СтрокаРВС, Источник, Источник.Водитель1, ВидИспользованияРабочегоВремени, ВремяПЗР);
			
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(Источник.Водитель2) Тогда 
			
			СтрокаРВС = тзРВС.Добавить();      
			ЗаполнитьСтрокуРабочегоВремениСотрудника(СтрокаРВС, Источник, Источник.Водитель2, ВидИспользованияРабочегоВремени, ВремяПЗР);
			
		КонецЕсли;
		
	КонецЕсли;
		
	Если Записывать Тогда
		тзРВС.Свернуть("Сотрудник, Организация, ВидИспользованияРабочегоВремени, ДатаРаботы, Регистратор, Дней, Период", "Время");
		нзРВС.Загрузить(тзРВС);
		нзРВС.Записать();
	КонецЕсли;	
	
	//Учет воды
	нзВода = РегистрыНакопления.ЮЦАУ_РасходВодыПоВидамРабот.СоздатьНаборЗаписей();
	нзВода.Отбор.Регистратор.Установить(Источник.Ссылка);
	нзВода.Прочитать();
	нзВода.Очистить();
	
	Для Каждого СтрЗадание Из Источник.Задание Цикл
		
		Если СтрЗадание.ОбъемВоды > 0 Тогда
			нСтр = нзВода.Добавить();
			
			нСтр.Организация = Источник.Организация;
			нСтр.Период = Источник.Дата;
			нСтр.Участок = СтрЗадание.Подразделение;
			нСтр.КАУ = СтрЗадание.КАУ;
			нСтр.КАУ = СтрЗадание.ОбъемВоды;
		КонецЕсли;
		
	КонецЦикла;
	
	нзВода.Записать();   

	ОтразитьВыработкуСотрудниковПоМаршрутам(Источник);	
	
КонецПроцедуры	
//КАА


//КАА
Функция ПолучитьОсновныеСведенияОПеревозке(ВидПутевогоЛиста) Экспорт
	
	ОсновныеСведенияОПеревозке = Новый Структура("ВидПутевогоЛиста,ВидСообщения,ВидПеревозки", ВидПутевогоЛиста, Неопределено, Неопределено);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЮЦАУ_ОсновныеСведенияОПеревозке.ВидПутевогоЛиста КАК ВидПутевогоЛиста,
		|	ЮЦАУ_ОсновныеСведенияОПеревозке.ВидСообщения КАК ВидСообщения,
		|	ЮЦАУ_ОсновныеСведенияОПеревозке.ВидПеревозки КАК ВидПеревозки
		|ИЗ
		|	РегистрСведений.ЮЦАУ_ОсновныеСведенияОПеревозке КАК ЮЦАУ_ОсновныеСведенияОПеревозке
		|ГДЕ
		|	ЮЦАУ_ОсновныеСведенияОПеревозке.ВидПутевогоЛиста = &ВидПутевогоЛиста";
	
	Запрос.УстановитьПараметр("ВидПутевогоЛиста", ВидПутевогоЛиста);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ОсновныеСведенияОПеревозке, ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
	Возврат ОсновныеСведенияОПеревозке;
	
КонецФункции	

//КАА




//КАА
//Заполняет значениями строку из таблицы рабочего времени сотрудника
Процедура ЗаполнитьСтрокуРабочегоВремениСотрудника(СтрокаРВС,Источник,Сотрудник,ВидИспользованияРабочегоВремени,Время)

	СтрокаРВС.Регистратор = Источник.Ссылка;
	СтрокаРВС.Организация = Источник.Организация;
	СтрокаРВС.Сотрудник = Сотрудник;
	СтрокаРВС.ВидИспользованияРабочегоВремени = ВидИспользованияРабочегоВремени;
	СтрокаРВС.Время = Время;
	СтрокаРВС.ДатаРаботы = Источник.ДатаВыезда;
	СтрокаРВС.Период = Источник.Дата;
	СтрокаРВС.Дней = 1;
	СтрокаРВС.Активность = Истина;

КонецПроцедуры	


Процедура ОтразитьВыработкуСотрудниковПоМаршрутам(Источник)
	
	// Отбирается Водитель1 и Пустой водитель из тч "Задание"
	// Отбирается Водитель2 и Пустой водитель из тч "Задание"
	// Результаты запросов соединяются	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	уатПутевойЛистЗадание.Ссылка КАК Ссылка,
		|	уатПутевойЛистЗадание.Ссылка.Дата КАК Период,
		|	уатПутевойЛистЗадание.Ссылка.Организация КАК Организация,
		|	уатПутевойЛистЗадание.Ссылка.ТранспортноеСредство КАК ТранспортноеСредство,
		|	уатПутевойЛистЗадание.Маршрут КАК Маршрут,  
		|	уатПутевойЛистЗадание.КАУ КАК НоменклатурнаяГруппа,
		|	уатПутевойЛистЗадание.Ссылка.Водитель1 КАК Сотрудник,
		|	ЦЕЛ(уатПутевойЛистЗадание.КоличествоЧасов) * 3600 + (уатПутевойЛистЗадание.КоличествоЧасов - ЦЕЛ(уатПутевойЛистЗадание.КоличествоЧасов)) * 100 * 60 КАК РабочееВремя,
		|	уатПутевойЛистЗадание.КоличествоЕздок КАК КоличествоЕздок,
		|	уатПутевойЛистЗадание.КоличествоПассажиров КАК КоличествоПассажиров,
		|	уатПутевойЛистЗадание.КоличествоКмГруз КАК ПробегСПассажирами,
		|	уатПутевойЛистЗадание.Выручка КАК Выручка
		|ИЗ
		|	Документ.уатПутевойЛист.Задание КАК уатПутевойЛистЗадание
		|ГДЕ
		|	уатПутевойЛистЗадание.Ссылка = &Ссылка
		|	И (уатПутевойЛистЗадание.Водитель = уатПутевойЛистЗадание.Ссылка.Водитель1
		|			ИЛИ уатПутевойЛистЗадание.Водитель = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	уатПутевойЛистЗадание.Ссылка,
		|	уатПутевойЛистЗадание.Ссылка.Дата,
		|	уатПутевойЛистЗадание.Ссылка.Организация,
		|	уатПутевойЛистЗадание.Ссылка.ТранспортноеСредство,
		|	уатПутевойЛистЗадание.Маршрут,
		|	уатПутевойЛистЗадание.КАУ,
		|	уатПутевойЛистЗадание.Ссылка.Водитель2,
		|	ЦЕЛ(уатПутевойЛистЗадание.КоличествоЧасов) * 3600 + (уатПутевойЛистЗадание.КоличествоЧасов - ЦЕЛ(уатПутевойЛистЗадание.КоличествоЧасов)) * 100 * 60,
		|	уатПутевойЛистЗадание.КоличествоЕздок,
		|	уатПутевойЛистЗадание.КоличествоПассажиров,
		|	уатПутевойЛистЗадание.КоличествоКмГруз,
		|	уатПутевойЛистЗадание.Выручка
		|ИЗ
		|	Документ.уатПутевойЛист.Задание КАК уатПутевойЛистЗадание
		|ГДЕ
		|	уатПутевойЛистЗадание.Ссылка = &Ссылка  
		|	И уатПутевойЛистЗадание.Ссылка.Водитель2 <> ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
		|	И (уатПутевойЛистЗадание.Водитель = уатПутевойЛистЗадание.Ссылка.Водитель2
		|			ИЛИ уатПутевойЛистЗадание.Водитель = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка))";	
		
	Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
	ТаблицаМаршруты = Запрос.Выполнить().Выгрузить();

	ДвиженияЮЦАУ_РабочееВремяПоМаршрутам = Источник.Движения.ЮЦАУ_ОборотыПоМаршрутам;
	ДвиженияЮЦАУ_РабочееВремяПоМаршрутам.Записывать = Истина;
	ДвиженияЮЦАУ_РабочееВремяПоМаршрутам.Загрузить(ТаблицаМаршруты);

КонецПроцедуры	

//КАА				



Функция ПолучитьДолжностьСотрудникаУАТ(Сотрудник,Организация,КонПериода) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТекущиеКадровыеДанныеСотрудников.ТекущаяДолжность КАК Должность
	|ИЗ
	|	РегистрСведений.УдалитьТекущиеКадровыеДанныеСотрудников КАК ТекущиеКадровыеДанныеСотрудников
	|ГДЕ
	|	ТекущиеКадровыеДанныеСотрудников.ТекущаяОрганизация = &Организация
	|	И ТекущиеКадровыеДанныеСотрудников.ДатаПриема <= &КонПериода
	|	И (ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения >= &КонПериода
	|			ИЛИ ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения = ДАТАВРЕМЯ(1, 1, 1))
	|	И ТекущиеКадровыеДанныеСотрудников.Сотрудник = &Сотрудник";	
	
	Запрос.УстановитьПараметр("КонПериода", КонПериода);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если  РезультатЗапроса.Следующий() Тогда
		Возврат(РезультатЗапроса.Должность);
	Иначе	
		Возврат(Неопределено);
	КонецЕсли;
	
КонецФункции

Функция ПроверитьВидОбслуживанияТСсОсобымПорядкомУчета(ВидОбслуживанияТС) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВидыОбслуживанияТСсОсобымПорядкомУчета.ВидОбслуживания
	|ИЗ
	|	РегистрСведений.ВидыОбслуживанияТСсОсобымПорядкомУчета КАК ВидыОбслуживанияТСсОсобымПорядкомУчета
	|ГДЕ
	|	ВидыОбслуживанияТСсОсобымПорядкомУчета.ВидОбслуживания = &ВидОбслуживанияТС";
	
	Запрос.УстановитьПараметр("ВидОбслуживанияТС",ВидОбслуживанияТС);
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат(Истина);
	Иначе
		Возврат(Ложь);
	КонецЕсли;
	
КонецФункции	

Процедура уатРемонтныйЛист(Источник)
	
	ДокументСсылка = Источник.Ссылка; 
	
	ДатаНачала = Источник.ДатаНачала;
	ДатаОкончания = Источник.ДатаОкончания;
	
	нзРВС = РегистрыНакопления.уатРабочееВремяСотрудников.СоздатьНаборЗаписей();
	нзРВС.Отбор.Регистратор.Установить(ДокументСсылка);
	нзРВС.Прочитать();
	тзРВС = нзРВС.Выгрузить();
	тзРВССвернуть = нзРВС.Выгрузить();
	
	тзРВССвернуть.Свернуть("Сотрудник","Время");
	
	Записывать = Ложь;
	
	Слесарь = ПолучитьЗначениеПоИдентификатору("Слесарь",Источник.Организация,Источник.Дата);
	
	мПродолжительностьОбеда = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(ДокументСсылка.Организация, ПланыВидовХарактеристик.уатПраваИНастройки.ПродолжительностьОбеда) - '00010101';
	мПродолжительностьРабочегоДня  = 0;
	
	Если НачалоДня(ДатаНачала) = НачалоДня(ДатаОкончания) Тогда
		
		сВремяНочьОдинДень = ВремяНочьОдинДень(ДокументСсылка,ДатаНачала,ДатаОкончания);
		сВремяНочьПервыйДень = 0;
		сВремяНочьПоследнийДень = 0;
		//
		сВремяОдинДень = ДокументСсылка.ДатаНачала - ДокументСсылка.ДатаОкончания;
		сВремяПервыйДень = 0;
		сВремяПоследнийДень = 0;
	Иначе
		сВремяНочьПервыйДень = ВремяНочьПервыйДень(ДокументСсылка,ДатаНачала,ДатаОкончания);
		сВремяНочьПоследнийДень = ВремяНочьПоследнийДень(ДокументСсылка,ДатаНачала,ДатаОкончания);
		сВремяНочьОдинДень = 0;
		//
		сВремяПервыйДень = уатОбщегоНазначения.уатВремяВСекунды(24) - (ДатаНачала - НачалоДня(ДатаНачала));
		сВремяПоследнийДень = ДатаОкончания - НачалоДня(ДатаОкончания);
		сВремяОдинДень = 0;
		
	КонецЕсли;	
	
	сВремяНочь = сВремяНочьПервыйДень + сВремяНочьПоследнийДень + сВремяНочьОдинДень;
	сВремяРаботы = сВремяПервыйДень + сВремяПоследнийДень + сВремяОдинДень; 
	
	сВремяНочь = ?(тзРВССвернуть.Количество() = тзРВС.Количество(),сВремяНочь,0);
	
	Если сВремяНочь > 0 Тогда
		
		нзРВС.Очистить();
		
		Для Каждого СтрРВС Из тзРВС Цикл
			
			сВремяПоФакту = СтрРВС.Время;
			сОтработаноеВремя = Мин(сВремяПоФакту,сВремяРаботы);
			
			Если Слесарь = ПолучитьДолжностьСотрудникаУАТ(СтрРВС.Сотрудник,Источник.Организация,Источник.Дата) Тогда
				ВидИспользованияРабочегоВремени = Справочники.уатВидыИспользованияРабочегоВремени.Работа;
			Иначе
				Если ПроверитьВидОбслуживанияТСсОсобымПорядкомУчета(ДокументСсылка.ВидОбслуживания) Тогда
					ВидИспользованияРабочегоВремени = Справочники.уатВидыИспользованияРабочегоВремени.Работа;
				Иначе	
					ВидИспользованияРабочегоВремени = СтрРВС.ВидИспользованияРабочегоВремени
				КонецЕсли;
			КонецЕсли;
			
			нСтрРВС = нзРВС.Добавить();
			ЗаполнитьЗначенияСвойств(нСтрРВС,СтрРВС);
			нСтрРВС.ВидИспользованияРабочегоВремени = Справочники.уатВидыИспользованияРабочегоВремени.Ночные;
			нСтрРВС.Время = Мин(сВремяНочь,сОтработаноеВремя);
			
			сДневноеВремя = сОтработаноеВремя - сВремяНочь;
			
			Если сДневноеВремя > 0 Тогда
				нСтрРВС = нзРВС.Добавить();
				ЗаполнитьЗначенияСвойств(нСтрРВС,СтрРВС);
				нСтрРВС.ВидИспользованияРабочегоВремени = ВидИспользованияРабочегоВремени;
				нСтрРВС.Время = сДневноеВремя;
			КонецЕсли;	
			
			Записывать = Истина;
			
		КонецЦикла;	
	Иначе
		
		Для Каждого СтрРВС Из нзРВС Цикл
			
			Если СтрРВС.ВидИспользованияРабочегоВремени = Справочники.уатВидыИспользованияРабочегоВремени.Ремонт  Тогда 
				Если Слесарь = ПолучитьДолжностьСотрудникаУАТ(СтрРВС.Сотрудник,Источник.Организация,Источник.Дата) Тогда
					СтрРВС.ВидИспользованияРабочегоВремени = Справочники.уатВидыИспользованияРабочегоВремени.Работа;
					Записывать = Истина;
				ИначеЕсли ПроверитьВидОбслуживанияТСсОсобымПорядкомУчета(ДокументСсылка.ВидОбслуживания) Тогда
					СтрРВС.ВидИспользованияРабочегоВремени = Справочники.уатВидыИспользованияРабочегоВремени.Работа;
					Записывать = Истина;
				КонецЕсли;
			КонецЕсли;	
			
		КонецЦикла;	
		
	КонецЕсли;
	
	Если Записывать Тогда
		нзРВС.Записать();
	КонецЕсли;	
	
	ЗЧ = Источник.Материалы.Выгрузить();
	
	Если Зч.Количество() > 0 Тогда
		нзРНТС = РегистрыСведений.ЮЦАУ_НоменклатураТС.СоздатьНаборЗаписей();
		нзРНТС.Отбор.Регистратор.Установить(ДокументСсылка);
		нзРНТС.Прочитать();         	
		
		Для Каждого Стр Из ЗЧ Цикл
			нЗапись = нзРНТС.Добавить();
			нЗапись.Период = Источник.Дата;
			нЗапись.Регистратор = Источник;
			нЗапись.ТС = Источник.ТС;
			нЗапись.Номенклатура = Стр.Номенклатура;
			нЗапись.Количество = Стр.Количество;
			нЗапись.ДатаУстановки = ?(ЗначениеЗаполнено(Стр.ДатаУстановки), Стр.ДатаУстановки, Источник.ДатаОкончания);
		КонецЦикла;
		
		нзРНТС.Записать();
	КонецЕсли;
	
	нзЗЧ = РегистрыНакопления.уатНоменклатураТС.СоздатьНаборЗаписей();
	нзЗЧ.Отбор.Регистратор.Установить(ДокументСсылка);
	нзЗЧ.Прочитать();
	
	Если  нзЗЧ.Количество() > 0 Тогда 
		// Подготовим таблицу, по которой отберем остатки
		ОтборОстатков = Новый ТаблицаЗначений();
		//ОтборОстатков.Колонки.Добавить("СчетУчета",    Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
		ОтборОстатков.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		ОтборОстатков.Колонки.Добавить("Склад",        Новый ОписаниеТипов("СправочникСсылка.Склады"));
		ОтборОстатков.Колонки.Добавить("Контрагент",   Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
		
		Для Каждого СтрНЗ Из нзЗЧ Цикл
			
			//Если ТипЗнч(СтрНЗ.Номенклатура) <> Тип("СправочникСсылка.Номенклатура") Тогда
			//	Продолжить;
			//КонецЕсли;
			//
			//нСтр = ОтборОстатков.Добавить();
			//СведенияОНоменклатуре = БухгалтерскийУчетПереопределяемый.ПолучитьСчетаУчетаНоменклатуры(ДокументСсылка.Организация, СтрНЗ.Номенклатура, ДокументСсылка.Контрагент, ДокументСсылка.Дата, Ложь);
			//нСтр.СчетУчета = СведенияОНоменклатуре.СчетУчета;
			////нСтр.СчетУчета = ПланыСЧетов.Хозрасчетный.ЗапасныеЧасти;
			//нСтр.Номенклатура = СтрНЗ.Номенклатура;
			//нСтр.Склад = ДокументСсылка.Контрагент;
			//
		КонецЦикла;
		
		//ТаблицаОстатки = УчетТоваров.ПолучитьОстаткиТоваров(
		//ДокументСсылка.МоментВремени(),
		//ДокументСсылка.Организация,
		//Справочники.ПодразделенияОрганизаций.ПустаяСсылка(),
		//ОтборОстатков);
		
		//Для Каждого СтрТО Из ТаблицаОстатки Цикл
		//Если нзЗЧ[СтрТО.НомерСтроки-1].Количество > СтрТО.КоличествоПоСкладу Тогда
		//	СообщениеОбОшибке = "Некорректно заполнена колонка ""Количество"" списка ""Материалы"" по " + СокрЛП(Строка(СтрТО.Номенклатура.Наименование))+ " ("+ СокрЛП(Строка(СтрТО.Номенклатура.Код))+ "). Указанное количество превышает остаток. Остаток:" + Строка(СтрТО.КоличествоПоСкладу) + " ; Не хватает: "+ Строка(нзЗЧ[СтрТО.НомерСтроки-1].Количество - СтрТО.КоличествоПоСкладу);
		//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОбОшибке);
		//КонецЕсли;		
		//КонецЦикла;	
		
	КонецЕсли;
	
	нзСтоимостьЗЧ = РегистрыНакопления.ЮЦАУ_СтоимостьСписанияЗЧ.СоздатьНаборЗаписей();
	нзСтоимостьЗЧ.Отбор.Регистратор.Установить(ДокументСсылка);
	нзСтоимостьЗЧ.Прочитать();
	
	ТаблицаЗЧ = Источник.Материалы.Выгрузить();
	
	Для Каждого Стр Из ТаблицаЗЧ Цикл
		
		ОтборОстатков = Новый ТаблицаЗначений();
		//ОтборОстатков.Колонки.Добавить("СчетУчета",    Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
		ОтборОстатков.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		ОтборОстатков.Колонки.Добавить("Склад",        Новый ОписаниеТипов("СправочникСсылка.Склады"));
		ОтборОстатков.Колонки.Добавить("Контрагент",   Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
		
		ДатаОстатков = КонецДня(?(Стр.ДатаУстановки = Дата(0001,01,01),ДокументСсылка.ДатаОкончания,Стр.ДатаУстановки));
		пМоментВремени = Новый МоментВремени(ДатаОстатков, ДокументСсылка.Ссылка);    
		
		нСтр = ОтборОстатков.Добавить();
		//СведенияОНоменклатуре = БухгалтерскийУчетПереопределяемый.ПолучитьСчетаУчетаНоменклатуры(ДокументСсылка.Организация, Стр.Номенклатура, ДокументСсылка.Контрагент, ДокументСсылка.Дата, Ложь);
		//нСтр.СчетУчета = СведенияОНоменклатуре.СчетУчета;
		//нСтр.СчетУчета = ПланыСЧетов.Хозрасчетный.ЗапасныеЧасти;
		нСтр.Номенклатура = Стр.Номенклатура;
		нСтр.Склад = ДокументСсылка.Контрагент;
		
		//ТаблицаОстаткиСтоимость = УчетТоваров.ПолучитьОстаткиТоваров(
		//пМоментВремени,
		//ДокументСсылка.Организация,
		//Справочники.ПодразделенияОрганизаций.ПустаяСсылка(),
		//ОтборОстатков);
		//ТаблицаОстаткиСтоимость.Свернуть("Номенклатура", "КоличествоПоСкладу, Стоимость");
		
		нЗапись = нзСтоимостьЗЧ.Добавить();
		нЗапись.Период = ДатаОстатков;
		нЗапись.Регистратор = Источник;
		нЗапись.Склад = Источник.Контрагент;
		нЗапись.Номенклатура = Стр.Номенклатура;
		нЗапись.Количество = Стр.Количество;
		//нЗапись.Стоимость = ?(ТаблицаОстаткиСтоимость.Найти(Стр.Номенклатура) <> Неопределено, Стр.Количество * (ТаблицаОстаткиСтоимость.Найти(Стр.Номенклатура).Стоимость / ТаблицаОстаткиСтоимость.Найти(Стр.Номенклатура).КоличествоПоСкладу), 0);	
		
	КонецЦикла;
	
	нзСтоимостьЗЧ.Записать();
	
КонецПроцедуры	

Процедура уатСписаниеТоваров(Источник)
	
	ДокументСсылка = Источник.Ссылка;
	
	ОтборОстатков = Новый ТаблицаЗначений();
	//ОтборОстатков.Колонки.Добавить("СчетУчета",    Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
	ОтборОстатков.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ОтборОстатков.Колонки.Добавить("Склад",        Новый ОписаниеТипов("СправочникСсылка.Склады"));
	ОтборОстатков.Колонки.Добавить("Контрагент",   Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	
	ТаблицаЗЧ = Источник.Товары.Выгрузить();
	
	Для Каждого СтрНЗ Из ТаблицаЗЧ Цикл
		нСтр = ОтборОстатков.Добавить();
		//СведенияОНоменклатуре = БухгалтерскийУчетПереопределяемый.ПолучитьСчетаУчетаНоменклатуры(ДокументСсылка.Организация, СтрНЗ.Номенклатура, ДокументСсылка.Склад, ДокументСсылка.Дата, Ложь);
		//нСтр.СчетУчета = СведенияОНоменклатуре.СчетУчета;
		//нСтр.СчетУчета = ПланыСЧетов.Хозрасчетный.ЗапасныеЧасти;
		нСтр.Номенклатура = СтрНЗ.Номенклатура;
		нСтр.Склад = ДокументСсылка.Склад;
	КонецЦикла;
	
	
	нзСтоимостьЗЧ = РегистрыНакопления.ЮЦАУ_СтоимостьСписанияЗЧ.СоздатьНаборЗаписей();
	нзСтоимостьЗЧ.Отбор.Регистратор.Установить(ДокументСсылка);
	нзСтоимостьЗЧ.Прочитать();
	
	//ТаблицаОстаткиСтоимость = УчетТоваров.ПолучитьОстаткиТоваров(
	//ДокументСсылка.МоментВремени(),
	//ДокументСсылка.Организация,
	//Справочники.ПодразделенияОрганизаций.ПустаяСсылка(),
	//ОтборОстатков);
	//ТаблицаОстаткиСтоимость.Свернуть("Номенклатура", "КоличествоПоСкладу, Стоимость");
	
	Для Каждого Стр Из ТаблицаЗЧ Цикл
		
		нЗапись = нзСтоимостьЗЧ.Добавить();
		нЗапись.Период = Источник.Дата;
		нЗапись.Регистратор = Источник;
		нЗапись.Склад = Источник.Склад;
		нЗапись.Номенклатура = Стр.Номенклатура;
		нЗапись.Количество = Стр.Количество;
		//нЗапись.Стоимость = ?(ТаблицаОстаткиСтоимость.Найти(Стр.Номенклатура) <> Неопределено, Стр.Количество * (ТаблицаОстаткиСтоимость.Найти(Стр.Номенклатура).Стоимость / ТаблицаОстаткиСтоимость.Найти(Стр.Номенклатура).КоличествоПоСкладу), 0);	
		
	КонецЦикла;
	
	нзСтоимостьЗЧ.Записать();
	
КонецПроцедуры	


Процедура уатВыдачаРасходныхМатериалов(Источник)
	
	ДокументСсылка = Источник.Ссылка; 
	
	ЗЧ = Источник.Материалы.Выгрузить();
	
	Если Зч.Количество() > 0 Тогда
		нзРНТС = РегистрыСведений.ЮЦАУ_НоменклатураТС.СоздатьНаборЗаписей();
		нзРНТС.Отбор.Регистратор.Установить(ДокументСсылка);
		нзРНТС.Прочитать();         	
		
		Для Каждого Стр Из ЗЧ Цикл
			нЗапись = нзРНТС.Добавить();
			нЗапись.Период = Источник.Дата;
			нЗапись.Регистратор = Источник;
			нЗапись.ТС = Стр.ТС;
			нЗапись.Номенклатура = Стр.Номенклатура;
			нЗапись.Количество = Стр.Количество;
			нЗапись.ДатаУстановки = Источник.Дата;//?(ЗначениеЗаполнено(Стр.ДатаУстановки), Стр.ДатаУстановки, Источник.ДатаОкончания);
		КонецЦикла;
		
		нзРНТС.Записать();
	КонецЕсли;
	
	нзЗЧ = РегистрыНакопления.уатНоменклатураТС.СоздатьНаборЗаписей();
	нзЗЧ.Отбор.Регистратор.Установить(ДокументСсылка);
	нзЗЧ.Прочитать();
	
	Если  нзЗЧ.Количество() > 0 Тогда 
		// Подготовим таблицу, по которой отберем остатки
		ОтборОстатков = Новый ТаблицаЗначений();
		//ОтборОстатков.Колонки.Добавить("СчетУчета",    Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
		ОтборОстатков.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		ОтборОстатков.Колонки.Добавить("Склад",        Новый ОписаниеТипов("СправочникСсылка.Склады"));
		ОтборОстатков.Колонки.Добавить("Контрагент",   Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
		
		Для Каждого СтрНЗ Из нзЗЧ Цикл
			нСтр = ОтборОстатков.Добавить();
			//СведенияОНоменклатуре = БухгалтерскийУчетПереопределяемый.ПолучитьСчетаУчетаНоменклатуры(ДокументСсылка.Организация, СтрНЗ.Номенклатура, ДокументСсылка.Склад, ДокументСсылка.Дата, Ложь);
			//нСтр.СчетУчета = СведенияОНоменклатуре.СчетУчета;
			//нСтр.СчетУчета = ПланыСЧетов.Хозрасчетный.ЗапасныеЧасти;
			нСтр.Номенклатура = СтрНЗ.Номенклатура;
			нСтр.Склад = ДокументСсылка.Склад;
		КонецЦикла;
		
		//ТаблицаОстатки = УчетТоваров.ПолучитьОстаткиТоваров(
		//ДокументСсылка.МоментВремени(),
		//ДокументСсылка.Организация,
		//Справочники.ПодразделенияОрганизаций.ПустаяСсылка(),
		//ОтборОстатков);
		
		//Для Каждого СтрТО Из ТаблицаОстатки Цикл
		//Если нзЗЧ[СтрТО.НомерСтроки-1].Количество > СтрТО.КоличествоПоСкладу Тогда
		//	СообщениеОбОшибке = "Некорректно заполнена колонка ""Количество"" списка ""Материалы"" по " + СокрЛП(Строка(СтрТО.Номенклатура.Наименование))+ " ("+ СокрЛП(Строка(СтрТО.Номенклатура.Код))+ "). Указанное количество превышает остаток. Остаток:" + Строка(СтрТО.КоличествоПоСкладу) + " ; Не хватает: "+ Строка(нзЗЧ[СтрТО.НомерСтроки-1].Количество - СтрТО.КоличествоПоСкладу);
		//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОбОшибке);
		//КонецЕсли;		
		//КонецЦикла;	
		
	КонецЕсли;
	
	нзСтоимостьЗЧ = РегистрыНакопления.ЮЦАУ_СтоимостьСписанияЗЧ.СоздатьНаборЗаписей();
	нзСтоимостьЗЧ.Отбор.Регистратор.Установить(ДокументСсылка);
	нзСтоимостьЗЧ.Прочитать();
	
	ТаблицаЗЧ = Источник.Материалы.Выгрузить();
	
	Для Каждого Стр Из ТаблицаЗЧ Цикл
		
		ОтборОстатков = Новый ТаблицаЗначений();
		//ОтборОстатков.Колонки.Добавить("СчетУчета",    Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
		ОтборОстатков.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		ОтборОстатков.Колонки.Добавить("Склад",        Новый ОписаниеТипов("СправочникСсылка.Склады"));
		ОтборОстатков.Колонки.Добавить("Контрагент",   Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
		
		ДатаОстатков = КонецДня(ДокументСсылка.Дата);
		пМоментВремени = Новый МоментВремени(ДатаОстатков, ДокументСсылка.Ссылка);    
		
		нСтр = ОтборОстатков.Добавить();
		//СведенияОНоменклатуре = БухгалтерскийУчетПереопределяемый.ПолучитьСчетаУчетаНоменклатуры(ДокументСсылка.Организация, Стр.Номенклатура, ДокументСсылка.Склад, ДокументСсылка.Дата, Ложь);
		//нСтр.СчетУчета = СведенияОНоменклатуре.СчетУчета;
		нСтр.Номенклатура = Стр.Номенклатура;
		нСтр.Склад = ДокументСсылка.Склад;
		
		//ТаблицаОстаткиСтоимость = УчетТоваров.ПолучитьОстаткиТоваров(
		//пМоментВремени,
		//ДокументСсылка.Организация,
		//Справочники.ПодразделенияОрганизаций.ПустаяСсылка(),
		//ОтборОстатков);
		//ТаблицаОстаткиСтоимость.Свернуть("Номенклатура", "КоличествоПоСкладу, Стоимость");
		
		нЗапись = нзСтоимостьЗЧ.Добавить();
		нЗапись.Период = Источник.Дата;
		нЗапись.Регистратор = Источник;
		нЗапись.Склад = Источник.Склад;
		нЗапись.Номенклатура = Стр.Номенклатура;
		нЗапись.Количество = Стр.Количество;
		//нЗапись.Стоимость = ?(ТаблицаОстаткиСтоимость.Найти(Стр.Номенклатура) <> Неопределено, Стр.Количество * (ТаблицаОстаткиСтоимость.Найти(Стр.Номенклатура).Стоимость / ТаблицаОстаткиСтоимость.Найти(Стр.Номенклатура).КоличествоПоСкладу), 0);	
		
	КонецЦикла;
	
	нзСтоимостьЗЧ.Записать();
	
КонецПроцедуры	

Процедура ПодпискаОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	//	
	
	Если ТипЗнч(Источник) =  Тип("ДокументОбъект.уатПутевойЛист") Тогда
		//КАА
		//уатПутевойЛист(Источник);
		ОбработатьПроведениеДокумента_уатПутевойЛист(Источник);
		//КАА
	КонецЕсли;
	
	Если ТипЗнч(Источник) =  Тип("ДокументОбъект.уатРемонтныйЛист") Тогда
		уатРемонтныйЛист(Источник);
	КонецЕсли;	
	
	Если ТипЗнч(Источник) =  Тип("ДокументОбъект.уатСписаниеТоваров") Тогда
		уатСписаниеТоваров(Источник);
	КонецЕсли;	
	
	Если ТипЗнч(Источник) =  Тип("ДокументОбъект.уатВыдачаРасходныхМатериалов") Тогда
		уатВыдачаРасходныхМатериалов(Источник);
	КонецЕсли;	
	//	
КонецПроцедуры

Функция ОкруглитьЧерезСтроку (СуммаДляОкругления) Экспорт
	
	Запятая = Найти(Строка(СуммаДляОкругления),",");
	ЦелыеЧисла = Лев(Строка(СуммаДляОкругления),Запятая);
	Дробь = Прав(Строка(СуммаДляОкругления),СтрДлина(Строка(СуммаДляОкругления))-Запятая);
	
	Если СтрДлина(Дробь) >= 2 Тогда
		Дробь = Лев(Дробь,2);
	Иначе	   
		Дробь = Лев(Дробь + "00000000",2);
	КонецЕсли;	   
	
	фСумма = Число(ЦелыеЧисла+Дробь);
	
	Возврат(фСумма);
	
КонецФункции	

Функция ПолучитьДолжностьФизЛица(ФизическоеЛицо) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТекущиеКадровыеДанныеСотрудников.ФизическоеЛицо,
	|	ТекущиеКадровыеДанныеСотрудников.Сотрудник,
	|	ТекущиеКадровыеДанныеСотрудников.ГоловнаяОрганизация,
	|	ТекущиеКадровыеДанныеСотрудников.ТекущаяОрганизация,
	|	ТекущиеКадровыеДанныеСотрудников.ТекущееПодразделение,
	|	ТекущиеКадровыеДанныеСотрудников.ТекущаяДолжность,
	|	МАКСИМУМ(ТекущиеКадровыеДанныеСотрудников.ДатаПриема) КАК ДатаПриема,
	|	ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения,
	|	ТекущиеКадровыеДанныеСотрудников.ОсновноеРабочееМестоВОрганизации
	//|	ТекущиеКадровыеДанныеСотрудников.ТекущийВидЗанятости,
	//|	ТекущиеКадровыеДанныеСотрудников.УдалитьТекущаяОрганизация
	|ИЗ
	|	РегистрСведений.УдалитьТекущиеКадровыеДанныеСотрудников КАК ТекущиеКадровыеДанныеСотрудников
	|ГДЕ
	|	ТекущиеКадровыеДанныеСотрудников.ФизическоеЛицо = &ФизическоеЛицо
	|
	|СГРУППИРОВАТЬ ПО
	|	ТекущиеКадровыеДанныеСотрудников.ФизическоеЛицо,
	|	ТекущиеКадровыеДанныеСотрудников.Сотрудник,
	|	ТекущиеКадровыеДанныеСотрудников.ГоловнаяОрганизация,
	|	ТекущиеКадровыеДанныеСотрудников.ТекущаяОрганизация,
	|	ТекущиеКадровыеДанныеСотрудников.ТекущееПодразделение,
	|	ТекущиеКадровыеДанныеСотрудников.ТекущаяДолжность,
	|	ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения,
	|	ТекущиеКадровыеДанныеСотрудников.ОсновноеРабочееМестоВОрганизации
	//|	ТекущиеКадровыеДанныеСотрудников.ТекущийВидЗанятости,
	//|	ТекущиеКадровыеДанныеСотрудников.УдалитьТекущаяОрганизация
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаПриема УБЫВ";
	
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат Строка(ВыборкаДетальныеЗаписи.ТекущаяДолжность);
	Иначе
		Возврат Строка("");
	КонецЕсли;
	
КонецФункции	

Процедура ОткрытьФормуДопСведенийДоговора(Договор) Экспорт
	
	Форма = Договор.ПолучитьФорму("Справочник.ДоговорыКонтрагентов.Форма.ФормаДополнительнойИнформации");
	
	Форма.Договор = Договор;
	НаборЗаписей = РегистрыСведений.ЮЦАУ_ДоговорыКонтрагентовДопИнформация.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ДоговорКонтрагента.Установить(Договор);
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() = 1 Тогда
		
		Запись = НаборЗаписей[0];
		Форма.ЭлементыФормы.ПредметДоговора.Значение       = Запись.ПредметДоговора;
		Форма.ЭлементыФормы.ЦенаДоговора.Значение          = Запись.ЦенаДоговора;
		Форма.ЭлементыФормы.ПорядокРасчётов.Значение       = Запись.ПорядокРасчётов;
		Форма.ЭлементыФормы.ОтветственностьСторон.Значение = Запись.ОтветственностьСторон;
		Форма.ЭлементыФормы.СрокДействия.Значение          = Запись.СрокДействия;
		Форма.ЭлементыФормы.СсылкаНаСкан.Значение          = Запись.СсылкаНаСкан;
		
		Форма.ЭлементыФормы.ДатаРегистрации.Значение       = Запись.ДатаРегистрации;
		Форма.ЭлементыФормы.СрокИсполненияОрг.Значение     = Запись.СрокИсполненияОбязательствОрганизацией;
		Форма.ЭлементыФормы.СрокИсполненияКонтр.Значение   = Запись.СрокИсполненияОбязательствКонтрагентом;
		Форма.ЭлементыФормы.ОтметкиОбИсполнении.Значение   = Запись.ОтметкиОбИсполненииОбязательств;
		Форма.ЭлементыФормы.ПринятыеМеры.Значение          = Запись.ПринятыеМеры;
		
	КонецЕсли;
	
	Форма.Открыть();
	
КонецПроцедуры

Функция ОпределитьДеньНедели(НомерДняНедели) Экспорт
	
	Если НомерДняНедели = 1 Тогда
		Возврат "Понедельник";
	ИначеЕсли НомерДняНедели = 2 Тогда
		Возврат "Вторник";
	ИначеЕсли НомерДняНедели = 3 Тогда
		Возврат "Среда";
	ИначеЕсли НомерДняНедели = 4 Тогда
		Возврат "Четверг";
	ИначеЕсли НомерДняНедели = 5 Тогда
		Возврат "Пятница";
	ИначеЕсли НомерДняНедели = 6 Тогда
		Возврат "Суббота";
	Иначе
		Возврат "Воскресенье";
	КонецЕсли;
	
КонецФункции

Процедура ПодпискаНаСобытиеСправочникПередЗаписью(Источник, Отказ) Экспорт
	
	тПользователь = Пользователи.ТекущийПользователь();
	Если НЕ РольДоступна("ЗапретРедактированиеПодразделений_ЮЦАУ") Тогда
		//Отказ = Истина;
	КонецЕсли; 
	
	Если ТипЗнч(Источник) = Тип("СправочникОбъект.ПодразделенияОрганизаций") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГруппыДоступа.Пользователь КАК Пользователь
		|ИЗ
		|	Справочник.ГруппыДоступа КАК ГруппыДоступа
		|ГДЕ
		|	ГруппыДоступа.Профиль = &Профиль
		|	И ГруппыДоступа.Пользователь = &Пользователь";
		
		Запрос.УстановитьПараметр("Пользователь", ПользователиКлиентСервер.ТекущийПользователь());
		Запрос.УстановитьПараметр("Профиль", ПолучитьЗначениеПоИдентификатору("РедактированиеПодразделений"));
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Количество() = 0 Тогда
			Отказ = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПроверкаРолиЗапретКопированияПЛ () Экспорт
	Возврат РольДоступна("ЮЦАУ_ЗапретКопированияПЛ");
КонецФункции

Процедура ПриУстановкеНовогоНомераПриУстановкеНовогоНомера(Источник, СтандартнаяОбработка, Префикс) Экспорт
	
	Если Источник.СчетКасса	= ПланыСчетов.Хозрасчетный.КассаПлатежногоАгента Тогда
		Префикс = "ОК";
	Иначе
		Префикс = "0";
	КонецЕсли;
	
КонецПроцедуры

// Останавливает выполнение кода на заданное время.
//
// Параметры:
//  Секунд - Число - время ожидания в секундах.
//
Процедура Пауза(Секунд) Экспорт
	
	ТекущийСеансИнформационнойБазы = ПолучитьТекущийСеансИнформационнойБазы();
	ФоновоеЗадание = ТекущийСеансИнформационнойБазы.ПолучитьФоновоеЗадание();
	
	Если ФоновоеЗадание = Неопределено Тогда
		Параметры = Новый Массив;
		Параметры.Добавить(Секунд);
		ФоновоеЗадание = ФоновыеЗадания.Выполнить("ОбщегоНазначенияБТС.Пауза", Параметры);
	КонецЕсли;
	
	Попытка
		ФоновоеЗадание.ОжидатьЗавершения(Секунд);
	Исключение
		Возврат;
	КонецПопытки;
	
КонецПроцедуры

//Автобусные перевозки
Функция ПолучитьДанныеМаршрутаВыездаСмены(Выезд, Смена, ВыхБудн, Период, Организация) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЮЦАУДлительностьВыездаСрезПоследних.Длительность КАК Длительность,
	|	ЮЦАУДлительностьВыездаСрезПоследних.НачалоОбеда КАК НачалоОбеда,
	|	ЮЦАУДлительностьВыездаСрезПоследних.КонецОбеда КАК КонецОбеда,
	|	ЮЦАУДлительностьВыездаСрезПоследних.ВремяВыезда КАК ВремяВыезда,
	|	ЮЦАУДлительностьВыездаСрезПоследних.ВремяЗаезда КАК ВремяЗаезда,
	|	ЮЦАУДлительностьВыездаСрезПоследних.НачалоДопОбеда КАК НачалоДопОбеда,
	|	ЮЦАУДлительностьВыездаСрезПоследних.КонецДопОбеда КАК КонецДопОбеда
	|ИЗ
	|	РегистрСведений.ЮЦАУДлительностьВыезда.СрезПоследних(&Период, ) КАК ЮЦАУДлительностьВыездаСрезПоследних
	|ГДЕ
	|	ЮЦАУДлительностьВыездаСрезПоследних.Организация = &Организация
	|	И ЮЦАУДлительностьВыездаСрезПоследних.Выезд = &Выезд
	|	И ЮЦАУДлительностьВыездаСрезПоследних.Смена = &Смена
//	|	И ЮЦАУДлительностьВыездаСрезПоследних.Период < &Период
	|	И ЮЦАУДлительностьВыездаСрезПоследних.ВыхБудн = &ВыхБудн";
	
	Запрос.УстановитьПараметр("Выезд", 			Выезд);
	Запрос.УстановитьПараметр("Организация", 	Организация);
	Запрос.УстановитьПараметр("Период", 		Период);
	Запрос.УстановитьПараметр("Смена", 			Смена);
	Запрос.УстановитьПараметр("ВыхБудн", 		ВыхБудн);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ДанныеМаршрута = Новый Структура;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ДанныеМаршрута.Вставить("Длительность", 	ВыборкаДетальныеЗаписи.Длительность);
		ДанныеМаршрута.Вставить("НачалоОбеда", 		ВыборкаДетальныеЗаписи.НачалоОбеда);
		ДанныеМаршрута.Вставить("КонецОбеда", 		ВыборкаДетальныеЗаписи.КонецОбеда);
		ДанныеМаршрута.Вставить("ВремяВыезда",		ВыборкаДетальныеЗаписи.ВремяВыезда);
		ДанныеМаршрута.Вставить("ВремяЗаезда", 		ВыборкаДетальныеЗаписи.ВремяЗаезда);
		ДанныеМаршрута.Вставить("НачалоДопОбеда", 	ВыборкаДетальныеЗаписи.НачалоДопОбеда);
		ДанныеМаршрута.Вставить("КонецДопОбеда", 	ВыборкаДетальныеЗаписи.КонецДопОбеда);
		
	КонецЦикла;
	
	Возврат ДанныеМаршрута;
	
КонецФункции

Функция ПолучитьНочныеДляПервойСмены(ДокументСсылка)
	
	Ночные = 0;
	
	Если Час(ДокументСсылка.ДатаВыезда) < 6 Тогда
		
		Ночные = уатОбщегоНазначения.уатВремяВСекунды(6) - (ДокументСсылка.ДатаВыезда - НачалоДня(ДокументСсылка.ДатаВыезда));
		
	КонецЕсли;
	
	Возврат Ночные;
	
КонецФункции

Функция ПолучитьНочныеДляВторойСмены(ДокументСсылка)
	
	Ночные = 0;
	
	Если Час(ДокументСсылка.ДатаВозвращения) >= 22 И День(ДокументСсылка.ДатаВозвращения) = День(ДокументСсылка.ДатаВыезда) Тогда
		
		Ночные = ДокументСсылка.ДатаВозвращения - (НачалоДня(ДокументСсылка.ДатаВозвращения) + уатОбщегоНазначения.уатВремяВСекунды(22));
		
	КонецЕсли;
	
	Если День(ДокументСсылка.ДатаВозвращения) > День(ДокументСсылка.ДатаВыезда) И Час(ДокументСсылка.ДатаВозвращения) >= 6 Тогда
		
		Ночные = уатОбщегоНазначения.уатВремяВСекунды(6) + 2 * 3600;
		
	КонецЕсли;
	
	Если (День(ДокументСсылка.ДатаВозвращения) > День(ДокументСсылка.ДатаВыезда) ИЛИ Месяц(ДокументСсылка.ДатаВозвращения) > Месяц(ДокументСсылка.ДатаВыезда)) И Час(ДокументСсылка.ДатаВозвращения) < 6 Тогда
		
		Ночные = ДокументСсылка.ДатаВозвращения - НачалоДня(ДокументСсылка.ДатаВозвращения) + 2 * 3600;
		
	КонецЕсли;
	
	Возврат Ночные;
	
КонецФункции

Функция ПолучитьНочныеДляПолнойСмены(ДокументСсылка)
	
	Ночные = 0;
	
	Если Час(ДокументСсылка.ДатаВыезда) <= 6 Тогда
		
		Ночные = уатОбщегоНазначения.уатВремяВСекунды(6) - (ДокументСсылка.ДатаВыезда - НачалоДня(ДокументСсылка.ДатаВыезда));
		
	КонецЕсли;
	
	Если Час(ДокументСсылка.ДатаВозвращения) >= 22 И День(ДокументСсылка.ДатаВозвращения) = День(ДокументСсылка.ДатаВыезда) Тогда
		
		Ночные = ДокументСсылка.ДатаВозвращения - (НачалоДня(ДокументСсылка.ДатаВозвращения) + уатОбщегоНазначения.уатВремяВСекунды(22));
		
	КонецЕсли;
	
	Если День(ДокументСсылка.ДатаВозвращения) > День(ДокументСсылка.ДатаВыезда) И Час(ДокументСсылка.ДатаВозвращения) > 6 Тогда
		
		Ночные = уатОбщегоНазначения.уатВремяВСекунды(6) + 2 * 3600;
		
	КонецЕсли;
	
	Если Час(ДокументСсылка.ДатаВыезда) <= 6 И День(ДокументСсылка.ДатаВозвращения) > День(ДокументСсылка.ДатаВыезда) Тогда 
		
		Ночные = уатОбщегоНазначения.уатВремяВСекунды(6) - (ДокументСсылка.ДатаВыезда - НачалоДня(ДокументСсылка.ДатаВыезда)) + ДокументСсылка.ДатаВозвращения - НачалоДня(ДокументСсылка.ДатаВозвращения) + 2 * 3600;
		
	КонецЕсли;
	
	Возврат Ночные;
	
КонецФункции

//КАА
Функция ПолучитьНочныеЧасы(ДокументСсылка, Смена)
	
	Ночные = 0;
	Если Смена = Перечисления.ЮЦАУ_Смены.ПерваяСмена Тогда			

		Если Час(ДокументСсылка.ДатаВыезда) < 6 Тогда
			Ночные = уатОбщегоНазначения.уатВремяВСекунды(6) - (ДокументСсылка.ДатаВыезда - НачалоДня(ДокументСсылка.ДатаВыезда));
		КонецЕсли;

	ИначеЕсли Смена = Перечисления.ЮЦАУ_Смены.ВтораяСмена Тогда			
	
		Если Час(ДокументСсылка.ДатаВозвращения) >= 22 И День(ДокументСсылка.ДатаВозвращения) = День(ДокументСсылка.ДатаВыезда) Тогда
			Ночные = ДокументСсылка.ДатаВозвращения - (НачалоДня(ДокументСсылка.ДатаВозвращения) + уатОбщегоНазначения.уатВремяВСекунды(22));
		КонецЕсли;
		
		Если День(ДокументСсылка.ДатаВозвращения) > День(ДокументСсылка.ДатаВыезда) И Час(ДокументСсылка.ДатаВозвращения) >= 6 Тогда
			Ночные = уатОбщегоНазначения.уатВремяВСекунды(6) + 2 * 3600;
		КонецЕсли;
		
		Если (День(ДокументСсылка.ДатаВозвращения) > День(ДокументСсылка.ДатаВыезда) ИЛИ Месяц(ДокументСсылка.ДатаВозвращения) > Месяц(ДокументСсылка.ДатаВыезда)) И Час(ДокументСсылка.ДатаВозвращения) < 6 Тогда
			Ночные = ДокументСсылка.ДатаВозвращения - НачалоДня(ДокументСсылка.ДатаВозвращения) + 2 * 3600;
		КонецЕсли;
		
	ИначеЕсли Смена = Перечисления.ЮЦАУ_Смены.ПолнаяСмена Тогда	
	
		Если Час(ДокументСсылка.ДатаВыезда) <= 6 Тогда
			Ночные = уатОбщегоНазначения.уатВремяВСекунды(6) - (ДокументСсылка.ДатаВыезда - НачалоДня(ДокументСсылка.ДатаВыезда));
		КонецЕсли;
		
		Если Час(ДокументСсылка.ДатаВозвращения) >= 22 И День(ДокументСсылка.ДатаВозвращения) = День(ДокументСсылка.ДатаВыезда) Тогда
			Ночные = ДокументСсылка.ДатаВозвращения - (НачалоДня(ДокументСсылка.ДатаВозвращения) + уатОбщегоНазначения.уатВремяВСекунды(22));
		КонецЕсли;
		
		Если День(ДокументСсылка.ДатаВозвращения) > День(ДокументСсылка.ДатаВыезда) И Час(ДокументСсылка.ДатаВозвращения) > 6 Тогда
			Ночные = уатОбщегоНазначения.уатВремяВСекунды(6) + 2 * 3600;
		КонецЕсли;
		
		Если Час(ДокументСсылка.ДатаВыезда) <= 6 И День(ДокументСсылка.ДатаВозвращения) > День(ДокументСсылка.ДатаВыезда) Тогда 
			Ночные = уатОбщегоНазначения.уатВремяВСекунды(6) - (ДокументСсылка.ДатаВыезда - НачалоДня(ДокументСсылка.ДатаВыезда)) + ДокументСсылка.ДатаВозвращения - НачалоДня(ДокументСсылка.ДатаВозвращения) + 2 * 3600;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Ночные;
	
КонецФункции
//КАА

// Функция возвращает номер документа без префикса организации и лидирующих нулей в записи
// для размещения на печатной форме
//
// Параметры:
//    НомерОбъекта - Строка - номер или код объекта, который преобразуется для вывода на печать.
//    УдалитьПрефиксИнформационнойБазы - Булево - признак удаления префикса информационной базы.
//    УдалитьПользовательскийПрефикс - Булево - признак удаления пользовательского префикса.
// 
// Возвращаемое значение:
//   - Строка - Отформатированный номер документа
//
Функция НомерДокументаНаПечать(Знач НомерОбъекта, УдалитьПрефиксИнформационнойБазы = Ложь, УдалитьПользовательскийПрефикс = Ложь) Экспорт	
	Возврат ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(НомерОбъекта, УдалитьПрефиксИнформационнойБазы, УдалитьПользовательскийПрефикс);
КонецФункции

// Функция получает СНИЛС водителя.
//
// Параметры:
//	Сотрудник - водитель, входящий параметр
//
// Возвращаемое значение:
//	Строка
//
Функция СНИЛСВодителя(Сотрудник) Экспорт
	
	Возврат Сотрудник.ФизическоеЛицо.СтраховойНомерПФР;
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	//|	уатДокументыВодителей.Номер КАК Номер
	//|ИЗ
	//|	Справочник.уатРегистрационныеДокументы КАК уатДокументыВодителей
	//|ГДЕ
	//|	уатДокументыВодителей.ВладелецДокументов = &Сотрудник
	//|	И уатДокументыВодителей.ВидДокумента = &ВидДокумента
	//|	И уатДокументыВодителей.ПринадлежностьДокументов = ЗНАЧЕНИЕ(Перечисление.уатПринадлежностьДокументов.ДокументыВодителя)
	//|	И НЕ уатДокументыВодителей.ПометкаУдаления
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	ДатаВыдачи УБЫВ";
	//
	//Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	//Запрос.УстановитьПараметр("ВидДокумента", Справочники.уатВидыДокументов.СНИЛС);
	//РезультатЗапроса = Запрос.Выполнить();
	//РезультатВыборки = РезультатЗапроса.Выбрать();
	//РезультатВыборки.Следующий();  
	//Если РезультатЗапроса.Пустой() Тогда
	//	Возврат "";
	//Иначе
	//	Возврат РезультатВыборки.Номер;
	//КонецЕсли;
	
КонецФункции      

Процедура ЗапретНаРедактированиеСправочникаПриЗаписи(Источник, Отказ) Экспорт
	
	Отказ = Не РольДоступна("ЮЦАУ_РедактированиеПодразделений");
	Если Не РольДоступна("ЮЦАУ_РедактированиеПодразделений") Тогда
		Сообщить ("У вас нет прав на создание и редактирование Подразделений.");
	КонецЕсли;
	
КонецПроцедуры
