&НаКлиенте
&После("ЗаполнитьПоМониторингуПриВозврате")
Процедура SDLЗаполнитьПоМониторингуПриВозврате(Команда)
	Если ЭтоГлонасс(Объект.ТранспортноеСредство) Тогда
	ОбъектСтруктура = Новый Структура;
	ОбъектСтруктура.Вставить("Организация",           Объект.Организация);
	ОбъектСтруктура.Вставить("ТранспортноеСредство",  Объект.ТранспортноеСредство);
	ОбъектСтруктура.Вставить("ДатаВыезда",            Объект.ДатаВыезда);
	ОбъектСтруктура.Вставить("ДатаВозвращения",       Объект.ДатаВозвращения);
	ОбъектСтруктура.Вставить("СпидометрВыезда",       Объект.СпидометрВыезда);
	ОбъектСтруктура.Вставить("СпидометрВозвращения",  Объект.СпидометрВозвращения);
	ОбъектСтруктура.Вставить("РасчетФактРасходаГСМ",  Объект.РасчетФактРасходаГСМ);
	ОбъектСтруктура.Вставить("Прицепы",               Новый Массив());
	
	Для Каждого ТекПрицеп Из Объект.Прицепы Цикл 
		СтрокаПрицепа = Новый Структура("ТС, СпидометрВыезда, СпидометрВозвращения",
			ТекПрицеп.ТС,
			ТекПрицеп.СчетчикМЧВыезда,
			ТекПрицеп.СчетчикМЧВозвращения);
		ОбъектСтруктура.Прицепы.Добавить(СтрокаПрицепа);
	КонецЦикла;
	
	РезультатСтруктура = Новый Структура;
	
	// РАСЧЕТ.
  	SDL_РассчетГлонасс.РассчитатьЗначенияГлонасс(ОбъектСтруктура, РезультатСтруктура);
	
	НайденныеСтроки = ВыработкаТСсводная.НайтиСтроки(Новый Структура("ПараметрВыработки", 
		ПредопределенноеЗначение("Справочник.уатПараметрыВыработки.ПробегОбщийПоДаннымGPS")));
	Если НайденныеСтроки.Количество() > 0 Тогда 
		СтрокаВыработкиПробег = НайденныеСтроки[0];
	Иначе 
		СтрокаВыработкиПробег = Неопределено;
	КонецЕсли;
	
	НайденныеСтроки = ВыработкаТСсводная.НайтиСтроки(Новый Структура("ПараметрВыработки", 
		ПредопределенноеЗначение("Справочник.уатПараметрыВыработки.ВремяВРаботеПоДаннымGPS")));
	Если НайденныеСтроки.Количество() > 0 Тогда 
		СтрокаВыработкиВремяВРаботе = НайденныеСтроки[0];
	Иначе 
		СтрокаВыработкиВремяВРаботе = Неопределено;
	КонецЕсли;
	
	// Заполнение основных реквизитов.
	Если РезультатСтруктура.Свойство("СчетчикВозвращения") Тогда
		Объект.СпидометрВозвращения = РезультатСтруктура.СчетчикВозвращения;
	КонецЕсли;
	Если РезультатСтруктура.Свойство("СчетчикПоGPS") Тогда 
		
		// {30.09.2024  
		Объект.ПробегПоGPS = РезультатСтруктура.СчетчикПоGPS;
        ТекстПользователю = "ПробегПоGPS: " + Формат(Объект.ПробегПоGPS,"ЧДЦ=0; ЧН=Ноль")+ " км.";
        Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ТекстПользователю;
		Сообщение.Сообщить();
		//  СК 07-02-2024
		// Пересчет одометра по пробегу на возврат
		Если ПересчетОдометраПоПробегуНаВозврат() Тогда
			Объект.ПробегПоGPS = РезультатСтруктура.СчетчикПоGPS;
			Объект.СпидометрВозвращения = Объект.СпидометрВыезда + Объект.ПробегПоGPS; 
		ИначеЕсли ПересчетПробегаПоОдометруНаВозврат() Тогда
			Объект.СпидометрВозвращения = РезультатСтруктура.СчетчикВозвращения;
			Объект.ПробегПоGPS = Объект.СпидометрВозвращения - Объект.СпидометрВыезда;  
		КонецЕсли;	
		// }30.09.2024
	КонецЕсли;
	Если РезультатСтруктура.Свойство("ПробегПоGPS") И Не СтрокаВыработкиПробег = Неопределено Тогда
		СтрокаВыработкиПробег.К1 = Окр(РезультатСтруктура.ПробегПоGPS, 2, РежимОкругления.Окр15как20);
		ЗаписатьСтрокуВыработкиТСсервер(Объект.ТранспортноеСредство, СтрокаВыработкиПробег.ПараметрВыработки, СтрокаВыработкиПробег.К1);
	КонецЕсли;
	Если РезультатСтруктура.Свойство("МоточасыПоGPS") И Не СтрокаВыработкиВремяВРаботе = Неопределено Тогда
		СтрокаВыработкиВремяВРаботе.К1 = ВремяВЧЧ_ММ(РезультатСтруктура.МоточасыПоGPS*3600);
		ЗаписатьСтрокуВыработкиТСсервер(Объект.ТранспортноеСредство, СтрокаВыработкиВремяВРаботе.ПараметрВыработки,
			уатОбщегоНазначения.уатВремяВСекунды(СтрокаВыработкиВремяВРаботе.К1));
	КонецЕсли;
		

	
	ОбновитьПараметрВыработкиТСВременный();
	
	Если РезультатСтруктура.Свойство("РасходТоплива") Тогда
		SDLЗаполнитьГСМПоGPSСервер(РезультатСтруктура);
	Иначе
		ЗаполнитьГСМПоGPSСервер();
	КонецЕсли;

	ОбновитьНадписьПробег();
	ЗаполнитьПробегПоУмолчаниюПриРаботеНаДвухВидахТоплива();
	
	Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура SDLЗаполнитьГСМПоGPSСервер(РезультатСтруктура, флВыезд = Ложь)
	ПараметрыРасчетаГСМ = уатПутевыеЛисты.ПолучитьПараметрыРасчетаРасходаГСМ(Объект);
	
	SDL_РассчетГлонасс.SDLЗаполнитьГСМПоGPSСервер(Объект, ПараметрыРасчетаГСМ, РезультатСтруктура, флВыезд);

	Если флВыезд И ПараметрыРасчетаГСМ.Свойство("ОстатокТопливаВыезд") Тогда
		ОстатокТопливаВыезд = ПараметрыРасчетаГСМ.ОстатокТопливаВыезд;
	ИначеЕсли НЕ флВыезд И ПараметрыРасчетаГСМ.Свойство("ОстатокТопливаВозврат") Тогда
		ОстатокТопливаВозврат = ПараметрыРасчетаГСМ.ОстатокТопливаВозврат;
	КонецЕсли;

КонецПроцедуры


Функция ЭтоГлонасс(ТС)
	Если ТС.ИспользуемаяСистемаGPS = Справочники.уатВнешниеСистемы.НайтиПоНаименованию("FortMonitor") Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

// 30.09.2024
Функция ПересчетОдометраПоПробегуНаВозврат()
	
	Результат = Ложь;
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	SDL_НастройкиФортМонитор.Ссылка КАК Ссылка,
	|	SDL_НастройкиФортМонитор.SDL_ПересчетОдометраПоПробегуНаВозврат КАК SDL_ПересчетОдометраПоПробегуНаВозврат
	|ИЗ
	|	Справочник.SDL_НастройкиФортМонитор КАК SDL_НастройкиФортМонитор
	|ГДЕ
	|	НЕ SDL_НастройкиФортМонитор.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Результат = Выборка.SDL_ПересчетОдометраПоПробегуНаВозврат;
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции	

// 30.09.2024
Функция ПересчетПробегаПоОдометруНаВозврат()
	
	Результат = Ложь;
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	SDL_НастройкиФортМонитор.Ссылка КАК Ссылка,
	|	SDL_НастройкиФортМонитор.SDL_ПересчетПробегаПоОдометруНаВозврат КАК SDL_ПересчетПробегаПоОдометруНаВозврат
	|ИЗ
	|	Справочник.SDL_НастройкиФортМонитор КАК SDL_НастройкиФортМонитор
	|ГДЕ
	|	НЕ SDL_НастройкиФортМонитор.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Результат = Выборка.SDL_ПересчетПробегаПоОдометруНаВозврат;
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции	