
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ЮЦАУ_РабочееВремяПоУчасткам 
	Движения.ЮЦАУ_РабочееВремяПоУчасткам.Записывать = Истина;
	
	Для Каждого ТекСтрокаРабочееВремя Из РабочееВремя Цикл
		
		Для i = 1 По 31 Цикл
			
			Если ТекСтрокаРабочееВремя["Время"+i] > 0 Тогда
				
				Движение = Движения.ЮЦАУ_РабочееВремяПоУчасткам.Добавить();
				Движение.Период = НачалоМесяца(Дата) + (i-1)*24*60*60;
				Движение.Организация = Организация;
				Движение.Участок = Участок;
				Движение.КАУ = КАУ;
				Движение.Сотрудник = ТекСтрокаРабочееВремя.Сотрудник;
				Движение.РабочееВремя = ТекСтрокаРабочееВремя["Время"+i];
				
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры
