
&НаСервере
&ИзменениеИКонтроль("РасчетФОВСервер")
Процедура Бит_РасчетФОВСервер(ВыполнитьПринудительно)
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	ДокОбъект.РасчетФОВ(ВыполнитьПринудительно);
	#Вставка
	// + бит Петянина А.К 20.04.26
	Если Объект.ВидПЛ = Перечисления.уатВидыПЛ._6 Тогда
		стОбед = уатПутевыеЛисты.ДанныеОбедаПоЗаданию(Объект.Задание); 
		уатПутевыеЛисты.ДоработатьТЧФОВ(ДокОбъект.ФактическиОтработанноеВремя, стОбед);	
	КонецЕсли;
	// - бит Петянина А.К 20.04.26
	#КонецВставки
	ЗначениеВРеквизитФормы(ДокОбъект, "Объект");
	ОбновитьДинамическиеКолонкиТЧСервер();
КонецПроцедуры
