
&После("ПСМ_ВыполнитьДействияВФорме")
Процедура SDL_ПСМ_ВыполнитьДействияВФорме(ИдентификаторДействия, СистемаМониторинга, УчетнаяЗапись, ЭтотОбъект, ДопПараметры)
	
	Если СистемаМониторинга = SDL_ФортМонитор.ИмяСистемыФортМонитор() Тогда 
		Если ИдентификаторДействия = "ОбщаяФорма.уатНастройкиМониторинга.НастройкиПСМ" Тогда 
			
			// Открыть настройки системы ФортМонитор
			SDL_ОткрытьНастройкиФортМонитор();
				
		ИначеЕсли ИдентификаторДействия = "Справочник.уатУчетныеЗаписиСистемыМониторинга.ПроверитьПодключение" 
			Или ИдентификаторДействия = "Справочник.SDL_НастройкиФортМонитор.ПроверитьПодключение"
			Тогда 				
			
			Если ЭтотОбъект.Модифицированность Тогда 
				
				ДополнительныеПараметры = Новый Структура("УчетнаяЗапись, Форма", УчетнаяЗапись, ЭтотОбъект);
				
				ОбработкаОповещенияЗаписиФормыУчетнойЗаписи = Новый ОписаниеОповещения("ОбработкаВопросаЗаписиФормыУчетнойЗаписи", 
					уатРаботаСРасширениямиКлиент, ДополнительныеПараметры);
					
				ПоказатьВопрос(ОбработкаОповещенияЗаписиФормыУчетнойЗаписи, "Необходимо сохранить данные учетной записи. Записать?", РежимДиалогаВопрос.ДаНет);
				
			Иначе
			    Токен = ""; 
				SDL_ИмяПараметраСессии = "";
				SDL_ПроверитьПодключениеФортМонитор(УчетнаяЗапись, ЭтотОбъект, Токен,SDL_ИмяПараметраСессии);
				Если ЗначениеЗаполнено(Токен) Тогда
				      уатРаботаСРасширениями.ЗаписатьТокен(УчетнаяЗапись,Токен,SDL_ИмяПараметраСессии);   
					  Оповестить("ОбновленТокенАвторизации",,ЭтотОбъект);
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура SDL_ОткрытьНастройкиФортМонитор()
	
	НастройкаФортМонитор = SDL_ФортМонитор.АктивнаяНастройкаФортМонитор();
	ПараметрыОткрытияФормы = Новый Структура("Ключ", НастройкаФортМонитор);
	
	ОткрытьФорму("Справочник.SDL_НастройкиФортМонитор.Форма.ФормаЭлемента", ПараметрыОткрытияФормы,
		,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры
	
Процедура SDL_ПроверитьПодключениеФортМонитор(УчетнаяЗапись, Форма, Токен,SDL_ИмяПараметраСессии )
	
	РезультатПроверки = SDL_РаботаСHTTPСервисами.ПроверитьАвторизацию(УчетнаяЗапись);
	
	Если ЗначениеЗаполнено(РезультатПроверки.Токен) Тогда 
		Токен = РезультатПроверки.Токен;
		SDL_ИмяПараметраСессии = РезультатПроверки.SDL_ИмяПараметраСессии;    
		//Форма.Модифицированность = Истина; 
		//ОповеститьОбИзменении(УчетнаяЗапись);
	КонецЕсли;
	
	ПоказатьПредупреждение(, РезультатПроверки.ТекстОтвета,, "Проверка подключения Fort Monitor");
	
КонецПроцедуры

Процедура ОбработкаВопросаЗаписиФормыУчетнойЗаписи(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда 
		
		ДополнительныеПараметры.Форма.Записать();
		//SDL_ПроверитьПодключениеФортМонитор(ДополнительныеПараметры.Форма.Объект.Ссылка, ДополнительныеПараметры.Форма);
		
	КонецЕсли;
	
КонецПроцедуры
