&НаСервере
&После("ИнициализацияДанныхАвтомобиляСервер")
Процедура ЮЦ_ИнициализацияДанныхАвтомобиляСервер(флЗаполнитьВодителейПоУмолчанию)
	
	Если Объект.ТранспортноеСредство.ЮЦ_ВыдатьТоплива <> 0 Тогда //ЮЦАУ
		
		Объект.ВыдатьКоличествоГорючего = Объект.ТранспортноеСредство.ЮЦ_ВыдатьТоплива;
	
	КонецЕсли;

КонецПроцедуры

&НаСервере
&После("ПересчетСданногоГСМСервер")
Процедура ЮЦ_ПересчетСданногоГСМСервер()  //если заправляют ... через слив.
	
	Для Каждого ТекСтрока Из Объект.РасходГСМ Цикл
		
		мМассивСтрокСливовГСМ = СливыГСМ.НайтиСтроки(Новый Структура("АЗС", ТекСтрока.ТС));
		
		тзАналогиГСМ = уатОбщегоНазначения.уатПолучитьАналогиГСМ(ТекСтрока.ГСМ);
		
		чСдано = 0;
		Для сч = 0 По мМассивСтрокСливовГСМ.Количество() - 1 Цикл
			//если заправка не проведена - не учитываем
			Если НЕ мМассивСтрокСливовГСМ[сч].Ссылка.Проведен Тогда
				Продолжить;
			КонецЕсли;
			
			//слив ГСМ или его аналога
			мГСМ		= мМассивСтрокСливовГСМ[сч].ГСМ;
			мКоличество = мМассивСтрокСливовГСМ[сч].Количество;
			
			Если тзАналогиГСМ.Найти(мГСМ, "Аналог") <> Неопределено Или	мГСМ = ТекСтрока.ГСМ Тогда
				чСдано = чСдано + мКоличество;
			КонецЕсли;	
		КонецЦикла;	
		//Если ЭтоТехническаяЖидкость(ТекСтрока.ГСМ) Тогда
		//	 ТекСтрока.РасходПоФакту = ТекСтрока.РасходПоНорме;
		//	 ТекСтрока.Активен = истина;
		//КонецЕсли;
		Если ТекСтрока.Выдано <> Окр(чСдано, 3) Тогда
			ТекСтрока.Выдано = ТекСтрока.Выдано + чСдано;
			//Если Объект.Рассчитан Тогда  
			//Если НЕ ЭтоТехническаяЖидкость(ТекСтрока.ГСМ) Тогда
			ПересчетРасходФактВСтрокеСервер(ТекСтрока);
			//КонецЕсли;
			//КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ОбновитьКартинкиСливыГСМ();
	
КонецПроцедуры

&НаКлиенте
Процедура ЮЦ_ВидПЛПриИзмененииПосле(Элемент)
	
	ОсновныеСведенияОПеревозке = ЮЦАУ.ПолучитьОсновныеСведенияОПеревозке(Объект.ВидПЛ);

	Если ОсновныеСведенияОПеревозке.ВидСообщения <> Неопределено Тогда
		Объект.ВидСообщения = ОсновныеСведенияОПеревозке.ВидСообщения;	
	КонецЕсли;	
	
	Если ОсновныеСведенияОПеревозке.ВидПеревозки <> Неопределено Тогда
		Объект.ВидПеревозки = ОсновныеСведенияОПеревозке.ВидПеревозки;	
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ЮЦ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)

	//Заполнение реквизитов для нового документа
	Если Объект.Ссылка.Пустая() Тогда 
 		Если ЗначениеЗаполнено(Объект.ВидПЛ) Тогда
			ОсновныеСведенияОПеревозке = ЮЦАУ.ПолучитьОсновныеСведенияОПеревозке(Объект.ВидПЛ);

			Если ОсновныеСведенияОПеревозке.ВидСообщения <> Неопределено Тогда
				Объект.ВидСообщения = ОсновныеСведенияОПеревозке.ВидСообщения;	
			КонецЕсли;	
			
			Если ОсновныеСведенияОПеревозке.ВидПеревозки <> Неопределено Тогда
				Объект.ВидПеревозки = ОсновныеСведенияОПеревозке.ВидПеревозки;	
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
&После("ВидПЛПриИзмененииСервер")
Процедура ЮЦ_ВидПЛПриИзмененииСервер()
	ОсновныеСведенияОПеревозке = ЮЦАУ.ПолучитьОсновныеСведенияОПеревозке(Объект.ВидПЛ);

	Если ОсновныеСведенияОПеревозке.ВидСообщения <> Неопределено Тогда
		Объект.ВидСообщения = ОсновныеСведенияОПеревозке.ВидСообщения;	
	КонецЕсли;	
	
	Если ОсновныеСведенияОПеревозке.ВидПеревозки <> Неопределено Тогда
		Объект.ВидПеревозки = ОсновныеСведенияОПеревозке.ВидПеревозки;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЗаданиеВыездПриИзменении(Элемент)
	
	ТекСтрокаЗадание = Элементы.Задание.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекСтрокаЗадание.Маршрут) И  НЕ ПустаяСмена(ТекСтрокаЗадание.Смена) И НЕ ПустоеБудни(ТекСтрокаЗадание.ВыходныеБудни)  Тогда//ЗначениеЗаполнено(ТекСтрокаЗадание.Смена) <> Перечисления.ЮЦАУ_Смены.ПустаяСсылка() Тогда
		
		ДанныеМаршрута = ЮЦАУ.ПолучитьДанныеМаршрутаВыездаСмены(ТекСтрокаЗадание.Выезд, ТекСтрокаЗадание.Смена, ТекСтрокаЗадание.ВыходныеБудни, Объект.Дата, Объект.Организация);
		Если ЗначениеЗаполнено(ДанныеМаршрута) Тогда
			
			ЗаполнитьВремяСтрокиЗаданияПоМаршруту(ТекСтрокаЗадание, ДанныеМаршрута);
			
		Иначе
			Сообщить("Некорректно выбран Выезд, Смена или не заполнена аналитика!");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаданиеСменаПриИзменении(Элемент)
		
	ТекСтрокаЗадание = Элементы.Задание.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекСтрокаЗадание.Маршрут) И ЗначениеЗаполнено(ТекСтрокаЗадание.Выезд) И НЕ ПустоеБудни(ТекСтрокаЗадание.ВыходныеБудни) Тогда
		
		ДанныеМаршрута = ЮЦАУ.ПолучитьДанныеМаршрутаВыездаСмены(ТекСтрокаЗадание.Выезд, ТекСтрокаЗадание.Смена, ТекСтрокаЗадание.ВыходныеБудни, Объект.Дата, Объект.Организация);
		Если ЗначениеЗаполнено(ДанныеМаршрута) Тогда
			
			ЗаполнитьВремяСтрокиЗаданияПоМаршруту(ТекСтрокаЗадание, ДанныеМаршрута);
		Иначе
			
			Сообщить("Некорректно выбрана Смена или не заполнена аналитика!");
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаданиеВыходныеБудниПриИзменении(Элемент)
	
	ТекСтрокаЗадание = Элементы.Задание.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекСтрокаЗадание.Маршрут) И  ЗначениеЗаполнено(ТекСтрокаЗадание.Выезд) И НЕ ПустаяСмена(ТекСтрокаЗадание.Смена) Тогда
		
		ДанныеМаршрута = ЮЦАУ.ПолучитьДанныеМаршрутаВыездаСмены(ТекСтрокаЗадание.Выезд, ТекСтрокаЗадание.Смена, ТекСтрокаЗадание.ВыходныеБудни, Объект.Дата, Объект.Организация);
		Если ЗначениеЗаполнено(ДанныеМаршрута) Тогда
			
			ЗаполнитьВремяСтрокиЗаданияПоМаршруту(ТекСтрокаЗадание, ДанныеМаршрута);
		Иначе
			
			Сообщить("Некорректно выбрана Смена или не заполнена аналитика!");
			
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВремяСтрокиЗаданияПоМаршруту(ТекСтрокаЗадание, ДанныеМаршрута)
	Время = Прав(Формат(ДанныеМаршрута.Длительность, "ДЛФ=Т"), 8);
	ТекСтрокаЗадание.КоличествоЧасов = Число(Сред(Время, 1, 2)) + Число(Сред(Время, 4, 2)) / 100;
	
	ВремяВыездаСек = Час(ДанныеМаршрута.ВремяВыезда) * 3600 + Минута(ДанныеМаршрута.ВремяВыезда) * 60 + Секунда(ДанныеМаршрута.ВремяВыезда);
	ВремяЗаездаСек = Час(ДанныеМаршрута.ВремяЗаезда) * 3600 + Минута(ДанныеМаршрута.ВремяЗаезда) * 60 + Секунда(ДанныеМаршрута.ВремяЗаезда);
	
	ДатаНачалаМаршрута = НачалоДня(Объект.ДатаВыезда);
	Если НачалоДня(Объект.ДатаВыезда) <> НачалоДня(Объект.ДатаВозвращения)
		И ВремяВыездаСек < (Объект.ДатаВыезда - НачалоДня(Объект.ДатаВыезда)) Тогда
		ДатаНачалаМаршрута = НачалоДня(Объект.ДатаВозвращения);
	КонецЕсли;
	
	ТекСтрокаЗадание.ВремяУбытия = ДатаНачалаМаршрута + ВремяВыездаСек;
	ТекСтрокаЗадание.ВремяПрибытия = ДатаНачалаМаршрута + ВремяЗаездаСек;
	
	Если ВремяЗаездаСек < ВремяВыездаСек Тогда
		ТекСтрокаЗадание.ВремяПрибытия = ТекСтрокаЗадание.ВремяПрибытия + 24 * 3600;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПустаяСмена(Смена)
	Возврат Смена = Перечисления.ЮЦАУ_Смены.ПустаяСсылка();
КонецФункции

&НаСервере
Функция ПустоеБудни(ВыходныеБудни)
	Возврат ВыходныеБудни = Перечисления.ЮЦАУ_Выходные_праздничные_будни.ПустаяСсылка();
КонецФункции

&НаКлиенте
Процедура ЗаданиеВодительНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтрокаТабличнойЧасти = Элементы.Задание.ТекущиеДанные;
	МассивВодителей = Новый Массив;
	Если ЗначениеЗаполнено(Объект.Водитель1) Тогда
		МассивВодителей.Добавить(Объект.Водитель1);
	КонецЕсли;	
	Если ЗначениеЗаполнено(Объект.Водитель2) Тогда
		МассивВодителей.Добавить(Объект.Водитель2);
	КонецЕсли;	
	Элемент.СписокВыбора.ЗагрузитьЗначения(МассивВодителей);  
	Элемент.КнопкаСоздания = Ложь;

КонецПроцедуры
