Функция ПолучитьНастройки()  Экспорт
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	SDL_НастройкиФортМонитор.Ссылка КАК Ссылка,
	|	SDL_НастройкиФортМонитор.ВерсияДанных КАК ВерсияДанных,
	|	SDL_НастройкиФортМонитор.ПометкаУдаления КАК ПометкаУдаления,
	|	SDL_НастройкиФортМонитор.Код КАК Код,
	|	SDL_НастройкиФортМонитор.Наименование КАК Наименование,
	|	SDL_НастройкиФортМонитор.ИспользоватьФортМонитор КАК ИспользоватьФортМонитор,
	|	SDL_НастройкиФортМонитор.УчетнаяЗапись КАК УчетнаяЗапись,
	|	SDL_НастройкиФортМонитор.СистемаМониторинга КАК СистемаМониторинга,
	|	SDL_НастройкиФортМонитор.ИнтервалЗагрузки КАК ИнтервалЗагрузки,
	|	SDL_НастройкиФортМонитор.ЗагрузитьПробегРасход КАК ЗагрузитьПробегРасход,
	|	SDL_НастройкиФортМонитор.ЗагрузитьДопСведения КАК ЗагрузитьДопСведения,
	|	SDL_НастройкиФортМонитор.ЗагрузитьКоординаты КАК ЗагрузитьКоординаты,
	|	SDL_НастройкиФортМонитор.SDL_ЧасовойПояс КАК SDL_ЧасовойПояс,
	|	SDL_НастройкиФортМонитор.SDL_ЧасовойПоясБазы КАК SDL_ЧасовойПоясБазы,
	|	SDL_НастройкиФортМонитор.SDL_РаботаСHTTPСервисами КАК SDL_РаботаСHTTPСервисами,
	|	SDL_НастройкиФортМонитор.SDL_ПересчетОдометраПоПробегуНаВозврат КАК SDL_ПересчетОдометраПоПробегуНаВозврат,
	|	SDL_НастройкиФортМонитор.SDL_ИспользоватьУниверсальноеВремя КАК SDL_ИспользоватьУниверсальноеВремя,
	|	SDL_НастройкиФортМонитор.SDL_ПересчетПробегаПоОдометруНаВозврат КАК SDL_ПересчетПробегаПоОдометруНаВозврат,
	|	SDL_НастройкиФортМонитор.Предопределенный КАК Предопределенный,
	|	SDL_НастройкиФортМонитор.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных,
	|	SDL_НастройкиФортМонитор.Представление КАК Представление
	|ИЗ
	|	Справочник.SDL_НастройкиФортМонитор КАК SDL_НастройкиФортМонитор";
	
	ТЗ = Запрос.Выполнить().Выгрузить(); 
	СтрокаТЗ = ТЗ[0]; 
	Если НЕ ТЗ.Количество() Тогда
		
		Возврат Неопределено;	
		
	КонецЕсли;
	СтруктураСтроки = Новый Структура;
	Для Каждого Колонка Из ТЗ.Колонки Цикл
		СтруктураСтроки.Вставить(Колонка.Имя, СтрокаТЗ[Колонка.Имя]);
	КонецЦикла;
	
	Возврат СтруктураСтроки;	
	
КонецФункции 
