
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(SDL_НастройкиФортМонитор.Ссылка) КАК КоличествоЭлементов
		|ИЗ
		|	Справочник.SDL_НастройкиФортМонитор КАК SDL_НастройкиФортМонитор
		|ГДЕ
		|	SDL_НастройкиФортМонитор.Ссылка <> &Ссылка
		|	И НЕ SDL_НастройкиФортМонитор.ПометкаУдаления";
	
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	КоличествоПрочихЭлементов = ВыборкаДетальныеЗаписи.КоличествоЭлементов;
	
	Если КоличествоПрочихЭлементов > 0 И Не ПометкаУдаления Тогда 
		
		ОбщегоНазначения.СообщитьПользователю(
			"Запись невозможна. Предусмотрен один активный элемент справочника",,,, Отказ);
		
	ИначеЕсли ПометкаУдаления и КоличествоПрочихЭлементов = 0 Тогда 
		
		ОбщегоНазначения.СообщитьПользователю(
			"Запись невозможна. Предусмотрен один активный элемент справочника",,,, Отказ);
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;
	
	//Если ИспользоватьФортМонитор И Не ПометкаУдаления Тогда 
	//	
	//	Если Не ЗначениеЗаполнено(УчетнаяЗапись) Тогда 
	//		
	//		ОбщегоНазначения.СообщитьПользователю(
	//			"Не заполнена учетная запись мониторинга. (Справочник 'Учетные записи системы мониторинга')", , , , Отказ);
	//		
	//	Иначе
	//		
	//		ПометкаУдаленияУчетнойЗаписи = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(УчетнаяЗапись, "ПометкаУдаления");
	//		Если ПометкаУдаленияУчетнойЗаписи Тогда 
	//			
	//			ОбщегоНазначения.СообщитьПользователю(
	//				"Указанная учетная запись мониторинга не активна. (Справочник 'Учетные записи системы мониторинга')", , , , Отказ);
	//			
	//		КонецЕсли;
	//		
	//	КонецЕсли;
	//	
	//КонецЕсли;
	
КонецПроцедуры
