
&НаСервере
&После("ПриСозданииНаСервере")
Процедура Бит_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Отказ Или Объект.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Родитель = Элементы.Владелец.Родитель;
	
	Флаг = Элементы.Вставить(
		"Бит_НовыйРасчетВремениСмены",
		Тип("ПолеФормы"),
		Родитель,
		Элементы.Владелец);
	Флаг.Вид = ВидПоляФормы.ПолеФлажка;
	Флаг.ПутьКДанным = "Объект.Бит_НовыйРасчетВремениСмены";
	Флаг.Заголовок = НСтр("ru = 'Новый расчет времени смены'");
	
	ДатаНачала = Элементы.Вставить(
		"Бит_ДатаНачалаНовогоРасчетаВремениСмены",
		Тип("ПолеФормы"),
		Родитель,
		Элементы.Владелец);
	ДатаНачала.Вид = ВидПоляФормы.ПолеВвода;
	ДатаНачала.ПутьКДанным = "Объект.Бит_ДатаНачалаНовогоРасчетаВремениСмены";
	ДатаНачала.Заголовок = НСтр("ru = 'Дата начала нового расчета времени смены'");
	
КонецПроцедуры
